{"text": "arXiv:0909.5390v1  [stat.ME]  29 Sep 2009\nErrors-in-variables models: a generalized\nfunctions approach\nVictoria Zinde-Walsh∗\nMcGill University and CIREQ\nRevised version of September 29, 2009\nAbstract\nIdentiﬁcation in errors-in-variables regression models was recently\nextended to wide models classes by S. Schennach (Econometrica, 2007)\n(S) via use of generalized functions. In this paper the problems of non-\nand semi- parametric identiﬁcation in such models are re-examined.\nNonparametric identiﬁcation holds under weaker assumptions than\nin (S); the proof here does not rely on decomposition of generalized\nfunctions into ordinary and singular parts, which may not hold. Con-\nditions for continuity of the identiﬁcation mapping are provided and\na consistent nonparametric plug-in estimator for regression functions\nin the L1 space constructed. Semiparametric identiﬁcation via a ﬁ-\nnite set of moments is shown to hold for classes of functions that are\n∗The support of the Social Sciences and Humanities Research Council of Canada\n(SSHRC), the Fonds qu´ebecois de la recherche sur la soci´et´e et la culture (FRQSC) is grate-\nfully acknowledged. The author thanks participants in the Cowles Foundation conference,\nthe UK ESG, CEA 2009, Stats in the Chateau and CESG meetings and P.C.B.Phillips,\nX. Chen, D. Nekipelov, L.Wang and T.Wootersen for illuminating discussions and sugges-\ntions. An anonymous referee provided a very thorough report containing many important\npoints and suggestions. The remaining errors are all mine.\n1\nexplicitly characterized; unlike (S) existence of a moment generating\nfunction for the measurement error is not required.\nKeywords: errors-in-variables model, generalized functions\n2\n1\nIntroduction\nThe familiar errors in variables model with an unknown regression function,\ng, and measurement error in the scalar variable has the form\nY\n=\ng(X∗) + ∆Y ;\nX\n=\nX∗+ ∆X,\nwhere variables X and Y are observable; X∗and ∆X, ∆Y are not observable.\nA widely used approach makes use of instrumental variables. Suppose that\ninstruments are available and Z represents an identiﬁed projection of X\non the instruments so that additionally X∗= Z −U; assume that U is\nindependent of Z (Berkson-type error from using the instruments) and that\nE[∆Y |Z, U ]\n=\n0;\nE[∆X |Z, U, ∆Y ]\n=\n0;\nE(U)\n=\n0.\nThese assumptions were made by e.g. Hausman et al. (1991) who examined\npolynomial regression. Newey (2001) added another moment condition for es-\ntimation in semiparametric regression leading to two equations for unknown\ng and F, the measurement error distribution (all integrals over (−∞, ∞)) :\nE(Y |Z\n=\nz) =\nZ\ng(z −u)dF(u);\nE(Y X|Z\n=\nz) =\nZ\n(z −u)g(z −u)dF(u).\n3\nDeﬁne Wy(z) ≡E(Y |Z = z); Wxy(z) ≡E(Y (Z −X)|Z = z). The model\nassumptions then can be considered in terms of classes of functions Wy, Wxy, g\nand distribution F that satisfy the equations:\nWy(z)\n=\nZ\ng(z −u)dF(u);\n(1)\nWxy(z)\n=\nZ\n(z −u)g(z −u)dF(u);\nwe say that these functions Wy, Wxy, g , F satisfy model assumptions. The\nfunctions g and F enter in convolutions; this motivates using Fourier trans-\nforms (Ft). Fourier transforms:\nεy(ζ)\n=\nFt(Wy(·));\n(2)\nεxy(ζ)\n=\nFt(Wxy(·));\nγ(ζ)\n=\nFt(g(·));\nthe characteristic function is obtained as φ(ζ) =\nR\neiζudF(u).\nProvided that for some subclass of functions Fourier transforms are well\ndeﬁned, derivatives exist and the convolution theorem applies, (1) is equiva-\nlent to a system with two unknown functions, γ, φ :\nεy(ζ)\n=\nγ(ζ)φ(ζ);\n(3)\niεxy(ζ)\n=\n·γ(ζ)φ(ζ),\n(4)\nwhere\n·γ = dγ\ndζ . S. Schennach (2007) (S) suggested that these equations can\nbe justiﬁed for a wide class of functions if one uses generalized functions,\nspeciﬁcally, those in the space of tempered distributions, T ′ (deﬁned below\nin section 2.1)1.\nAssumption 1.\nThe functions g, Wy, Wxy that satisfy the model as-\n1A referee pointed out that the usual notation for the space of tempered distributions\nis S′, but here we follow the notation in (S).\n4\nsumptions are such that each represents an element in the space of tempered\ndistributions, T ′.\nSome examples of such functions are the class considered in (S, As-\nsumption 1): functions such that |g(x∗)| , |Wy(z)| , |Wxy(z)| are deﬁned and\nbounded by polynomials on R. However, the assumption here allows for very\nwide classes of functions. This class may be diﬃcult to characterize explicitly;\nthe Assumption 1’ below provides an important subclass of locally integrable\nfunctions in T ′.\nConsider functions b(t) for t ∈R that satisfy\nZ\n(1 + t2)−l |b(t)| dt < ∞for some l ≥0.\n(5)\nAssumption 1’.\nThe functions g, Wy, Wxy that satisfy the model as-\nsumptions are such that each satisﬁes (5).\nThe functions g, Wy, Wxy that satisfy (5) satisfy Assumption 1. Any func-\ntion in the space L1 of absolutely integrable functions satisﬁes Assumption\n1’ here but not the Assumption 1 in (S) unless the function is everywhere\nbounded.\nWhile the assumption in (S) extends to polynomial regression\nfunctions or distribution functions for binary choice models (where Ft do not\nexist in the ordinary sense), a regression function that is unbounded at some\npoints is not allowed. There are cases where such properties may arise, e.g.\nfor some hazard functions, for liquidity trap; the more general assumption\nhere accommodates such cases.\nFourier transform is a continuous invertible operator in T ′, all tempered\ndistributions are diﬀerentiable in T ′ (thus\n·γ is deﬁned). Fourier transform\nof an ordinary function of the type considered here may no longer be an\nordinary function (e.g. Ft(const) = δ, the Dirac delta-function that cannot\nbe represented as an ordinary function), and thus is not deﬁned point-wise;\nthus the notation γ(ζ), etc. for the Ft in e.g. (3,4) which we keep here\nfor convenience refers just to the generalized function γ without necessarily\n5\ngiving meaning to values at a point.\nIn the class of functions that satisﬁes the model assumptions denote by\nA the subclass of functions (g, F), by A∗the subclass of functions (g); the\nmapping P : A →A∗is given by P(g, F) = g. Denote by B the class of\nfunctions (Wy, Wxy).\nEquations (1) of model assumptions map A into B\n(mapping M : A →B); Fourier transforms map B into Ft(B), the class\nof functions that are Fourier transforms of functions from B; if equations\n(3,4) could be solved they would provide solutions φ∗= φI(γ ̸= 0) (where\nI(A) = 1 if A is true, zero otherwise) and γ∗if φ ̸= 0; applying inverse\nFourier transform would give g∗= Ft−1(γ∗). This sequence of mappings can\nbe represented as follows:\nA\n(g,F )\nM\n→\nB\n(Wy,Wxy)\nF t\n→Ft(B)\n(εy,εxy)\nS→Ft( ˜A)\n(φ∗,γ∗)\n→Ft(A∗)\n(γ∗)\nF t−1\n→A∗\n(g∗).\n(6)\nIf (6) provides the same result as P so that g∗≡g (and γ∗≡γ) then g can\nbe identiﬁed from the functions (Wy, Wxy) with the identiﬁcation mapping\nM∗: B →A∗\n(7)\ngiven by composition of the last ﬁve mappings in (6). The most challenging\npart is in solving the equations to establish the mapping (for γ∗≡γ)\nS : Ft(B)\n(εy,εxy)\n→Ft( ˜A)\n(φ∗,γ)\n(8)\nTwo additional assumptions are similar to those in (S) and are standard.\nAssumption 2. The function φ(ζ) is continuous, continuously diﬀeren-\ntiable on R; and φ(ζ) ̸= 0.\nIn terms of the model this implies a further condition that absolute mo-\nment of U exist.\nAssumption 3. Support of generalized function γ coincides with |ζ| ≤\n¯ζ where ¯ζ > 0 and could be inﬁnite.\n6\nUnder Assumptions 1-3 identiﬁcation is possible as shown in Theorem 1\nof this paper; the theorem in (S) asserts an analytic formula (S, (13)) that\nrelies on a decomposition that may not hold.\nWhen the errors-in-variables problem is examined in the space of tem-\npered distributions the corresponding (weak) topology is that of the space\nT ′; in that topology the mappings Ft, Ft−1 are known to be continuous,\nhowever, the mapping (8) may be discontinuous, rendering the identiﬁca-\ntion mapping (7) discontinuous as well thus implying ill-posedness of the\nproblem. One reason for this is that a too thin-tailed characteristic func-\ntion may mask high-frequency components in the Fourier transform of the\nregression function. Theorem 1 here provides a condition under which con-\ntinuity obtains. When identiﬁcation is provided by a continuous mapping\nnonparametric plug-in estimation is possible as long as Fourier transforms\nof the conditional moment functions can be consistently estimated in T ′;\nthis applies e.g. if the regression function is in the L1 space; Proposition 2\nestablishes this result.\nIdentiﬁcation in classes of parametric functions requires that the mapping\nfrom the parameter space to the function space be (at least locally) invert-\nible. (S) uses generalized functions to widen classes of parametric functions\nfor which identiﬁcation is provided by a ﬁnite number of moment condi-\ntions; in particular she expands classes of L1 functions to which the results\nof Wang and Hsiao (1995, 2009) apply and also allows sums of such func-\ntions with polynomial functions, where before polynomial functions were\nconsidered only by themselves in Hausman et al. (1991). Her results rely\non existence of a moment generating function for the measurement error\nand use special weighting functions (some of which are improperly deﬁned).\nHere general classes of functions where such identiﬁcation is achievable are\nexplicitly characterized rather than via existence of moments conditions (as\nin S, Assumption 6), the requirement of a moment generating function for\nmeasurement error is avoided; appropriate weighting functions are given.\n7\nSection 2 deals with identiﬁcation and well-posedness in the non-parametric\ncase. Section 3 examines identiﬁcation for the semiparametric model. Proofs\nare in Appendix A. Appendix B provides an explanation of the claims about\nthe main errors in (S).\n2\nNon-parametric identiﬁcation\nIn the ﬁrst part of this section known results on generalized functions that\nconﬁrm the existence and continuity of some of the mappings in (6) are\nprovided, in particular, for the Fourier transform and its inverse. Other map-\npings, such as (8) require special treatment because they involve multiplica-\ntion of generalized functions. Multiplication in spaces of generalized functions\ncannot be deﬁned (Schwartz’s impossibility result, 1954, see also Kaminski\nand Rudnicki (1991) for examples) although there are cases when speciﬁc\nproducts are known to exist. Here conditions under which some generalized\nfunctions can be multiplied by some continuous functions to obtain general-\nized functions are provided. With this additional insight the existence and\ncontinuity of the mappings can be examined.\nIn the second part of this\nsection the identiﬁcation result is proved and suﬃcient conditions for the\nidentiﬁcation mapping to be continuous are provided. A proposition about\nconsistent (in topology of T ′) nonparametric estimation that in particular\napplies to functions in space L1 completes this section.\n2.1\nResults about generalized functions and existence\nand continuity of mappings\nAll the known results in this section are in Schwartz (1966), Gel’fand and\nShilov’s monograph (vol.1 and 2, 1964) - (GS) and in Lighthill (1959)- (L);\nthey are listed for the convenience of the reader. The sequential approach\nof Mikusinski in Antonisek et al (1973) is also referred to here. A somewhat\n8\ndistinct approach to multiplication by a continuous function in the space of\ngeneralized functions is developed at the end of this section to explain the\nvalidity of some of the mappings in (6).\nDeﬁnitions of generalized function spaces usually start with a topological\nlinear space of well-behaved ”test functions”, G. Two most widely used spaces\nare G = D and G = T (usually denoted S in the literature). The linear\ntopological space of inﬁnitely diﬀerentiable functions with ﬁnite support D ⊂\nC∞(R), where C∞(R) is the space of all inﬁnitely diﬀerentiable functions;\nconvergence is deﬁned for a sequence of functions that are zero outside a\ncommon bounded set and converge uniformly together with derivatives of all\norders. The space T ⊂C∞(R) of test functions is deﬁned as:\nT =\n\u001a\ns ∈C∞(R) :\n\f\f\f\f\ndks(t)\ndtk\n\f\f\f\f = O(|t|−l) as t →∞, for integer k ≥0, l > 0\n\u001b\n,\nk = 0 corresponds to the function itself; |·| is the absolute value;\nthese\nfunctions go to zero faster than any power. A sequence in T converges if in\nevery bounded region the product of |t|l (for any l) with any order derivative\nconverges uniformly.\nA generalized function, b, is deﬁned by an equivalence class of weakly\nconverging sequences of test functions in G :\nb =\n\u001a\n{bn} : bn ∈G, such that for any s ∈G, lim\nn→∞\nZ\nbn(t)s(t)dt = (b, s) < ∞\n\u001b\n.\nAn alternative equivalent deﬁnition is that b is a linear continuous functional\non G with values deﬁned by (b, s)2. The linear topological space of generalized\nfunctions is denoted G′; the topology is that of convergence of values of\nfunctionals for any converging sequence of test functions (weak topology);\nG′ is complete in that topology. For G = D or T the spaces are D′ and T ′,\n2As a referee pointed out this is the more commonly used deﬁnition of generalized func-\ntion; the one above (used by S) is a necessary and suﬃcient condition and thus represents\nan equivalent characterization.\n9\ncorrespondingly. It is easily established that D ⊂T; T ′ ⊂D′ and that D′\nhas a weaker topology than T ′, meaning that any sequence that converges in\nT ′ converges in D′, but there are sequences that converge in D′, but not in\nT ′. The space T ′ is also called the space of tempered distributions.\nAny generalized function b in T ′ or\nD′ is (weakly) inﬁnitely diﬀeren-\ntiable: the generalized function b(k) is the k −th order generalized derivative\ndeﬁned by (b(k), s) = (−1)k (b, s(k)). The diﬀerentiation operator is continu-\nous in these spaces. For any probability distribution function F on Rk the\ndensity function exists as a generalized function (see e.g., Zinde-Walsh, 2008)\nand continuously depends on the distribution function, thus the generalized\nderivative of F, generalized density function f, is in T ′.\nAny locally summable (integrable on any bounded set) function b(t) de-\nﬁnes a generalized function b in D′ by\n(b, s) =\nZ\nb(t)s(t)dt;\n(9)\nany such function that additionally satisﬁes (5) similarly by (9) deﬁnes a gen-\neralized function b in T ′. A distinction between functions in the ordinary sense\n(a pointwise mapping from the domain of deﬁnition into the reals or complex\nnumbers) and generalized functions is that generalized functions are not de-\nﬁned pointwise. Generalized functions deﬁned via (9) by ordinary functions\nb(t) are called regular functions; we can refer to them as ordinary regular\nfunctions in G′. The functions F, g, Wy, Wxy are ordinary regular functions\nin T ′ (and thus in D′) if they satisfy Assumption 1’.\nIf a generalized function b is such that a representation (9) does not hold,\nit is said that b is singular, so any b ∈G′ is either regular or singular. A well-\nknown singular generalized function is the δ−function: δ : (δ, s) = s(0). Any\ngeneralized function in D′ or T ′ is a generalized ﬁnite order derivative of a\ncontinuous function. An ordinary function that deﬁnes a generalized function\nis regular if it integrates to a continuous function and singular otherwise.\n10\nFor example, the ordinary function b(t) = |t|−3\n2 deﬁnes a singular generalized\nfunction; it does not integrate to a continuous function; it does not satisfy\n(9), in fact (see GS, v.1, p.51) it deﬁnes a generalized function by\n(b, s) =\nZ ∞\n0\nt−3\n2 {s(t) + s(−t) −2s(0)} dt.\n(10)\nNo special treatment is needed to consider complex-valued generalized\nfunctions; all the same properties hold. For s ∈T or D Fourier transform\nFt(s) =\nR\ns(t)eitζdt exists and is in T. For b ∈T ′ : (Ft(b), s) = (b, Ft(s)),\nso Ft(b) ∈T ′. Fourier transform deﬁnes a continuous and continuously in-\nvertible linear operator in T ′ (but not for D′). Thus Fourier transforms of\nWy, Wxy, g, and of the generalized derivative, f, of F exist in T ′ and their\ninverse Fourier transforms coincide with the original functions. Since all the\nfunctions are diﬀerentiable as generalized functions\n·γ exists in T ′. By As-\nsumption 2 the characteristic function φ is continuous, as is its derivative,\n·\nφ;\nthey are regular ordinary functions in T ′.\nSince G′ does not have a multiplicative structure, products and convolu-\ntions can be deﬁned for speciﬁc pairs only and generally exist only for special\nclasses. The product between a generalized function in T ′ and a function\nfrom C∞with all derivatives bounded by polynomial functions exists. This\nclass of multipliers is denoted by OM. Convolution of Fourier transforms of\ngeneralized functions with Fourier transforms of functions from OM exists\nand the convolution theorem applies. Products and convolutions may ex-\nist for other speciﬁc pairs of generalized functions. When such convolutions\nand products of their Fourier transforms exist as generalized functions the\nconvolution theorem similarly applies to such pairs.\nConvolution Theorem.\nIf for b1, b2 ∈T ′, convolution b1 ∗b2 ∈T ′,\nproduct Ft(b1) · Ft(b2) ∈T ′, then Ft(b1 ∗b2) = Ft(b1) · Ft(b2).\nThe proof of this theorem uses exactly the same sequential argument\nas in Antonisek et al (1973), where it utilized the speciﬁc delta-convergent\n11\nsequences; the only diﬀerence here is that the argument can be applied to\nany sequence in the equivalence class that deﬁnes every given generalized\nfunction.\nTo consider the product of a generalized function with a continuous func-\ntion that may not be inﬁnitely diﬀerentiable, the property that the product\ndoes not depend on the sequence that deﬁnes the generalized function has\nto be made a requirement. We thus say that ab for b ∈G′ and continuous a\nis deﬁned in G′ if for any sequence bn from the equivalence class of b there\nexists a sequence (ab)n in G such that for any ψ ∈G\nlim\nZ\na(x)bn(x)ψ(x)dx exists and equals lim\nZ\n(ab)n (x)ψ(x)dx.\n(11)\nDenote by 0n a zero-convergent sequence that belongs to the equivalence\nclass deﬁning the function that is identically zero in G′.\nProposition 1 For the product ab between a continuous function a and\nb ∈G′ to be deﬁned in G′ it is necessary and suﬃcient that (i) (11) hold for\nsome sequence ˜bn in the class that deﬁnes b and (ii) for any zero-convergent\nsequence, 0n(x),\nlim\nZ\na(x)0n(x)ψ(x)dx = 0.\n(12)\nProof.\nAny sequence bn diﬀers from a speciﬁc ˜bn by a zero-convergent sequence.■\nHere we consider functions that stem from the model assumptions. Ad-\nditionally, we distinguish the following cases.\nCase 1. Support of γ is a bounded set: ¯ζ < ∞.\nCase 2. The function φ−1 satisﬁes (5).\nCase 3. The function φ ∈OM.\nLemma 1 Under Assumptions 1-3\n(i) the products γφ and γ ˙φ are deﬁned in T ′ and in D′;\n(ii) for ˜φ\n−1 = φ−1(ζ)I(|ζ| < ¯ζ) the product (γφ) · ˜φ\n−1 is always deﬁned\nin D′;\n12\n(iii) if either case 1 applies or both cases 2 and 3 apply the product (γφ) ·\n˜φ\n−1 is deﬁned in T ′;\n(iv) if neither case 1 nor case 2 applies the product may not be deﬁned in\nT ′.\nProof. See Appendix.\nFrom Lemma 1 existence of products to justify the convolution theorem\nand thus equations (3,4) follows. The mapping (8) involves solving equations\n(3,4) for the unknown functions and requires multiplication by φ−1; as one\ncan see from Lemma 1 existence of such products in T ′ is not guaranteed.\n2.2\nThe nonparametric identiﬁcation theorem\nThis section contains two results. The ﬁrst is Theorem 1 that proves the\nexistence of the identiﬁcation mapping M∗under Assumptions 1-3. It diﬀers\nfrom the statement in (S, Theorem 1) in three ways: ﬁrst, Assumption 1\n(and even the more restrictive Assumption 1’) of this paper is more general;\nsecond, it does not rely on decomposition of generalized functions3; third, it\nprovides the condition under which the mapping is obtained via operations\nin the space T ′ and discusses the continuity of the identiﬁcation mapping.\nThe second result is Proposition 2 that shows that when continuity holds,\nconsistent (in the topology of T ′) plug-in non-parametric estimation of the\nregression function is possible, e.g. for functions in space L1.\nTheorem 1 For functions satisfying model assumptions and Assumptions\n1-3 the mapping M∗in (7) exists and provides identiﬁcation for g; if condi-\ntions of (iii) of Lemma 1 are satisﬁed the mapping is deﬁned via operations\nin T ′; it can be discontinuous under condition (iv) of Lemma 1.\nProof. See Appendix.\n3There is no known decomposition in the space of generalized functions into generalized\nfunctions corresponding to ordinary functions and to singular functions, claimed in (S);\nthe pointwise argument provided in (S, 2007, Supplementary Material) is incorrect (see\nAppendix B).\n13\nThe implication of this Theorem is that the identiﬁcation result holds\nunder the general assumptions 1-3. If φ is too thin-tailed, however, the map-\nping whereby the identiﬁcation is achieved may not be continuous: this point\nis illustrated by the example in the proof of Theorem 1 where high frequency\ncomponents bn are magniﬁed by multiplication with φ−1 from a thin-tailed\ndistribution; this produces inverse Fourier Transforms that diverge.\nContinuity requires that the mapping M given by the model assumptions\nbe continuous in T ′. Continuity in T ′ allows for a consistent (in T ′) plug-in\nestimator; the following Proposition provides suﬃcient conditions. Denote by\n→T ′ convergence in topology of T ′. Following Gel’fand and Vilenkin (1964)\nwe deﬁne a random generalized function as the random continuous functional\non the space of test functions.\nProposition 2 (a) Under the conditions of Theorem 1 suppose that\nWyn, Wxyn are random generalized functions (estimators) that satisfy model\nassumptions and Assumptions 1-3 together with some (unknown) functions\ngn, Fn; condition (iii) of Lemma 1 is satisﬁed; φn ∈OM; for εyn = Ft(Wyn),\nεxyn = Ft(Wxyn) assume that the Fourier transforms satisfy: εyn(ζ) is con-\ntinuous and non-zero a.e. on supp(γ) and iεxyn(ζ) −˙εyn(ζ) is continuous\nand that\nPr(εyn(ζ)\n→\nT ′εy(ζ)) →1;\n(13)\nPr(εxyn(ζ)\n→\nT ′εxy(ζ)) →1,\nthen it is possible to ﬁnd a sequence gn(x) such that Pr(gn(x) →T ′ g(x)) →1.\n(b) Suppose that the function g(x) ∈L1. Then there exists a sequence of\nstep function estimators, gn, such that\nPr(gn(x) →T ′ g(x)) →1.\nProof. See Appendix.\nConvergence of the estimators is in the weak topology of space T ′ of\n14\ngeneralized functions, not in L1. If gn(x) →T ′ g(x) and g(x) is a continuous\nfunction then there is pointwise convergence and uniform convergence on\nbounded sets.\n3\nSemiparametric speciﬁcation and identiﬁ-\ncation\nSemiparametric models with measurement error were examined for polyno-\nmial regression functions by Hausman et al (1991), for regression function in\nthe L1 space by Wang and Hsiao (1995, 2009). (S) signiﬁcantly widened the\nclasses of semiparametric models with errors-in-variables where identiﬁcation\ncan be achieved via moment conditions by utilizing generalized functions, but\ndid not explicitly characterize the class of functions which she considered:\nverifying moment conditions of (S, Assumption 6) is needed. In contrast, the\nclass of parametric functions is characterized directly in Assumptions 5 and 6\nof this paper; the assumptions give suﬃcient conditions for identiﬁcation via\nmoments. The results in (S) rely on existence of a moment generating func-\ntion for the measurement error; this restriction in not imposed here. In this\npaper as well as in (S) some moment conditions involve limits for sequences\nof weighting functions; the limits are explicitly given here.\nAssumption 4. The function g(x∗) is in a parametric class of locally\nintegrable functions g(x∗, θ) where θ ∈Θ; Θ is an open set in Rm; for some\nθ∗∈Θ model assumptions and (1) hold.\nDenote all the Fourier transforms of the parametric functions in the\nmodel assumptions as γ(θ); εy(θ); εxy(θ). The following assumption restricts\nthe generalized function γ(θ) to have no more than a ﬁnite number of special\npoints: ∆points of singularity and J of ”jump” discontinuity in some region\n|ζ| < ¯ζ < ∞. Notation [x] is for integer part of x; δ(ζ −a) denotes a shilted\nδ −function : (δ(ζ −a), ψ) = ψ(a) for ψ ∈G.\nAssumption 5. The Fourier transform, γ(θ), of the real function g(x∗, θ)\n15\nin the region |ζ| < ¯ζ < ∞that belongs to its support (and may coincide with\nit) can be represented as\nγ(θ) = γo(θ) + γs(θ),\n(14)\nwhere\n(i) if ∆= 0, γs(θ) ≡0 ; if ∆≥1\nγs(θ)\n=\n2π\nL\nX\nl=0\nγsl(θ), where L =\n\u0014∆\n2\n\u0015\nand\n(15)\nγsl(θ)\n=\n¯kl\nX\nk=0\n\u0010\nγk(sl, θ)δ(k)(ζ −sl) + γk(sl, θ)δ(k)(ζ + sl)\n\u0011\n; for l = 0, 1, ...L;\n(ii) γo(θ) ≡γo(ζ, θ) is deﬁned by a locally integrable function of ζ contin-\nuous except possibly in a ﬁnite number of points and such that its generalized\nderivative,\n·γo(θ), is of the form\n·γo(θ) =\n·γoo(θ) +\n·γos(θ),\nwhere if J = 0, then\n·γos(θ) = 0, and if J > 0, then for points bj, j = 1, ...\n\u0002J\n2\n\u0003\n,\n·γos(bj, θ) =\nγos0(0, θ)δ(ζ)I(J is odd) + Σ[ J\n2]\nj=1\n\u0010\nγosj(bj, θ)δ(ζ −bj) + γosj(bj, θ)δ(ζ + bj)\n\u0011\n,\n·γoo(θ) ≡\n·γoo(ζ, θ) is an ordinary locally integrable function continuous except\npossibly in a ﬁnite number of points;\n(iii) γo(ζ, θ) ̸= 0 except possibly for a ﬁnite number of points in (−¯ζ, ¯ζ);\n(iv) At any non-zero singularity point: sl ̸= 0, γo(ζ, θ) is continuous and\nnon-zero.\nUnder Assumptions 1 and 5 g could be in L1, or a sum of a function from\nL1 and a polynomial (singularity point ζ0 = 0) and also possibly a periodic\n16\nfunction, e.g. sin (·) or cos (·) with singularities at some points ±s, s ̸= 0.\nHere the parameters, γ·(·, θ), are allowed to take complex values, otherwise\none would need to be more speciﬁc about the functions with singular Fourier\ntransforms; since the functions are assumed known it is easy in each speciﬁc\ncase to separate out the imaginary parts as in the case of polynomials.\nAssumption 5 permits to write moment conditions; however, to get a suf-\nﬁcient condition for identiﬁcation of all parameters additionally the following\nAssumption 6 is made.\nIf ∆> 0 deﬁne the matrices Γy(sl, θ) and Γxy(sl, θ) for each sl ≥0\n(similarly to (S) for the case sl = 0 ) by their elements:\nΓy,i+1,k+1(sl, θ)\n=\n \nk + i\ni\n!\nγk+i(sl, θ)I(k + i ≤¯kl);\nΓxy,i+1,k+1(sl, θ)\n=\n \nk + i + 1\ni + 1\n!\nγk+i(sl, θ)I(k + i ≤¯kl),\ni, k\n=\n0, 1, ...¯kl.\nDenote by {A}11 the ﬁrst matrix element of a matrix A.\nAssumption 6. The function γ satisﬁes Assumption 5. Additionally all\nγo(ζ, θ),\n·γoo(ζ, θ), γsl(θ) are continuously diﬀerentiable with respect to the\nparameter, θ, in some neighborhood of θ∗. The m × 1 parameter vector can\nbe partitioned as θT = [θT\nI ; θT\nII]. For any component, θi, of mI × 1 vector θI\n(where m ≥mI ≥0) either\nγo(ζ, θ∗) ∂\n∂θi\n·γoo(−ζ, θ)|θ∗+\n·γoo(ζ, θ∗) ∂\n∂θi\nγo(−ζ, θ)|θ∗̸= 0\n(16)\na.e., or if (16) does not hold for some i∗, then\n∂\n∂θi∗γo(−ζ, θ)|θ∗̸= 0. If mII > 0\nthe matrix that stacks for all sl, l ≥0 matrices\n \n∂\n∂θT\nII [Γy(sl, θ)]−1 |θ∗Γy(sl, θ∗) +\n∂\n∂θT\nII [Γxy(sl, θ)]−1 |θ∗Γxy(sl, θ∗)\n∂\n∂θT\nII\n\b\n[Γy(sl, θ)]−1 |θ∗Γy(sl, θ∗)\n\t\n11 |θ∗\n!\n17\nis of rank mII.\nBy checking we can see that all the examples provided in (S) satisfy\nassumptions 5 and 6 here and thus suﬃcient conditions for identiﬁcation\nhold. If the same parameters enter into both the ordinary and singular parts\n(S, assumption 6) may be violated, even though identiﬁcation is possible and\nthe results of this paper hold.\nAdditional assumptions 7 and 8 below are needed.4\nAssumption 7. The density function p(z) exists and is positive.\nAssumption 8. The characteristic function of measurement error, φ(ζ),\nis such that (i) φ(ζ) ̸= 0 for |ζ| < ¯ζ where it is continuously diﬀerentiable;\n(ii) it is ¯kl times continuously diﬀerentiable at every sl.\nTheorem 2 below establishes that moment conditions for the parame-\nters θ of γ(ζ, θ) hold and Theorem 3 that the assumptions are suﬃcient for\nidentiﬁcation. The notation Re(x) refers to the real part of a complex x.\nTheorem 2. Under model assumption and Assumptions 1’, 4, 7, 8\n(i) if Assumption 5 (i,ii) holds there exist real functions ry(z, θ), rxy(z, θ)\nsuch that the moment\nE\n\u0012Y rxy(z, θ) + XY ry(z, θ)\np(z)\n\u0013\n(17)\nexists for θ in some neighborhood of θ∗and equals zero for θ = θ∗;\n(ii) if 5(i-iii) holds there are functions ry1n(z, θ) such that\nlim\nn→∞E\n\u0012Y ry1n(z, θ)\np(z)\n−1\n\u0013\n(18)\nexists for θ in some neighborhood of θ∗and equals zero for θ = θ∗;\n(iii) If ∆> 0 and 5(i-ii) hold then for each sl ≥0 there exist vector\nfunctions rysl(z, θ), rysl,n(z, θ), rxysl(z, θ), rxysl,n(z, θ), and a diagonal invert-\n4Assumptions 7 and 8(ii) are also implicit in the proofs in (S).\n18\nible matrix Ml such that\nlim\nn→∞Re[Γ−1\ny (sl, θ)M−1\nl\nE\n\u0012Y rys,l,n(z, θ)\np(z)\n\u0013\n(19)\n+Γ−1\nxy (sl, θ)M−1\nl\nE\n\u0012XY rxys,l,n(z, θ)\np(z)\n\u0013\n]\nexists for θ in some neighborhood of θ∗and equals zero for θ = θ∗;\n(iv) If ∆> 0 and 5(i-iv) hold then for each sl ≥0 there exist functions\nrysl,1,n(z, θ), ryslo,1,n(z, θ) such that for s0 = 0\nlim\nn→∞E\n\u0012Y rys0,1,n(z, θ)\np(z)\n−1\n\u0013\n(20)\nand\nlim\nn→∞Re E\n\u0012Y (rysl,1,n(z, θ) −ryslo,1,n(z, θ))\np(z)\n\u0013\n(21)\nexist for θ in some neighborhood of θ∗and equal zero for θ = θ∗.\nProof. See Appendix. The functions r·(z, θ) and matrices Ml are provided\nthere.\nSome of the moment conditions can be redundant.\nDiﬀerent sets of\nweighting functions could be appropriate; similarly to reasoning in (S) the\nweighting functions are designed in a way that isolates diﬀerent components\nof the γ function: the ones in (i) are for the ordinary function component\nand are supplemented by moments in (ii) for the case of a scale multiple\nfor the ordinary component, the ones in (iii) are for the coeﬃcients of the\nsingular part with (iv) for the possible scale factor at each singularity. If\nonly (17) applies then the weighting functions proposed in (S) can be used,\nbut for the other components the weights proposed here solve the problem\nwithout additional requirements that moment generating function for errors\nexist and avoid the problematic function µ in (S, Deﬁnition 2): µ(0) and any\nderivatives of µ at 0 are zero (see Appendix B).\nDeﬁne by EQ(θ) the vector with components provided by the stacked\n19\nexpressions (whichever are deﬁned) from (17, 18, 19, 21).\nTheorem 3. Under the conditions of Theorem 2 and Assumption 6 the\nfunctions r·(z, θ) can be selected in such a way that the matrix\n∂\n∂θEQ(θ∗)\nexists and has rank m.\nProof. See Appendix.\nTheorem 3 provides suﬃcient conditions under which the equations EQ(θ) =\n0 fully identify the parameter vector θ∗.\n4\nAppendix A\n4.1\nProofs\nProof of Lemma 1.\n(i) By model assumption and Assumption 1 the convolutions in (1) pro-\nvide elements in T ′; this implies that any of the sequential deﬁnitions of\nconvolution in Kamiski (1982) hold, therefore by his theorem 9, the ”ex-\nchange formula” implies that the products for some sequences in the equiv-\nalence classes deﬁning the Ft′s exist. By Proposition 1 it follows that since\nφ,\n·\nφ ∈T ′, (12) holds for continuous functions φ and\n·\nφ then γφ ∈T ′,\n·γφ ∈T ′\nand additionally (by applying the product rule to (3,4)) γ ˙φ ∈T ′. Since\nT ′ ⊂D′, the products are deﬁned in D′ as well.\n(ii) Now consider a sequence (γφ)n deﬁned as follows: select some se-\nquence ˜γn for γ from D; then each ˜γn has ﬁnite support; for a sequence of\nnumbers εn →0 select ˜φn in D such that\n\f\f\f˜φn −φ\n\f\f\f <\nεn\nsup|˜γnφ−1| on compact\nsupport of γn. Then for the sequence (γφ)n = ˜γn˜φn and any ψ ∈D\nZ\n˜γn˜φnφ−1ψ =\nZ\n˜γnψ +\nZ\n˜γn(˜φn −φ)φ−1ψ →\nZ\nγψ.\nNow we check that (12) holds for a = φ−1. In D support of any ψ is bounded,\non that compact set φ−1 is bounded thus (12) will hold and the product is\n20\ndeﬁned in D′.\n(iii) For Case 1 the product with φ−1(ζ)I(|ζ| < ¯ζ) is similarly to (ii)\ndeﬁned in T ′ since it is suﬃcient to consider ψ ∈T with bounded support\n(containing support of γ). If cases 2 and 3 hold it is straightforward to verify\nthat the function φ−1 is in OM, thus the product is deﬁned (continuously) in\nT ′.\n(iv) We construct a counterexample. The function φ(x) = e−x2 does not\nbelong to either case 1 or case 2. The product of function b(x) ≡0 and\nφ(x)−1 does not exist in T ′. Consider bn(x) =\n\n\n\n\n\ne−n\nif n −1\nn < x < n + 1\nn;\n0 ≤bn(x) ≤e−n\nif n −2\nn < x < n + 2\nn;\n0\notherwise.\n(22)\nThis bn(x) converges to b(x) ≡0 in T ′. Indeed for any ψ ∈T\nZ\nbn(x)ψ(x)dx =\nZ n+2/n\nn−2/n\nbn(x)ψ(x)dx →0.\nBut the sequence bn(x)˜φ(x)−1 does not converge in the space T ′ of tem-\npered distributions.\nIndeed if it did then\nR\nbn˜φψ would converge for any\nψ ∈T. But for ψ ∈T such that ψ(x) = exp(−|x|) for, e.g. |x| > 1\nZ n+2/n\nn−2/n\nbn(x)ex2ψ(x)dx\n≥\ne−n\nZ n+1/n\nn−1/n\nex2−xdx\n≥\n2\nne−2n+(n−1/n)2.\nThis diverges.■\nProof of Theorem 1.\nThe proof makes use of diﬀerent spaces of generalized functions and ex-\nploits relations between them. It proceeds in two parts.\nFirst in part one, it is shown that from equations (3,4) the continuous\n21\nfunction κ = ˙φφ−1 can be uniquely pointwise determined on the interval\n[−¯ζ, ¯ζ] (which is in the support of γ and consequently of ε1); this requires\nadditionally considering the generalized functions spaces, D′ and also D0(U)′\nwhich is deﬁned on the space of test functions that are continuous with\nsupport contained in U. The function φ is uniquely deﬁned on the interval\n(−¯ζ, ¯ζ) as the solution of the corresponding diﬀerential equation that sat-\nisﬁes the condition φ(0) = 1. Deﬁne ˜φ = φI(|ζ| < ¯ζ); deﬁne ˜φ\n−1 to equal\nφ−1I(|ζ| < ¯ζ). Of course, when ¯ζ = ∞, ˜φ = φ and ˜φ\n−1 = φ−1 on R.\nNext in part two, γ is deﬁned as εy˜φ\n−1. By Lemma 1 this product can\nalways be uniquely deﬁned as a generalized function in D′; by construction γ\ndeﬁnes a generalized function in T ′ ⊂D′; this provides the required mapping\nM∗by applying inverse Fourier Transform to γ. If condition (iii) of Lemma\n1 applies the product εy˜φ\n−1 is deﬁned in T ′; in this case all the mappings\nthat deﬁne the mapping M∗are deﬁned in T ′. The proof concludes with an\nexample that demonstrates that the mapping can be discontinuous if (iv) of\nLemma 1 applies.\nPart one. Consider the space of generalized functions D′. By Assumption\n2 φ is non-zero and continuously diﬀerentiable, then by diﬀerentiating (3),\nsubstituting (4) and making use of Lemma 1 to multiply by φ−1 in D′ we get\nthat the generalized function\nεyφ−1 ˙φ −(˙εy −iεxy)\nequals zero in the sense of generalized function in D′. Denoting κ = ˙φφ−1 we\ncan characterize κ as a continuous at every point (by Assumption 2) function\nin D′ that satisﬁes the equation\nεyκ −(˙εy −iεxy) = 0.\n(23)\nIf (23) holds in D′, it holds also for any test functions with support limited\nto U : ψ ∈D(U) ⊂D, and thus holds in any D(U)′.\n22\nWe show that the function κ is uniquely determined in the class of con-\ntinuous functions on on [−¯ζ, ¯ζ] by (23) holding in D(U)′ for any interval\nU ⊂(−¯ζ, ¯ζ). Proof is by contradiction. Suppose that there are two distinct\ncontinuous functions on [−¯ζ, ¯ζ], κ1 ̸= κ2 that satisfy (23), then κ1(¯x) ̸= κ2(¯x)\nfor some ¯x ∈(−¯ζ, ¯ζ); by continuity κ1 ̸= κ2 everywhere for some interval\nU ⊂(−¯ζ, ¯ζ). Consider now D(U)′; we can write\n(εy(κ1 −κ2), ψ) = 0\nfor any ψ ∈D(U). A generalized function that is zero for all ψ ∈D(U)\ncoincides with the ordinary zero function on U and is also zero for all ψ ∈\nD0(U), where D0 denotes the space of continuous test functions. For the\nspace of test function D0(U) multiplication by continuous (κ1 −κ2) ̸= 0 is\nan isomorphism. Then from (23) we can write\n0 = ([εy(κ1 −κ2)] , ψ) = (εy, (κ1 −κ2)ψ)\nimplying that εy is deﬁned and is a zero generalized function in D0(U)′. If\nthat were so εy would be a zero generalized function in D(U)′ since D(U) ⊂\nD0(U); this contradicts Assumption 2. This concludes the ﬁrst part of the\nproof since from κ the function\nφ(ζ) = exp\nZ ζ\n0\nκ(ξ)dξ\nthat solves on [−¯ζ, ¯ζ]\n˙φφ−1 = κ; φ(0) = 1\nis uniquely determined on [−¯ζ, ¯ζ] and ˜φ (and ˜φ\n−1) deﬁned above are uniquely\ndetermined.\nPart two.\nConsider two cases.\n23\nCase 1.Part (iii) of Lemma 1 applies. Multiplying εy(= γ˜φ) by ˜φ\n−1 pro-\nvides a tempered distribution by Lemma 1; it is equal to γ. The inverse\nFourier Transform provides g. The theorem holds and moreover, all the op-\nerations by which the solution was obtained were deﬁned in T ′.\nCase 2. The condition (iii) of Lemma 1 may not hold, so multiplication by\n˜φ\n−1 = φ−1 may not lead to a tempered distribution. Consider now D′; T ′ ⊂\nD′. Multiplication by φ−1 is a continuous operation in D′; deﬁne the same\ndiﬀerential equations, solve to obtain φ and get via multiplication (γφ) · φ−1\nin D′ the function γ ∈D′. Since γ is the Fourier transform of g (a tempered\ndistribution) it also belongs to T ′, and it is possible to recover g by an inverse\nFourier Transform.\nIn the following example the mapping M∗in (7) is not continuous. Deﬁne\nβn = Ft−1(bn) where bn is deﬁned by (22); bn ∈T, thus βn ∈T. In was shown\nin proof of Lemma 1 that bn(x) converges to b(x) ≡0 in T ′.\nSuppose that the model mapping M in (6) is deﬁned for functions in L1\nand is continuous in L1 (and thus in T ′). Suppose that Wyn = Wy + βn;\nfrom bn →0 in T ′ and the continuity of the Fourier Transform mapping in\nT ′, it follows that βn →0 and thus Wyn →Wy in T ′. Then εyn = εy + bn.\nSuppose that φ is proportionate to e−x2. Then by the proof in part 1 each\nγn = εynφ−1 ∈D′, but as a Ft of a function in T ′ (even in L1 here) is deﬁned\nin T ′; the inverse Fourier transform, ˜gn = Ft−1(γn), exists. However, ˜gn does\nnot converge to g in T ′. Indeed, if it did so converge, then that would imply\nconvergence γn →γ in T ′, but bn(x)ex2 does not converge in the space T ′ of\ntempered distributions as was shown in the proof of Lemma 1. ■\nProof of Proposition 2.\n(a) We establish that the mapping from (Wyn, Wxyn) to gn is continuous.\nConsider ζ ∈supp(γ). Similarly to proof in Theorem 1 applied to every n a\ncontinuous function κn(ζ), that satisﬁes the equation\nκn(ζ)εyn(ζ) + (iεxyn(ζ) −˙εyn(ζ)) = 0\n(24)\n24\nin generalized functions, exists (deﬁned as ˙φnφ−1\nn ) and is unique. Moreover,\nfrom Lemma 1 it follows that the product with κn = ˙φnφ−1\nn\n∈OM always\nexists. Since all functions in (24) are continuous it represents an equality of\ncontinuous functions and since εyn is non-zero a.e. we have\nκn(ζ) = (iεxyn(ζ) −˙εyn(ζ))(εyn(ζ))−1.\nThe generalized functions\nκnεyn −κεy = i(εxyn −εxy) + (˙εyn −˙εy) and κn(εy −εyn)\nconverge to zero as generalized functions in T ′; as a result, so does (κn−κ)εyn,\nbut since this is a continuous function this implies pointwise convergence.\nSuppose that on some bounded interval κn −κ is separated away from zero\nfor some subsequence {ni}, this implies then that on that set εyni converges\nto zero pointwise, thus the limit in T ′ (=εy) is zero on this interval which\nbelongs to support of γ, and thus of εy. This contradiction establishes that\nκn →κ pointwise and uniformly on any bounded set. From the diﬀerential\nequation φ−1\nn ˙φn = κn with the condition φn(0) = 1 the function φn is uniquely\ndetermined; and φn →φ where φ−1 ˙φ = κ, φ(0) = 1. Then also since φ is non-\nzero, φ−1\nn →φ−1 pointwise; φ−1\nn\nsatisﬁes (5) so that ε1nφ−1\nn\ncan be deﬁned as\na tempered distribution. Finally consider\nεynφ−1\nn −εyφ−1 = εyn(φ−1\nn −φ−1) + (εyn −εy)φ−1.\nThe continuous function εyn(φ−1\nn −φ−1) →0; the generalized function (εyn −\nεy)φ−1 →0 in T ′ (as a tempered distribution) εynφ−1\nn\nconverges to γ in T ′,\nand its inverse Fourier Transform converges to g as a tempered distribution\n(by continuity of inverse Fourier Transform in T ′).\nFrom continuity of the mapping the result follows.\n(b) For any g ∈L1 there exists a sequence of step-functions gn ∈L1\nsuch that ∥gn −g∥L1 →0 (implying gn →T ′ g); for F there is a sequence of\n25\nstep-functions Fn such that sup |Fn −F| →0 (implying Fn →T ′ F).\nSpeciﬁcally,\ngn(x)\n=\nN\nX\nk=1\nakI(bk ≤x < bk+1) for b1 < ... < bN;\nFn(x)\n=\nN\nX\nj=1\ncjI(dj ≤x) with cj > 0; Σcj = 1; d1 < ... < dN,\nwhere all the parameters depend on n. The generalized derivative of Fn is\nfn(x) = Σcjδ(x −dj) where δ(x −dj) is a shifted δ−function:\nR\nδ(x −\ndj)ψ(x)dx = ψ(di) for ψ ∈T. Then φn(ζ) = Σcjeiζdj. The function φn is\nnot integrable (otherwise f would be continuous), thus φ−1\nn\nsatisﬁes (5). All\nthe parameters depend on n.\nThen\nWyn(v)\n=\nN2\nX\nm=1\nαmI(|v −tm| < τ m);\nWxyn(v)\n=\nN2\nX\nm=1\nαm(v −εm)I(|v −tm| < τ m),\nwhere m corresponds to a pair (k, j) and αm = akcj; tm = dj + bk+bk+1\n2\n, εm =\ndj, τ m = bk+1−bk\n2\n. This represents Wyn as a step-function and Wxyn as a piece-\nwise linear function. The conditional mean function Wy can be consistently\nestimated in L1 by step functions implying existence of a sequence Wyn(v)\nsuch that Pr(Wyn →T ′ Wy) →1, similarly, for some piece-wise linear Wxyn(v)\nPr(Wxyn →T ′ Wxy) →1 implying (13), moreover, we can write (using known\n26\nFourier transforms)\nεyn(ζ)\n=\nN\nX\nk=1\n2τ kαkχk(ζ)sinc(τ kζ\nπ );\nεxyn(ζ)\n=\n−i\nN\nX\nk=1\n2τ k\nd\ndζ\n\u0014\nαkχk(ζ)sinc(τ kζ\nπ )\n\u0015\n−\nN\nX\nk=1\n2τ kαkεkχk(ζ)sinc(τ kζ\nπ ),\nwhere the sinc(x) function is deﬁned as sin πx\nπx\nand χk(ζ) = eitkζ. The condi-\ntions about continuity and εyn(ζ) non-zero a.e., required in (a) are satisﬁed;\n(13) follows from the continuity of the Fourier transform operator in T ′.■\nPrior to proof of Theorem 2 we make two preliminary observations.\nFirstly, under Assumption 5 and 8 (that justiﬁes products of γs and\n·γs\nwith φ) and by Lemma 1 equations (3,4) in T ′ lead to (i2 = −1):\nεy\n=\nεyo + εys\n(25)\nwith εyo(ζ)\n=\nγo(ζ, θ∗)φ(ζ); εys = γs(θ∗)φ(ζ);\niεxy\n=\niεxyo + iεxyos + iεxys\n(26)\nwith iεxyo(ζ)\n=\n·γoo(ζ, θ∗)φ(ζ),\niεxyos(ζ)\n=\n·γos(ζ, θ∗)φ(ζ),\nand iεxys\n=\n·γs(θ∗)φ, where\n·γs(θ) is the generalized derivative of γs(θ).\nSecond, to construct weighting functions some well-known functions are\nused. Denote by TR ⊂T the space of real test functions that are Ft of real-\nvalued functions from T; they satisfy ψ(−ζ) = ψ(ζ). A smooth cut-oﬀ(or\n”smudge”) function is deﬁned (e.g. in GS or L) as\nfcut(ζ) = exp(−\n1\n1 −ζ2)I(|ζ| < 1);\n27\n”bump function” is\nfbump(ζ) =\nfcut(ζ)\nR 1\n−1 fcut(ζ)dζ\n.\nConsider sets V, U deﬁned as\nV = ∪([ai, bi] ∪[−bi, −ai]) ⊂∪(ai −ε, bi + ε) ∪(−bi −ε, −ai + ε) = U, (27)\nwhere ai ̸= bi and the intervals and ε are such that the only two intervals in\nU that could intersect would correspond to some i with bi = −ai; deﬁne the\nfunction\nfV (ζ) = I(|ζ| ∈V ) ∗fbump(2ζ\nε )2\nε.\nThis function has the property that it equals 1 on V, 0 outside of U and takes\nvalues between 0 and 1.\nFor any ξ ∈R, p ≥0, ε > 0 consider a closed set Vξ = [ξ −α, ξ + α] ∪\n[−ξ −α, −ξ + α] and the function fVξ(ζ), deﬁned above. Deﬁne fξ,p(ζ) =\n(ζ −ξ)pfUξ,Vξ(ζ). This function has the property that\ndlfξ,p,ε\ndζl\n(ξ) = (−1)l dlfξ,p,ε\ndζl\n(−ξ) =\n(\np!\nif l = p;\n0\notherwise.\nAll the functions, fbump, fV , fξ,p,ε are in TR.\nProof of Theorem 2.\n(i) Let e be small enough that closed e−neighborhoods of all the points\nof\nsingularity and discontinuity of γo and\n·γo do not intersect in (−¯ζ, ¯ζ).\nDeﬁne the union of open intervals that is the compliment to this set in\n(−¯ζ, ¯ζ) by U. Construct for a small enough ε a corresponding union of\nclosed intervals, V ⊂U that can be deﬁned by (27). Deﬁne µ (ζ) = fV (ζ).\nThen dpµ\ndζp (sl) = 0 for all sl, p; integrals\nR\n·γo(ζ, θ)µ(ζ)dζ and\nR\nγo(ζ, θ)µ(ζ)dζ\nare deﬁned for any θ. The inverse Ft’s ry(z, θ) = Ft−1(γo(−ζ, θ)µ(−ζ))\nand rxy(z, θ) = Ft−1(i\n·γo(−ζ, θ)µ(−ζ) exist.\nSince εyo(ζ) = γo(ζ, θ∗)φ(ζ),\nεxyo(ζ) = −i\n·γo(ζ, θ∗)φ(ζ),\n·γo(ζ, θ) and εxyo(ζ) are ordinary locally integrable\n28\nfunctions in T ′ and εyo(ζ) and γo(ζ, θ) are continuous and satisfy (5), the\nproducts εyo(ζ)\n·γo(−ζ, θ) and εxyo(ζ)γo(−ζ, θ) are well deﬁned in T ′ . Thus\nthe integral (where µ ∈TR)\nZ h\nεyo(ζ)i\n·γo(−ζ, θ)µ(−ζ) + εxyo(ζ)γo(−ζ, θ)µ(−ζ)\ni\ndζ\nexists. Since εyo(ζ) = γo(ζ, θ∗)φ(ζ), εxyo(ζ) = −i\n·γo(ζ, θ∗)φ(ζ) the value of\nthe integral is zero for θ = θ∗. Moreover, because the functions µ are zero\ntogether with all the derivatives at singularity points, εyo can be replaced by\nεy providing:\nZ h\nεyo(ζ)i\n·γo(−ζ, θ)µ(−ζ) + εxyo(ζ)γo(−ζ, θ)µ(−ζ)\ni\ndζ\n=\n(iεy\n·γo(−ζ, θ), µ(−ζ)) + (εxyγo(−ζ, θ), µ(−ζ))\nBy applying Parseval identity to generalized functions this leads to\n(Wy, rxy(θ)) + (Wxy, ry(θ))\n=\nZ\n[Wy(z)rxy(z, θ) + Wxy(z)ry(z, θ)] dz\nwhere the functionals are expressed via integrals for ordinary locally inte-\ngrable functions.\nMultiplying and dividing by the non-zero function p(z) does not change\nthe integral. Then by law of iterated expectations\nZ\n1\np(z)E|z (Y rxy(z, θ) + XY ry(z, θ)) p(z)dz = E\n\u0012Y rxy(z, θ) + XY ry(z, θ)\np(z)\n\u0013\n.\nThis concludes the proof of (i).\n(ii) By Assumption 5(iii) there exists a sequence ξn →0 such that\nγo(ζ, θ) ̸= 0 for ζ : |ζ −ξn| < εn < |ξn| and is continuous in those inter-\nvals; without loss of generality assume that ζ ∈U deﬁned in (i). Consider\n29\nthe function\nµn(ζ) = 1\n2{fbump(ζ −ξn\nεn\n) + fbump(ζ + ξn\nεn\n)}\nThe function\nµn(−ζ)\nγo(−ζ,θ) is a continuous function with bounded support. Set\nr1yn(z, θ) = Ft−1( µn(−ζ)\nγo(−ζ,θ)).Then for any n we get\nZ\nεyo(ζ)γo(−ζ, θ)\n−1µn(−ζ)dζ\n=\n(εy · γo(−ζ, θ)\n−1, µn(−ζ))\n=\nZ\nE(Y |z)Ft−1(γo(−ζ, θ)−1µn(−ζ))dz\n=\nE\n\u0012Y ry1n(z, θ)\np(z)\n\u0013\n,\nwhere the ﬁrst equality follows from the fact that (εysγo(−ζ, θ)\n−1, µn(−ζ)) =\n0 (since ζ ∈U), the second by Parseval identity and the third by multiplying\nand dividing by p(z) > 0 and iterated expectation; the integral exists for\neach n. For θ∗we get (γo(ζ) = γo(−ζ))\nE\n\u0012Y ry1n(z, θ∗)\np(z)\n\u0013\n=\nZ\nεyo(ζ)γo(ζ, θ∗)−1µn(−ζ)dζ =\nZ\nφ(ζ)µn(−ζ)dζ\n=\n1\n2 [φ(ξn) + φ(−ξn)] + O(εn)\nThis converges to φ(0) = 1.\n(iii) Consider any sl ≥0. Below all relevant functions are subscripted by\nl.\nFor ε as deﬁned in (i) deﬁne the function µl,i(ζ) = fsl,i,ε(ζ) ∈TR, then\nµ(i)\nl,i (0) ̸= 0, but µ(k)\nl,i (0) = 0, k = 0, ...i −1, i + 1, ...¯k + 1 and support of\nµl,i is given by I(|ζ −sl| < ε) + I(|ζ + sl| < ε); denote the derivative of µl,i\nby µ′\nl,i. For a sequence εn →0 consider fVn(ζ) for Un = {ζ : |ζ −sl| <\nεn} ∪{ζ : |ζ + sl| < εn}; Vn = {ζ : |ζ −sl| ≤\nεn\n2 } ∪{ζ : |ζ + sl| <\nεn\n2 }\n30\nand deﬁne µl,i,n(ζ) = µli(ζ)fUn,Vn(ζ)). The functions µ· are in TR. Denote\nby rxys,l,i,n(z) the inverse Ft: Ft−1(µl,i,n(−ζ)) and by rys,l,i,n(z) the inverse\nFt: Ft−1(iµ′\nl,i,n(−ζ)); they exist in T. The vector rxys,l,n(z) is deﬁned to have\nrxys,l,i,n(z) as its i−th component; vector rys,l,n(z) is deﬁned similarly. Deﬁne\nby Ml the diagonal matrix with non-zero diagonal entries {Ml}ii = µ(i)\nl,i,n(0) ≡\nµ(i)\nl,i (0), i = 0, ...¯k.\nConsider now the vector (εy, µ′\nl,n) with components (εy, µ′\nl,i,n(−ζ)) and\n(εxy, µl,n) with (εxy, µl,i,n(−ζ)). Since the matrices Γy(sl, θ), Γxy(sl, θ) and\nMl are invertible the expression\nΓy(sl, θ)−1M−1\nl\n(εy, µ′\nl,n) + Γxy(sl, θ)−1M−1\nl\n(εxy, µl,n)\n(28)\nis ﬁnite for every n. By Parseval identity\n(εy(ζ), µ′\nl,i,n(−ζ))\n=\n(Wy(z), ry,l,i,n(z))\n=\nZ\nWy(z)ry,l,i,n(z)dz,\nthe last equality follows since Wy is locally integrable. Thus by arguments\nsimilar to those in (i) and (ii) this integral is E Y ry,l,i,n(z)\np(z)\nso that (εy, µ′\nl,n) =\nE Y ry,l,n(z)\np(z)\nand analogously (εxy, µl,n) = E XY rxy,l,n(z)\np(z)\n. We need to establish\nthat limits as n →∞exist. First, note that\n\f\f\f\f\nZ\nεyo(ζ)µ′\nl,i,n(−ζ)dζ\n\f\f\f\f\n=\n\f\f\f\f\nZ\nεyo(ζ)fζl,i,ε(−ζ)fUn,Vn(−ζ)dζ\n\f\f\f\f\n≤\nmax\nU\n\f\fεyo(ζ)fζl,i,ε(−ζ)\n\f\f 2εn\nand goes to zero;\n(εys, µ′\nl,i,n(−ζ)) = Σ\n¯k\nk≥iγ(sl, θ∗)(−1)i\n \nk + i −1\ni −1\n!\nµ(i)\nl,i (sl)φ(k−i+1)(sl) (29)\nand does not depend on n, ﬁnally, εy = εyo + εys, so the limit exists. By a\n31\nsimilar representation for −(εxys, µl,i,n(−ζ)) existence of (19) is established.\nFor θ = θ∗using (25,26) for εys and εxys in (28) leads to\nΓy(sl, θ∗)−1M−1\nl\n(εys, µ′\nl,n) + Γxy(sl, θ∗)−1M−1\nl\n(εxys, µl,n) = 0.\nNote that the same considerations apply to singularity at −sl with the dif-\nference that the Γ.(−sl, θ) matrices now are complex conjugate to Γ.(sl, θ).\nCombining provides the real part in (19).\n(iv) Consider the ﬁrst component of Γy(sl, θ)−1M−1\nl\n(εys, µ′\nl,n) with µ′\nl,n, Ml\ndeﬁned in (iii); this component is {Γy(sl, θ)−1M−1\nl\n}11(εys, µ′\nl,1,n). Note that\nµ′\nl,1,n = µl,0,n, recall that µ ∈TR. We see that φ(sl) equals lim{Γy(sl, θ∗)−1M−1\nl\n}11\nR\nεysµl,0,ndζ.\nDeﬁne\nrysl,1,n(z, θ) = {Γy(sl, θ)−1M−1\nl\n}11Ft−1(µl,0,n(−ζ)).\nSimilarly to above by Parseval identity {Γy(sl, θ)−1M−1\nl\n}11(εys, µl,0,n) = E( Y rysl,1,n(z,θ)\np(z)\n)\nand φ(sl) = lim E( Y rysl,1,n(z,θ)\np(z)\n). For s0 = 0 we have φ(0) = 1. Thus (20) fol-\nlows.\nConsider now for sl ̸= 0 the function\nµl,n(ζ) = 1\n2{fbump(ζ −sl −ξn\nεn\n) + fbump(ζ −sl + ξn\nεn\n)}\nsimilar to the one in (ii) and deﬁne rslo,n(z) = Ft−1(\nµl,n(−ζ)\nγo(−ζ,θ)). For this function\nE( Y rslo,n(z,θ)\np(z)\n) =\nR\nεy(ζ)\nµl,n(−ζ)\nγo(−ζ,θ)dζ exists and at θ∗converges to φ(sl). Thus\n(21) follows.■\nProof of Theorem 3.\nLet the vector Q(z, θ) denote the vector of functions for which expecta-\ntions are taken in E(Q); partition Q(z, θ) into QI(z, θ) corresponding to ex-\npressions in (17, 18) and QII(z, θ) for (19, 21). Then the matrix\n∂\n∂θT E(Q(z, θ))\n32\nis a block matrix\n \n∂\n∂θT\nI E(QI(z, θ))\n·\n·\n∂\n∂θT\nII E(QII(z, θ))\n!\nand it is suﬃcient to show that\n∂\n∂θT\nI E(QI(z, θ)) has rank mI and\n∂\n∂θT\nII E(QII(z, θ))\nhas rank mII.\nFor θI ﬁrst note that interchange of diﬀerentiation with respect to the\nparameter and integration (taking expected value) for\n∂\n∂θT\nI EQI(z, θ) follows\nfrom continuity in ζ of all the functions in the integrals and their continuous\ndiﬀerentiability with respect to θ, so that\n∂\n∂θI E(QI(z, θ)) = E( ∂\n∂θI QI(z, θ)).\nOne can choose mI functions µ deﬁned in proofs of Theorem 2(i,ii) that\nare functionally independent and under Assumption 6 the corresponding mI\nconditions of type E( ∂\n∂θI QI(z, θ)) will provide a rank mI submatrix.\nIf for the functions µ in expressions QII(z, θ) in (iii,iv) of Proof of Theorem\n2 the matrix\n∂\n∂θII E(Qs(z, θ)) has rank less than mII consider varying the\nfunctions µ· for all possible values of non-zero derivatives at the points sl; the\nrank cannot be deﬁcient over all such choices without violation of Assumption\n6.■\nAppendix B\nThree main problems with (S) are listed below.\n1. The issue of decomposition.\n(S) claims that any generalized function in T ′ can be decomposed into a\nsum of an ordinary function and a singular function; this decomposition is\nused in formula (13) of S., Theorem 1.\nThere is no proof of existence of such a decomposition in the literature,\nas the example of the function in Section 2.1 in (10) shows no unique de-\ncomposition into a singular and regular ordinary function exists in T ′ (nor in\nD′). The attempted proof in (S, Supplementary material, p.3) is incorrect.\nIndeed it states: ”The result directly follows from the fact that every\ngeneralized function can be written as the derivative of order k ∈N of some\n33\ncontinuous function c(t) (Theorem III in Temple (1963) establishes this for a\nclass of generalized functions including those considered here as a particular\ncase). [-my comment: this is correct] At every point t where c(t) is k times\ndiﬀerentiable in the usual sense, the generalized function can be written as\nan ordinary function, while at every point where c(t) is not k times diﬀeren-\ntiable, a delta function derivative is created in the diﬀerentiation process.[my\ncomment: this is incorrect, see (a) below] The fact that the two pieces are\nadditively separable follows from the linear nature of the space of generalized\nfunctions. [my comment: this is incorrectly applied: see (b) below]”\n(a). Consider the function b(ζ) = |ζ|−3\n2 ; it is a ”weak” (or generalized)\nsecond derivative of the continuous function c(ζ) = −4 |ζ|\n1\n2. The ﬁrst weak\nderivative, −2 |ζ|−1\n2 sign(ζ), is an ordinary function that is summable and\nso gives a regular functional and is an ordinary function that is at the same\ntime a generalized function. At point ζ = 0 it is not diﬀerentiable in the\nordinary sense; yet no delta-function or its derivative appears.\n(b) Any generalized function is either regular or singular; the ”ordinary”\nfunction b(ζ) above is a singular generalized function (see (10)). Since gen-\neralized functions are generally not deﬁned pointwise a pointwise argument\ncannot be helpful.\nAn additional assumption would have to be used to establish formula (13)\nin Theorem 1 of (S).\n2. Validity of products.\nValidity of products in the space of generalized functions needs to be\nestablished to provide a correct proof of the identiﬁcation result. Neither\nthe paper nor the supplementary material in (S) provides a complete correct\nproof indicating in which space of generalized functions the multiplication\noperations are valid; in fact as Lemma 1 here shows multiplication may not\nbe valid in T ′ under the Assumptions (despite the claim in (S)).\n3. Deﬁnition 2 in (S) leads to inappropriate weights.\n34\nDef. 2 proposes the function\nµ(ζ) =\n∞\nX\nk=0\n1\nk!dk(ζkλ(ζ))/dζk\nfor λ that satisﬁes S, Def. 1 (λ is an analytic function). We have\n∞\nX\nk=0\n1\nk!dk(ζkλ(ζ))/dζk\n=\n∞\nX\nk=0\n1\nk!\nk\nX\ni=0\nCk\ni\n\u0000diζk/dζi\u0001 \u0000dk−iλ(ζ)/dζk−i\u0001\n=\n∞\nX\nk=0\n1\nk!\nk\nX\ni=0\nCk\ni\nk!\n(k −i)!ζk−i \u0000dk−iλ(ζ)/dζk−i\u0001\n=\n∞\nX\nk=0\nk\nX\ni=0\nCk\ni\n1\ni!ζi \u0000diλ(ζ)/dζi\u0001\n.\nConsider the values and derivatives of the function µ at zero; they are\nzero and thus are not suitable for the weighting functions. Indeed\nµ(0)\n=\n∞\nX\nk=0\nλ(0), so λ(0) = 0 and µ(0) = 0\nµ′(0)\n=\n∞\nX\nk=0\nk\nX\ni=0\nCk\ni\n1\ni![ζi−1 \u0000diλ(ζ)/dζi\u0001\n+ ζi \u0000di+1λ(ζ)/dζi+1\u0001\n|ζ=0\n=\n∞\nX\nk=0\n[λ′(0) + kλ′(0)], so λ′(0) = 0, and µ′(0) = 0,\netc., implying µ(k)(0)\n=\n0 for any k.\n35\nReferences\n[1] Antosik,, P., J.Mikusinski and R. Sikorski, (1973) Theory of Distribu-\ntions. The Sequential approach. Elsevier-PWN, Amsterdam-Warszawa.\n[2] Gel’fand, I.M. and G.E.Shilov (1964) Generalized Functions, Vol.1,\nProperties and Operations, Academic Press, San Diego.\n[3] Gel’fand, I.M. and G.E.Shilov (1964) Generalized Functions, Vol.2,\nSpaces of Test functions and Generalized Functions, Academic Press,\nSan Diego.\n[4] Gel’fand, I.M. and N.Ya Vilenkin (1964) Generalized Functions, Vol.4,\nApplications of Harmonic Analysis, Academic Press, San Diego.\n[5] Hausman J., W. Newey, H. Ichimura and J. Powell (1991), Measurement\nerror in Polynomial Regression Models, Journal of Econometrics, v. 50,\n273-295.\n[6] Kaminski, A (1982), Convolution, product and Fourier transform of\ndistributions, Studia Mathematica, v. 74, pp.83-96.\n[7] Kaminski, A and R. Rudnicki (1991), A note on the convolution and\nthe product D′ and S′, Internat. J. Math&Math Sci., v.14, 275-282.\n[8] Lighthill, M.J. (1959) Introduction to Fourier Analysis and Generalized\nFunctions, Cambridge University Press.\n[9] Newey, W. (2001), Flexible Simulated Moment Estimation of Nonlinear\nErrors-in-Variables Models, Review of Economics and Statistics, v. 83,\n616-627.\n[10] Schwartz, L. (1954) “Sur l’impossibilit´e de la multiplication des distri-\nbutions”C. R. Acad. Sci.,239, No. 15, 847–848.\n[11] Schwartz, L. (1966) ”Th´eorie des distributions”, Hermann, Paris.\n36\n[12] Schennach, S. (2007) Instrumental variable estimation in nonlinear\nerrors-in-variables models, Econometrica, v.75, pp. 201-239.\n[13] Wang, L. and C. Hsiao (1995), Simulation-Based Semiparametric Esti-\nmation of Nonlinear Errors-in-Variables Models, working paper, Univer-\nsity of Southern California.\n[14] Wang, L. and C. Hsiao (2009) Method of Moments Estimation and\nIdentiﬁability of Semiparametric Nonlinear Errors-in-Variables Models,\nJournal of Econometrics, in press.\n[15] Zinde-Walsh, V. (2008), Kernel Estimation when Density May not Exist,\nEconometricTheory, v.24, 696-725.\n37\n"}