{"text": "arXiv:1407.1372v2  [math.NA]  15 Jun 2015\nA NEW ERROR IN VARIABLES MODEL FOR SOLVING POSITIVE\nDEFINITE LINEAR SYSTEM USING ORTHOGONAL MATRIX\nDECOMPOSITIONS\nNEGIN BAGHERPOUR ∗AND NEZAM MAHDAVI-AMIRI †\nAbstract. The need to estimate a positive deﬁnite solution to an overdetermined linear system\nof equations with multiple right hand side vectors arises in several process control contexts. The\ncoeﬃcient and the right hand side matrices are respectively named data and target matrices.\nA\nnumber of optimization methods were proposed for solving such problems, in which the data matrix\nis unrealistically assumed to be error free.\nHere, considering error in measured data and target\nmatrices, we present an approach to solve a positive deﬁnite constrained linear system of equations\nbased on the use of a newly deﬁned error function.\nTo minimize the deﬁned error function, we\nderive necessary and suﬃcient optimality conditions and outline a direct algorithm to compute the\nsolution. We provide a comparison of our proposed approach and two existing methods, the interior\npoint method and a method based on quadratic programming. Two important characteristics of our\nproposed method as compared to the existing methods are computing the solution directly and con-\nsidering error both in data and target matrices. Moreover, numerical test results show that the new\napproach leads to smaller standard deviations of error entries and smaller eﬀective rank as desired by\ncontrol problems. Furthermore, in a comparative study, using the Dolan-Mor´e performance proﬁles,\nwe show the approach to be more eﬃcient.\nKey words. Error in variables models, positive deﬁniteness constraints, overdetermined linear\nsystem of equations, multiple right hand side vectors\nAMS subject classiﬁcations. 65F05, 65F20, 49M05\n1. Introduction. Computing a symmetric positive deﬁnite solution of an overde-\ntermined linear system of equations arises in a number of physical problems such as\nestimating the mass inertia matrix in the design of controllers for solid structures and\nrobots; see, e.g., [9], [17], [14]. Modeling a deformable structure also leads to such\na mathematical problem; e.g., see [25]. The problem turns into ﬁnding an optimal\nsolution of the system\nDX ≃T,\n(1.1)\nwhere D, T ∈Rm×n, with m ≥n, are given and a symmetric positive deﬁnite matrix\nX ∈Rn×n is to be computed as a solution of (1.1). In some special applications,\nthe data matrix D has a simple structure, which may be taken into consideration\nfor eﬃciently organized computations. Estimation of the covariance matrix and com-\nputation of the correlation matrix in ﬁnance are two such examples where the data\nmatrices are respectively block diagonal and the identity matrix; e.g., see [31].\nA number of least squares formulations have been proposed for physical problems,\nwhich may be classiﬁed as ordinary and error in variables (EIV) models.\nAlso, single or multiple right hand side least squares may arise. With a single right\nhand side, we have an overdetermined linear system of equations Dx ≃t, where\nD ∈Rm×n, t ∈Rm×1, with m ≥n, are known and the vector x ∈Rn×1 is to be\ncomputed. In an ordinary least squares formulation, the error is only attributed to\n∗Faculty of Mathematical Sciences, Sharif University of Technology, Tehran, Iran, (nbagher-\npour@mehr.sharif.ir).\n†Faculty\nof\nMathematical\nSciences,\nSharif\nUniversity\nof\nTechnology,\nTehran,\nIran,\n(nezamm@sharif.ir).\n1\nt. So, to minimize the corresponding error, the following mathematical problem is\ndevised:\nmin ∥∆t∥\ns.t. Dx = t + ∆t.\n(1.2)\nThere are a number of methods for solving (1.2), identiﬁed as direct and iterative\nmethods. A well known direct method is based on using the QR factorization of the\nmatrix D [27]. An iterative method has also been introduced in [7] for solving (1.2)\nusing the GMRES algorithm.\nIn an EIV model, however, errors in both D and t are considered; e.g., see [3]. Total\nleast squares formulation is a well-known EIV model, where the goal is to solve the\nfollowing mathematical problem (e.g., see [6] and [16]):\nmin ∥[∆D, ∆t]∥\ns.t. (D + ∆D)x = t + ∆t.\n(1.3)\nWe note that ∥· ∥in (1.2) and (1.3) respectively denote the vector 2-norm and\nthe matrix Frobenius norm. Both direct [24] and iterative [12] methods have been\npresented for solving (1.3). Moreover, the scaled total least squares formulation has\nbeen considered to unify both ordinary and total leats squares formulation; e.g., see\n[24]. In a scaled toal least squares formulation, the mathematical problem\nmin ∥[∆D, ∆t]∥\ns.t.(D + ∆D)x = λt + ∆t\n(1.4)\nis to be solved for an arbitrary scalar λ. Zhou [19] has studied the eﬀect of perturba-\ntion and gave an error analysis of such a formulation.\nA least squares problem with multiple right hand side vectors can also be for-\nmulated as an overdetermined system of equations DX ≃T , where D ∈Rm×n,\nT ∈Rm×k, with m ≥n, are given and the matrix X ∈Rn×k is to be computed. With\nordinary and total least squares formulations, the respective mathematical problems\nare:\nmin ∥∆T ∥\ns.t. DX = T + ∆T\nX ∈Rn×k\n(1.5)\nand\nmin ∥[∆D, ∆T ]∥\ns.t. (D + ∆D)X = T + ∆T\nX ∈Rn×k.\n(1.6)\nCommon methods for solving (1.5) are similar to the ones for (1.2); see, e.g., [7],\n[27]. Solving (1.6) is possible by using the method described in [8], based on the SVD\nfactorization of the matrix [D, T ]. Connections between ordinary least squares and\ntotal least squares formulations have been discussed in [11].\n2\nHere, we consider a newly deﬁned EIV model for solving a positive deﬁnite linear\nproblem. Our goal is to compute a symmetric positive deﬁnite solution X ∈Rn×n\nto the overdetermined system of equations DX ≃T , where both matrices D and\nT may contain errors. We refer to this problem as positive deﬁnite linear system of\nequations later. No EIV model, even the well-known total least squares formulation, is\nconsidered for solving the positive deﬁnite linear system of equations in the literature.\nSeveral approaches have been proposed for this problem, commonly considering the\nordinary least squares formulation and minimizing the error ∥∆T ∥F over all n × n\nsymmetric positive deﬁnite matrices, where ∥.∥F is the Frobenious norm; see e.g.\n[10, 23]. Larson [13] discussed a method for solving a positive deﬁnite least squares\nproblem considering the corresponding normal system of equations. He considered\nboth symmetric and positive deﬁnite least squares problems. Krislock [25] proposed\nan interior point method for solving a variety of least squares problems with positive\nsemi-deﬁnite constraints.\nWoodgate [18] described a new algorithm for solving a\nsimilar problem in which a symmetric positive semi-deﬁnite matrix P is computed to\nminimize ∥F −PG∥, with known F and G. Hu [10] presented a quadratic programming\napproach to handle the positive deﬁnite constraint. In her method, the upper and\nlower bounds for the entries of the target matrix can be given as extra constraints. In\nreal measurements, however, both the data and target matrices may contain errors;\nhence, the total least squares formulation appears to be appropriate.\nThe rest of our work is organized as follows. In Section 2, we deﬁne a new error\nfunction and discuss some of its characteristics. A method for solving the resulting\noptimization problem with the assumption that D has full column rank is presented\nin Section 3. In Section 4, we generalize the method to the case of data matrix having\nan arbitrary rank.\nIn Section 5, a detailed discussion is made on computational\ncomplexity of both methods. Computational results and comparisons with available\nmethods are given in Section 6. Section 7 gives our concluding remarks.\n2. Problem Formulation. Consider a single equation ax ≃b, where a, b ∈Rn\nand x ∈R+. Errors in the ith entry of b and a are respectively equal to | aix −bi |\nand | ai −bi\nx |; e.g., see [24].\nIn [24], Pn\ni=1Li was considered as a value to represent errors in both a and b. As\nshown in Figure ??, Li is the height of the triangle ABC which turns to be equal to\nLi = |bi−aix|\n√\n1+x2 . Here, to represent the errors in both a and b, we deﬁne the area error\nto be\nXn\ni=1|bi −aix||ai −bi\nx |,\n(2.1)\nwhich is equal to\nXn\ni=1(bi −aix)(ai −bi\nx ),\nfor x ∈R+.\nConsidering the problem of ﬁnding a symmetric and positive deﬁnite solution to\nthe overdetermined system of linear equations DX ≃T , in which both D and T\ninclude error, the values DX and T X−1 are predicted values for T and D from the\nmodel DX ≃T ; hence, vectors ∆T j = (DX −T )j and ∆Dj = (D −T X−1)j are\nthe entries of errors in the jth column of T and D, respectively. Extending the error\n3\nformulation (2.1), the value\nE =\nXn\nj=1(DXj −Tj)T (Dj −(T X−1)j\n(2.2)\nseems to be an appropriate measure of error. We also have\nE =\nXn\nj=1\nXm\ni=1(DX −T )ij(D −T X−1)ij = tr((DX −T )T (D −T X−1)),\n(2.3)\nwith tr(.) standing for trace of a matrix. Therefore, the problem can be formulated\nas\nmin\nX≻0 tr((DX −T )T (D −T X−1)),\n(2.4)\nwhere X is symmetric and by X ≻0, we mean X is positive deﬁnite. Problem (9)\nposes a newly deﬁned EIV model for solving the positive deﬁnite linear system of\nequations.\nIn Lemma 2.2, we represent an equivalent formulation for the error, E. First, consider\nto a well-known property of positive deﬁnite matrices. Note A matrix X ∈Rn×n is\npositive deﬁnite if and only if there exists a nonsingular matrix Y ∈Rn×n such that\nX = Y Y T .\nThe following results about the trace operator are also well-known; e.g., see [21].\nLemma 2.1. For an nonsingulartible matrix P ∈Rn×n and arbitrary matrices\nY ∈Rn×n, A ∈Rm×n and B ∈Rn×m we have\n(1)\ntr(Y ) = tr(P −1Y P).\n(2)\ntr(AB) = tr(BA).\nLemma 2.2. The error E, deﬁned by (2.3), is equal to\nE = ∥DY −T Y −T ∥2\nF\n(2.5)\nwhere X = Y Y T and ∥.∥F denotes the Frobenius norm of a matrix.\nProof. Substituting X = Y Y T in (2.3) and using Lemma 2.1, we get\nE = tr((DX −T )T(D −T X−1)) = tr((DX −T )T (DX −T )X−1)\n= tr((DX −T )T(DX −T )Y −T Y −1) = tr(Y −1(DX −T )T (DX −T )Y −T )\n= tr((DXY −T −T Y −T )\nT (DXY −T −T Y −T ))\n= tr((DY −T Y −T )\nT (DY −T Y −T ))\n= ∥DY −T Y −T ∥2\nF .\nConsidering this new formulation for E, it can be concluded that by use of our newly\ndeﬁned EIV model, computing a symmetric and positive deﬁnite solution to the over-\ndetermined system of equations DX ≃T is equivalent to computing a nonsingular\nmatrix Y ∈Rn×n to be the solution of\nmin ∥DY −T Y −T ∥2\nF ,\n4\nand letting X = Y Y T . A similar result is obtained by considering the over-determined\nsystem DX ≃T with X = Y Y T and multiplying both sides by Y −T . We have,\nDY Y T ≃T,\nor equivalently,\nDY ≃T Y −T .\n(2.6)\nNow, to assign a solution to (2.6), it makes sense to minimize the norm of residual.\nThus, to compute X = Y Y T , it is suﬃcient to let Y to be the solution of\nmin ∥DY −T Y −T ∥2\nF .\nNote An appropriate characteristic of the error formulation proposed by (2.3) is\nthat for a symmetric and positive deﬁnite matrix X, the value of E is nonnegative\nand it is equal to zero if and only if DX = T .\n3. Mathematical Solution: Full Rank Data Matrix. Here, we are to de-\nvelop an algorithm for solving (2.4) with the assumption that D has full column rank.\nUsing Lemma 2.1, with X being symmetric, we have\ntr((DX −T )T (D −T X−1)) = tr(DT DX + X−1T T T ) −2 tr(T TD).\nSo, (2.4) can be written as\nmin tr(AX + X−1B),\n(3.1)\nwhere A = DT D and B = T T T and the symmetric and positive deﬁnite matrix X is\nto be computed.\nCorollary 3.1. For each X∗satisfying the ﬁrst order necessary conditions of\n(3.1), the suﬃcient optimality conditions described in Theorem ?? are satisﬁed and\nsince Φ(X) = tr(AX + X−1B) is convex on the cone of symmetric positive deﬁnite\nmatrices, we can conﬁrm that the symmetric positive deﬁnite matrix satisfying the\nKKT necessary conditions mentioned in Theorem ?? is the unique global solution of\n(3.1).\nComputing the positive deﬁnite matrix satisfying KKT conditions. As\nmentioned in Theorem ??, the KKT conditions lead to the nonlinear matrix equation\nXAX = B.\n(3.2)\nNote that (3.2) is an special case of the continuous time Riccati equation (CARE),\n[22]\nAT XE + ET XA −(ET XB + S)R−1(BT XE + ST ) + Q = 0,\n(3.3)\nwith R = 0, E = A\n2 and Q = −B. There is a MATLAB routine to solve CARE for\narbitrary values of A, E, B, S, R and Q. To use the routine, it is suﬃcient to type\nthe command\n5\nX=care(A,B,Q,R,S,E),\nfor the input arguments as in (3.3). Higham [22] developed an eﬀective method for\ncomputing the positive deﬁnite solution to this special CARE when A and B are sym-\nmetric and positive deﬁnite using well-known decompositions. Lancaster and Rodman\n([28]) also discussed solving diﬀerent types of algebraic Riccati equations. Moreover,\nthey derived a perturbation analysis for these matrix equations.\nNote (QR decomposition) The QR decomposition [27] of a matrix A ∈Rm×n\nwith m ≥n, is a decomposition of the form A = QR, where R is an m × n upper\ntriangular matrix and Q satisﬁes QQT = QT Q = I. Moreover, if A has full column\nrank, then R also has full column rank.\nNote (Cholesky decomposition) A Cholesky decomposition [27] of a symmetric\npositive deﬁnite matrix A ∈Rn×n is a decomposition of the form A = RT R, where R,\nknown as the Cholesky factor of A, is an n × n nonsingular upper triangular matrix.\nNote (Spectral decomposition) [27] All eigenvalues of a symmetric matrix, A ∈\nRn×n, are real and there exists an orthonormal matrix with columns representing the\ncorresponding eigenvectors. Thus, there exist an orthonormal matrix U with columns\nequal to the eigenvectors of A and a diagonal matrix D containing the eigenvalues\nsuch that A = UDU T. Also, if A is positive deﬁnite, then all of its eigenvalues are\npositive, and so we can set D = S2. Thus, spectral decomposition for a symmet-\nric positive deﬁnite matrix A is a decomposition of the form A = US2U T , where\nU T U = UU T = I and S is a diagonal matrix.\nTheorem 3.2. [22] Assume D, T ∈Rm×n with m ≥n are known and rank(D) =\nrank(T ) = n.\nLet D = QR be the QR factorization of D.\nLet A = DT D and\nB = T T T . Deﬁne the matrix ˜Q = RBRT and compute its spectral decomposition,\nthat is, ˜Q = RBRT = U ˜S2U T . Then, (3.1) has a unique solution, given by\nX∗= R−1U ˜SU T R−T .\nProof. Based on Theorem ?? and the afterwards discussion, it is suﬃcient to show\nthat X∗satisﬁes the necessary optimality conditions, X∗AX∗= B. Note that from\nD = QR, we have\nA = DT D = RT QT QR = RT R.\nSubstituting X∗, we have\nX∗AX∗= R−1U ˜SU T R−T RT RR−1U ˜SU T R−T\n= R−1U ˜S2U T R−T = R−1RBRT R−T = B.\nNote To compute R, it is also possible to ﬁrst compute A = DT D and then calculate\nthe Cholesky decomposition for A. However, because of more stability, in Theorem\n3.2 the QR decomposition of D is used.\n6\nWe are now ready to outline the steps of our proposed algorithm.\nSolving the EIV model for positive deﬁnite linear system using QR\ndecomposition.\nCompute the QR decomposition for D and let D = QR.\nLet ˜Q = RBRT , where B = T TT and compute the spectral decomposition of ˜Q, that\nis, ˜Q = U ˜S2U T .\nSet X∗= R−1U ˜SU T R−T .\nSet E = tr((DX∗−T )T (D −T X∗−1)).\nNote that Algorithm 1 computes the solution of (2.4) directly.\nThe following theorem shows that by use of spectral decomposition of A a method\nsimilar to the one introduced in [22] is in hand for solving the continuous time Riccati\nequation.\nTheorem 3.3. Let A = DT D and B = T T T with D, T ∈Rm×n, m ≥n and\nrank(D) = n. Let the spectral decomposition of A be A = US2U T . Deﬁne the matrix\n˜Q = SU TBUS and compute its spectral decomposition, ˜Q = SU T BUS = ¯U ¯S2 ¯U T .\nThen, the unique minimizer of (3.1) is\nX∗= US−1 ¯U ¯S ¯U T S−1U T .\nProof.\nSimilar to the proof of Theorem 3.2, it is suﬃcient to show that the\nmentioned X∗satisﬁes X∗AX∗= B. Substituting X∗, we have\nX∗AX∗\n= US−1 ¯U ¯S ¯U T S−1U T US2U T US−1 ¯U ¯S ¯U T S−1U T\n= US−1 ¯U ¯S2 ¯U T S−1U T = US−1SU T BUSS−1U T = B.\nNext, based on Theorem 3.3, we outline an algorithm for solving (2.4).\nSolving the EIV model for positive deﬁnite linear system using spectral\ndecomposition.\nLet A = DT D and compute its spectral decomposition: A = US2U T .\nLet ˜Q = SU T BUS, where B = T TT and compute the spectral decomposition of ˜Q,\nthat is, ˜Q = ˜U ˜S2 ˜U T .\nSet X∗= US−1 ˜U ˜S ˜U T S−1U T .\nSet E = tr((DX∗−T )T (D −T X∗−1)).\nIn Section 4 we generalize our proposed method for solving positive deﬁnite linear\nsystem of equations when the data matrix is rank deﬁcient.\n7\n4. Mathematical Solution: Rank Deﬁcient Data Matrix. Since the data\nmatrix D is usually produced from experimental measurements, we may have rank(D) <\nn. Here, we are to generalize Algorithm 1 for solving (2.4), assuming that rank(D) =\nr < n. In Section 4.1 we outline two algorithms to compute the general solution of\n(2.4). It will be shown that, in general, (2.4) may not have a unique solution. Hence,\nin section 4.2 we discuss how to ﬁnd a particular solution of (2.4) having desirable\ncharacteristics for control problems.\n4.1. General solution. Based on theorems ?? and ??, a symmetric positive\ndeﬁnite matrix X∗is a solution of (2.4) if and only if\nX∗AX∗= B.\n(4.1)\nTherefore, in the following, we discuss how to ﬁnd a symmetric positive deﬁnite matrix\nX∗satisfying (4.1).\nFirst we note that in case D and T are rank deﬁcient, there might be no solution for\n(4.1), and if there is any, it is not necessarily a unique solution; see, e.g., [22]. Higham\n[22] considered to X = B\n1\n2 (B\n1\n2 AB\n1\n2 )\n−1\n2 B\n1\n2 as a solution of (4.1), which is symmetric\nand positive semideﬁnite. However, we are interested in ﬁnding a symmetric positive\ndeﬁnite solution to (4.1). Hence, in the following, ﬁrst the necessary and suﬃcient\nconditions on A and B to guarantee the existence of positive deﬁnite solution to (4.1)\nare discussed. We then outline two algrithms to compute such a solution.\nLet the spectral decomposition of A be A = U\n\u0012\nS2\n0\n0\n0\n\u0013\nU T , where S2 ∈Rr×r\nis a diagonal matrix having the positive eigenvalues of A as its diagonal entries. Sub-\nstituting the decomposition in (4.1), we get\nX∗U\n\u0012 S2\n0\n0\n0\n\u0013\nU T X∗= B.\n(4.2)\nSince U is orthonormal, (4.2) can be written as\nU T X∗U\n\u0012 S2\n0\n0\n0\n\u0013\nU T X∗U = U T BU.\nThen, letting ˜X = U T XU and ˜B = U T BU, we have\n˜X\n\u0012 S2\n0\n0\n0\n\u0013\n˜X = ˜B.\n(4.3)\nThus, the matrix X = U ˜XU T is a solution of (2.4) if and only if ˜X is symmetric posi-\ntive deﬁnite and satisﬁes (4.3). Substituting the block form ˜X =\n\u0012\n˜Xrr\n˜Xr,n−r\n˜Xn−r,r\n˜Xn−r,n−r\n\u0013\n,\nwhere ˜Xrr ∈Rr×r, ˜Xr,n−r = ˜XT\nn−r,r ∈Rr×(n−r) and ˜Xn−r,n−r ∈R(n−r)×(n−r), in\n(4.3) leads to\n\u0012\n˜XrrS2 ˜Xrr\n˜XrrS2 ˜Xr,n−r\n˜Xn−r,rS2 ˜Xrr\n˜Xn−r,rS2 ˜Xr,n−r\n\u0013\n= ˜B =\n\u0012\n˜Brr\n˜Br,n−r\n˜Bn−r,r\n˜Bn−r,n−r\n\u0013\n,\n(4.4)\nwhich is satisﬁed if and only if\n˜XrrS2 ˜Xrr = ˜Brr,\n(4.5a)\n8\n˜XrrS2 ˜Xr,n−r = ˜Br,n−r,\n(4.5b)\n˜Xn−r,rS2 ˜Xr,n−r = ˜Bn−r,n−r.\n(4.5c)\nBefore discussing how to compute ˜X, we show that if (4.1) has a symmetric and\npositive deﬁnite solution, then ˜Brr must be nonsingular. The matrix ˜Xrr as a main\nminor of the positive deﬁnite matrix ˜X is nonsingular.\nS is also supposed to be\nnonsingular. Hence, it can be concluded from (4.5a) that ˜Brr is nonsingular.\nLet ¯D = S and suppose ¯T satisﬁes ¯T T ¯T = ˜Brr. Consider problem (2.4) corre-\nsponding to the data and target matrices ¯D and ¯T as follows:\nmin\n¯\nX≻0 tr(( ¯D ¯X −¯T)T ( ¯D −¯T ¯X−1)).\n(4.6)\nWe know from theorems\n?? and\n?? that the necessary and suﬃcient optimality\nconditions for the unique solution of problem (4.6) implies (4.5a). Thus, ˜Xrr can be\ncomputed using Algorithm 1 for the input arguments ¯D and ¯T. Substituting the\ncomputed ˜Xrr in (4.5b), the linear system of equations\n˜XrrS2 ˜Xr,n−r = ˜Br,n−r\n(4.7)\narises, where ˜Xrr, S2 ∈Rr×r are known and ˜Xr,n−r ∈Rr×(n−r) is to be computed.\nSince ˜Xrr is positive deﬁnite and S2 is nonsingular, the coeﬃcient matrix of the linear\nsystem (4.7) is nonsingular and ˜Xr,n−r can be uniquely computed.\nIt is clear that since ˜X is symmetric, ˜Xn−r,r is the same as ˜XT\nr,n−r. Now, we check\nwhether the computed ˜Xn−r,r and ˜Xr,n−r satisfy (4.5c). Inconsistency of (4.6) means\nthat there is no symmetric positive deﬁnite matrix satisfying (4.5a)-(4.5c), and if so,\n(2.4) has no solution. Thus, in solving an speciﬁc positive deﬁnite system with rank\ndeﬁcient data and target matrices using the presented EIV model, a straightforward\nmethod to investigate the existence of solution is to check whether (4.5c) holds for\nthe given data and target matrices. On the other hand, for numerical results, it is\nnecessary to generate meaningful test problems. Hence, in the following two lemmas,\nwe investigate the necessary and suﬃcient conditions for satisfaction of (4.5c).\nLemma 4.1. Let the spectral decomposition of A be determined as\nA = U\n\u0012\nS2\n0\n0\n0\n\u0013\nU T\nwhere S2 ∈Rr×r and rank(A) = rank(B) = r. The necessary and suﬃcient condition\nfor satisfaction of (4.5c) is\nBUr(Ur\nT BUr)\n−1Ur\nT B −B ∈Null(Un−r\nT ).\nProof.\nFrom (4.5a), we have\n˜X−1\nrr S−2 ˜X−1\nrr = ˜B−1\nrr ,\n(4.8)\nand from (4.5c), we get\n˜Xr,n−r = S−2 ˜X−1\nrr ˜Br,n−r,\n(4.9)\n9\n˜Xn−r,r = ˜Bn−r,r ˜X−1\nrr S−2.\n(4.10)\nManipulating (4.5c) with (4.8) and (4.9), we get\n˜Bn−r,r ˜B−1\nrr ˜Br,n−r = ˜Bn−r,n−r.\n(4.11)\nConsidering the block form U =\n\u0000Ur\nUn−r\n\u0001\n, where Ur ∈Rn×r and Un−r ∈\nRn×(n−r), we have\n˜B = U T BU =\n\u0012\nUr\nT\nUn−r\nT\n\u0013\nB\n\u0000 Ur\nUn−r\n\u0001\n=\n\u0012\nUr\nT BUr\nUr\nT BUn−r\nUn−r\nT BUr\nUn−r\nT BUn−r\n\u0013\n.\nRewriting (4.11) results in\nUn−r\nT BUr(Ur\nT BUr)\n−1Ur\nT BUn−r = Un−r\nT BUn−r,\n(4.12)\nwhich is equivalent to (e.g., see [20])\nBUr(Ur\nT BUr)\n−1Ur\nT B = B + Z,\n(4.13)\nwhere Z ∈Rn×n is in the null space of Un−r\nT . Thus, (4.1) has a positive deﬁnite\nsolution if and only if\nBUr(Ur\nT BUr)\n−1Ur\nT B −B ∈Null(Un−r\nT ).\n(4.14)\nNote For real problems with arbitrary values of D and T , the necessary and\nsuﬃcient condition given in Lemma 4.1 may not be satisﬁed, in general. Hence, we\nare to propose a threshold to determine if\nF = Un−r\nT \u0010\nBUr(Ur\nT BUr)\n−1Ur\nT B −B\n\u0011\n(4.15)\nis close enough to zero. In the following, we show that if ∥F∥< δ, for a suﬃciently\nsmall scalar δ, then Xr(n−r) computed from (4.5b) is a proper approximation for the\nsolution of (4.5c). Substituting F in (4.12), we have\n˜Bn−r,r ˜B−1\nrr ˜Br,n−r −˜Bn−r,n−r = FUn−r,\n(4.16)\nand\n˜Xn−r,rS2 ˜Xr,n−r −˜Bn−r,n−r = FUn−r.\n(4.17)\nLet X∗satisfy (4.5c), that is,\nX∗n−r,rS2X∗r,n−r −˜Bn−r,n−r = 0.\n(4.18)\nThen, we have\n˜Xn−r,rS2 ˜Xr,n−r −X∗n−r,rS2X∗r,n−r = FUn−r.\n(4.19)\n10\nLetting ˜Y = S ˜Xr,n−r and Y ∗= SX∗r,n−r, (4.19), we get\n˜Y T ˜Y −Y ∗T Y ∗= FUn−r\n(4.20)\nand\n˜yT\ni ˜yj −y∗\ni\nT y∗\nj = (FUn−r)ij,\n(4.21)\nwhere ˜yi and y∗\ni are the ith column of ˜Y and Y ∗respectively. Now, since the 2 norm\nof each column of Un−r is equal to one, every entry of Un−r is less than or equal to\none. Moreover, under the assumption ∥F∥< δ, none of the entries of F are greater\nthan δ. Hence, we have\n|(FUn−r)ij| = |f T\ni uj| ≤|fi1 + · · · + fi(n−r)| < (n −r)δ,\n(4.22)\nwhere f T\ni and uj are the ith row of F and the jth column of Un−r respectively. Now,\n(4.21) together with (4.22) gives\n| ˜yi\nT ˜yj −y∗\ni\nT y∗\nj | < (n −r)δ.\n(4.23)\nHence, there is a constant cij such that\n|˜yij −y∗\nij| < cij,\n(4.24)\nwhere ˜yij and y∗\nij are the (i, j)th entry of ˜Y and Y ∗respectively.\nLetting S =\ndiag(s1, · · · , sr), from (4.24) we get\n|si||( ˜Xn−r,r)ij −(X∗\nn−r,r)ij| ≤cij,\n(4.25)\nfor i = 1, · · · , r and j = 1, · · · , n −r and\n∥˜Xr,n−r −X∗r,n−r∥≤C.\nHence, assuming\n˜Xr,r = X∗r,r,\nwe have ∥˜X −X∗∥< α which means that if FUn−r is close enough to zero, then the\ncomputed solution from the approximate satisfaction of (4.5c) would be close enough\nto the exact solution.\nIn the following lemma, we give a suﬃcient condition which guarantees the existence\nof a solution for (4.1). We later use this result to generate consistent test problems\nin Section 6.\nLemma 4.2. Let the spectral decomposition of B be B = V\n\u0012 P2\n0\n0\n0\n\u0013\nV T , where\nP2 ∈Rr×r and rank(A) = rank(B) = r. A suﬃcient condition for satisfaction of\n(4.5c) is that\nV = U\n\u0012\nQ\n0\n0\nP\n\u0013\n,\n(4.26)\nwhere Q ∈Rr×r and P ∈R(n−r)×(n−r) satisfy QQT = QT Q = I and PP T = P T P =\nI.\n11\nProof. A possible choice for Z in Lemma 4.2 is zero, for which (4.13) is equivalent\nto\nUr(Ur\nT BUr)\n−1Ur\nT = B+ + W,\n(4.27)\nwith W ∈Rn×n in the null space of B. To obtain a simpliﬁed suﬃcient condition\nfor existence of a positive deﬁnite solution to (4.1), we let W = 0.\nMultiplying\n(4.27) by Ur\nT and Ur respectively on the left and right, and substituting the spectral\ndecomposition of B, we get\n(Ur\nT Vr\nX2\nVr\nT Ur)\n−1\n= Ur\nT B+Ur = Ur\nT Vr\nX−2\nVr\nT Ur.\n(4.28)\nLetting M = Ur\nT Vr, we get\n(M\nX2\nM T )\n−1\n= M\nX−2\nM T .\n(4.29)\nSince M has full rank, we get\nM −TX−2M −1 = M\nX−2M T .\n(4.30)\nNow, since P−2 is nonsingular, (4.30) holds if and only if\nM T M = I.\n(4.31)\nThis leads to\n(Ur\nT Vr)\nT Ur\nT Vr = Vr\nT UrUr\nT Vr = I.\n(4.32)\nSince U is orthonormal, we have UU T = UrUr\nT + Un−rUn−r\nT = I. Hence, we get\nUrUr\nT = I −Un−rUn−r\nT .\n(4.33)\nSubstituting (4.33) in (4.32), we get\nVr\nT (I −Un−rUn−r\nT )Vr = I −Vr\nT Un−rUn−r\nT Vr = I,\n(4.34)\nwhich is satisﬁed if and only if Un−r\nT Vr = 0.\nSince the columns of Ur form an\northogonal basis for the null space of Un−r\nT [27], it can be concluded that each\ncolumn of Vr is a linear combination of the columns of Ur. Thus,\nVr = UrQ\n(4.35)\nis a necessary condition for (4.31) to be satisﬁed, and since both Ur and Vr have\northogonal columns, Q ∈Rr×r satisﬁes QQT = QTQ = I. On the other hand, we\nknow from the deﬁnition of the spectral decomposition that V V T = UU T = I. Thus,\nVrVr\nT + Vn−rVn−r\nT = I,\nUrUr\nT + Un−rUn−r\nT = I.\n(4.36)\n12\nManipulating (4.35) with (4.36), we get\nVn−rVn−r\nT = Un−rUn−r\nT ,\n(4.37)\nwhich holds if and only if there exists a matrix P ∈R(n−r)×(n−r) such that PP T =\nP T P = I and\nVn−r = PUn−r.\n(4.38)\nIt can be concluded from (4.35) and (4.38) that V = U\n\u0012 Q\n0\n0\nP\n\u0013\n, where QQT =\nQT Q = I and PP T = P T P = I.\nCorollary 4.3.\nThe matrices P and Q deﬁned in Lemma 4.1 can set to be\nrotation matrices [27] to satisfy\nPP T = P T P = I,\nQQT = QT Q = I.\nThus, to compute a target matrix, T , satisfying Lemma 4.1, it is suﬃcient to ﬁrst\ncompute V from (4.26) with Q ∈Rr×r and P ∈R(n−r)×(n−r) arbitrary rotation\nmatrices and U as deﬁned in Lemma 4.1 and then set T = ¯U\n\u0012 P\n0\n0\n0\n\u0013\nV T , where\n¯U ∈Rm×m and P ∈Rr×r are arbitrary orthonormal and diagonal matrices.\nThus,\nproblem (2.4) has a solution if and only if the data and target matrices satisfy (4.14).\nIn this case, ˜Xrr, ˜Xr,n−r and its transpose, ˜Xn−r,r, are respectively computed from\n(4.5a) and (4.5b). Hence, the only remaining step is to compute ˜Xn−r,n−r so that ˜X\nis symmetric and positive deﬁnite.\nWe know that ˜X is symmetric positive deﬁnite if and only if there exists a nonsingular\nlower triangular matrix L ∈Rn×n so that\n˜X = LLT ,\n(4.39)\nwhere L is lower triangular and nonsingular.\nConsidering the block forms ˜X =\n\u0012\n˜Xrr\n˜Xr,n−r\n˜Xn−r,r\n˜Xn−r,n−r\n\u0013\nand L =\n\u0012\nLrr\n0\nLn−r,r\nLn−r,n−r\n\u0013\n, where Ln−r,r is an (n −\nr) × r matrix and Lrr ∈Rr×r and Ln−r,n−r ∈R(n−r)×(n−r) are nonsingular lower\ntriangular matrices, we get\n\u0012\n˜Xrr\n˜Xr,n−r\n˜Xn−r,r\n˜Xn−r,n−r\n\u0013\n=\n\u0012\nLrr\n0\nLn−r,r\nLn−r,n−r\n\u0013 \u0012\nLrr\nT\nLn−r,r\nT\n0\nLn−r,n−r\nT\n\u0013\n.\n(4.40)\nThus,\n˜Xrr = LrrLrr\nT ,\n(4.41a)\n˜Xr,n−r = LrrLn−r,r\nT ,\n(4.41b)\n˜Xn−r,r = Ln−r,rLrr\nT ,\n(4.41c)\n13\n˜Xn−r,n−r = Ln−r,rLn−r,r\nT + Ln−r,n−rLn−r,n−r\nT .\n(4.41d)\nTherefore, to compute a symmetric positive deﬁnite ˜X, (4.41a)–(4.41d) must be satis-\nﬁed. Let ˜Xrr = ˜L˜LT be the Cholesky decomposition of ˜Xrr. Lrr = ˜L satisﬁes (4.41a).\nSubstituting Lrr in (4.41b), Ln−r,r\nT is computed uniquely by solving the resulting\nlinear system. Since (4.41c) is transpose of (4.41b), it does not give any additional\ninformation. Finally, to compute a matrix ˜Xn−r,n−r to satisfy (4.41d), it is suﬃcient\nto choose an arbitrary lower triangular nonsingular matrix Ln−r,n−r and substitute it\nin (4.41d). The resulting ˜Xn−r,n−r gives a symmetric positive deﬁnite ˜X as follows:\n˜X =\n\u0012\n˜Xrr\n˜Xr,n−r\n˜Xn−r,r\n˜Xn−r,n−r\n\u0013\n.\nNow, based on the above discussion, we outline the steps of our algorithm for solving\n(2.4) in the case rank(D) = r < n.\n14\nSolving the EIV model for positive deﬁnite linear system with rank\ndeﬁcient data and target matrices using spectral decomposition.\nδ as the upper bounds for absolute error is taken to be close to the machine (or\nuser’s) zero.\nLet A = DT D and compute its spectral decomposition:\nA = U\n\u0012 S2\n0\n0\n0\n\u0013\nU T .\nLet B = T TT and ˜B = U T BU.\nCompute rank(D) = r and let\n˜Brr = ˜B(1 : r, 1 : r),\n˜Br,n−r = ˜B(1 : r, r + 1 : n),\n˜Bn−r,n−r = ˜B(r + 1 : n, r + 1 : n)\nLet ¯D = S, assume ¯T satisﬁes ˜Brr = ¯T T ¯T.\nPerform Algorithm 1 with input parameters D = ¯D and T = ¯T, and let ˜Xrr = X∗.\nSolve the linear system (4.5b) to compute ˜Xr,n−r and let ˜Xn−r,r = ˜XT\nr,n−r.\nCompute the spectral decomposition for B, that is, B = V\n\u0012 D2\n0\n0\n0\n\u0013\nV T . Compute\nM = Ur\nT Vr.\nIf ∥Un−r\nT (BUr(Ur\nT BUr)\n−1Ur\nT B −B)∥≥δ stop ((2.4) has no solution)\nElse\nLet the Cholesky decomposition of ˜Xrr be ˜Xrr = ˜L˜LT and set Lrr = ˜L.\nSolve the lower triangular system (4.41b) to compute Ln−r,r.\nLet Ln−r,n−r ∈R(n−r)×(n−r) be an arbitrary nonsingular lower triangular matrix and\ncompute ˜Xn−r,n−r using (4.41d).\nLet ˜X =\n\u0012\n˜Xrr\n˜Xr,n−r\n˜Xn−r,r\n˜Xn−r,n−r\n\u0013\nand X∗= U ˜XU T .\nCompute E = tr((DX∗−T )(D −T X∗−1)).\nEndIf.\nNext, we show how to use the complete orthogonal decomposition of the data matrix\nD instead of the spectral decomposition of A.\nNote (Complete Orthogonal Decomposition) [27] Let A ∈Rm×n be an arbi-\ntrary matrix with rank(A) = r. There exist R ∈Rr×r, U ∈Rm×m and V ∈Rn×n\nso that R ∈Rr×r is upper triangular, UU T = U T U = I, V V T = V T V = I and\nA = U\n\u0012 R\n0\n0\n0\n\u0013\nV T .\nNext, Algorithm 4 is presented using the complete orthogonal decomposition\nof D.\n15\nSolving the EIV model for positive deﬁnite linear system with rank de-\nﬁcient data and target matrices using complete orthogonal decomposition.\nδ as the upper bounds for absolute error is taken to be close to the machine (or\nuser’s) zero.\nCompute the complete orthogonal decomposition of D, that is,\nD = U\n\u0012\nR\n0\n0\n0\n\u0013\nV T .\n(4.42)\nLet A = DT D = VrRT RVr\nT , B = T T T and ˜B = V T BV , where Vr consists of the\nﬁrst r columns of V .\nCompute rank(D) = r and let\n˜Brr = ˜B(1 : r, 1 : r),\n˜Br,n−r = ˜B(1 : r, r + 1 : n),\n˜Bn−r,n−r = ˜B(r + 1 : n, r + 1 : n).\nLet ¯D = R, assume ¯T satisﬁes ˜Brr = ¯T T ¯T.\nPerform Algorithm 1 with input parameters D = ¯D and T = ¯T, and let ˜Xrr = X∗.\nSolve the linear system (4.5b) to compute ˜Xr,n−r and let ˜Xn−r,r = ˜XT\nr,n−r.\nCompute the spectral decomposition for B, that is, B = V\n\u0012 D2\n0\n0\n0\n\u0013\nV T . Compute\nM = Ur\nT Vr.\nIf ∥Un−r\nT (BUr(Ur\nT BUr)\n−1Ur\nT B −B)∥≥δ stop ((2.4) has no solution)\nElse\nLet the Cholesky decomposition of ˜Xrr be ˜Xrr = ˜L˜LT and set Lrr = ˜L.\nSolve the lower triangular system (4.41b) to compute Ln−r,r.\nLet Ln−r,n−r ∈R(n−r)×(n−r) be an arbitrary nonsingular lower triangular matrix and\ncompute ˜Xn−r,n−r using (4.41d).\nLet ˜X =\n\u0012\n˜Xrr\n˜Xr,n−r\n˜Xn−r,r\n˜Xn−r,n−r\n\u0013\nand X∗= U ˜XU T .\nCompute E = tr((DX∗−T )(D −T X∗−1)).\nEndIf.\nThus, based on the above study, the computational complexity of PDEIV-QR is lower\nthan that of PDEIV-Spec, for all matrix sizes. But, for the case of rank deﬁcient data\nmatrix, depending on the matrix size and rank, one of the algorithms PDEIV-RD-\nSpec and PDEIV-RD-COD may have a lower computational complexity.\nREFERENCES\n[1] Alizadeh F., Pierre J., Heaberly A., Overton M. L.: Primal-dual interior point methods for\nsemideﬁnite programming: convergence rates, stability and numerical result, SIAM J. Op-\ntim., 8, 746-768 (1998)\n[2] Aubry A., Maio A. D., Pallotta L., Farina A.: Maximum likelihood estimation of a structured\ncovariance matrix with a condition number constraint, IEEE Trans. On Signal Processing,\n60(6), 3004-3021 (2012)\n[3] Cheng C. L., Kukush A., Mastronardi N., Paige C., Van Huﬀel S.: Total Least Squares and\nErrors-in-variables Modeling, Comput Stat Data An, 52, 1076-1079 (2007)\n16\n[4] Deng Y., Boley D.: On the Optimal Approximation for the Symmetric Procrustes Problems of\nthe Matrix Equation AXB = C, Proceedings of the International Conference on Compu-\ntational and Mathematical Methods in Science and Engineering, Chicago, 159-168 (2007)\n[5] Dolan E. D, Mor´e J. J.: Benchmarking optimization software with performance proﬁles, Math-\nematical Programming, 91, 201-213 (2012)\n[6] Golub G. H., Van Loan C. F.: An analysis of the total least squares problem, SIAM J. Numer.\nAnal., 17, 883-893 (1980)\n[7] Hayami K., Yin J. F., Ito T.: GMRES method for least squares problems, SIAM. J. Matrix\nAnal. and Appl., 31(5), 2400-2430 (2010)\n[8] Hnˇetynkov´a I., Pleˇsinger M., Sima D. M., Strakoˇs Z., Van Huﬀel S.: The total least squares\nproblem in AX ≈B, A new classiﬁcation with the relationship to the classical works,\nSIAM J. Matrix Anal. Appl., 32(3), 748-770 (2011)\n[9] Hu H., Olkin I.: A numerical procedure for ﬁnding the positive deﬁnite matrix closest to a\npatterned matrix, Statistical and Probability Letters, 12, 511-515 (1991)\n[10] Hu H.: Positive deﬁnite constrained least-squares estimation of matrices, Linear Algebra and\nits Applications, 229, 167-174 (1995)\n[11] Van Huﬀel S., Vandewalle J.: Algebraic connections between the least squares and total least\nsquares problems, Numer. Math., 55, 431-449 (1989)\n[12] Kang B., Jung S., Park P.: A new iterative method for solving total least squares problem,\nProceeding of the 8th Asian Control Conference (ASCC), Kaohsiung, Taiwan, (2011)\n[13] Larson H. J.: Least squares estimation of the components of a symmetric matrix, Technomet-\nrics, 8(2), 360-362 (1966)\n[14] McInroy J., Hamann J. C.:\nDesign and control of ﬂexure jointed hexapods, IEEE Trans.\nRobotics and Automation, 16(4), 372-381 (2000)\n[15] Mor´e J. J., Wild S. M.: Benchmarking derivative-free optimization algorithms, SIAM J. Optim.,\n20, 172-191 (2009)\n[16] Paige C. C., Strakoˇs Z.: Scaled total least squares fundamentals, Numer. Math., 91, 117-146\n(2000)\n[17] Poignet P., Gautier M.: Comparison of Weighted Least Squares and Extended Kalman Filtering\nMethods for Dynamic Identiﬁcation of Robots, Proceedings of the IEEE Conference on\nRobotics and Automation, San Francisco, CA, USA, 3622-3627 (2000)\n[18] Woodgate K. G.: Least-squares solution of F = P G over positive semideﬁnite symmetric P,\nLinear Algebra Appl., 245, 171-190 (1996)\n[19] Zhou L., Lin L., Wei Y., Qiao S.: Perturbation analysis and condition numbers of scaled total\nleast squares problems, Numer. Algorithms, 51, 381-399 (2009)\n[20] Banerjee S., Roy A.: Quadratic Forms, Linear Algebra and Matrix Analysis for Statistics,\nChapman Hall/CRC Texts in Statistical Sciences, 441-442 (2014)\n[21] Gill P. E. , Murray W., Wright M. H.: Numerical Linear Algebra and Optimization, Addison\nWesley, (1991)\n[22] Higham N. J.: Functions of Matrices: Theory and Computation, SIAM, Philadelphia (2008)\n[23] Horn R. A., Johnson C. R.: Topics in Matrix Analysis. Cambridge University Press (1991)\n[24] Van Huﬀel S., Vandewalle J.: The Total Least Squares Problem: Computational Aspects and\nAnalysis. SIAM, Philadelphia (1991)\n[25] Krislock N. G.: Numerical Solution of Semideﬁnite Constrained Least Squares Problems, M.\nSc. Thesis, University of British Colombia (2003)\n[26] Demmel J. W.: Applied Numerical Linear Algebra, 3rd edition, SIAM, Philadelphia (1996)\n[27] Golub G. H., Van Loan C. F.: Matrix Computation, 4th edition, JHU Press (2012)\n[28] Lancaster P., Rodman L.: Algebraic Riccati Equations, Clarendon Press (1995)\n[29] Magnus J. R., Neudecker H.: Matrix Diﬀerential Calculus with Applications in Statistics and\nEconometrics, 2nd edition, John Wiley Sons (1999)\n[30] Nocedal J., Wright S. J.: Numerical Optimization, Springer, New York, (1999)\n[31] Higham N. J.: Computing the nearest correlation matrix (A problem from ?nance), MIMS\nEPrint: 2006.70, http://eprints.ma.man.ac.uk/, (2006). Accessed 26 June 2012\n[32] Petersen\nK.\nB.,\nPedersen\nM.\nS.:\nThe\nMatrix\nCookbook,\nhttp://orion.uwaterloo.ca/\nhwolkowi/matrixcookbook.pdf, (2008). Accessed 11 January 2013\n[33] Vershynin\nR.:\nIntroduction\nto\nthe\nnon-asymptotic\nanalysis\nof\nrandom\nmatrices,\nhttp://arxiv.org/pdf/1011.3027v7.pdf, (2011). Accessed 01 February 2013\n[34] American\nMathematical\nSociety,\nEigenvalues\nand\nsums\nof\nHermitian\nmatrices,\nhttp://www.ams.org/bookstore/pspdf/gsm132prev.pdf,\n(2009).\nAccessed\n18\nMarch\n2013\n17\n0\n0.5\n1\n1.5\n2\n2.5\n3\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−QR\nPDEIV−Spec\n0\n2\n4\n6\n8\n10\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−QR\nPDEIV−Spec\n0\n2\n4\n6\n8\n10\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−QR\nPDEIV−Spec\nHuM\nIntP\n0\n2\n4\n6\n8\n10\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−QR\nPDEIV−Spec\nHuM\nIntP\n0\n0.5\n1\n1.5\n2\n2.5\n3\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−RD−Spec\nPDEIV−RD−COD\n0\n20\n40\n60\n80\n100\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−RD−Spec\nPDEIV−RD−COD\n0\n10\n20\n30\n40\n50\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−RD−Spec\nPDEIV−RD−COD\nHuM\nIntP\n0\n5\n10\n15\n20\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−RD−Spec\nPDEIV−RD−COD\nHuM\nIntP\n0\n0.5\n1\n1.5\n2\n2.5\n3\nx 10\n6\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−RD−Spec\nHuM\nIntP\n0\n100\n200\n300\n400\n500\n0\n0.2\n0.4\n0.6\n0.8\n1\n \n \nPDEIV−RD−Spec\nHuM\nIntP\n"}