{"text": "arXiv:1504.05781v2  [stat.ME]  29 Jun 2015\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n1\nCram´er-Rao Lower Bound for Point Based Image\nRegistration with Heteroscedastic Error Model for\nApplication in Single Molecule Microscopy\nE.A.K. Cohen, D. Kim and R.J. Ober\nAbstract—The Cram´er-Rao lower bound for the estimation\nof the afﬁne transformation parameters in a multivariate het-\neroscedastic errors-in-variables model is derived. The model is\nsuitable for feature-based image registration in which both sets of\ncontrol points are localized with errors whose covariance matrices\nvary from point to point. With focus given to the registration of\nﬂuorescence microscopy images, the Cram´er-Rao lower bound for\nthe estimation of a feature’s position (e.g. of a single molecule)\nin a registered image is also derived. In the particular case\nwhere all covariance matrices for the localization errors are\nscalar multiples of a common positive deﬁnite matrix (e.g. the\nidentity matrix), as can be assumed in ﬂuorescence microscopy,\nthen simpliﬁed expressions for the Cram´er-Rao lower bound are\ngiven. Under certain simplifying assumptions these expressions\nare shown to match asymptotic distributions for a previously\npresented set of estimators. Theoretical results are veriﬁed with\nsimulations and experimental data.\nIndex Terms—Image registration, Cram´er-Rao lower bound,\ngeneralized least squares, ﬂuorescence microscopy.\nI. INTRODUCTION\nI\nMAGE registration is the process of overlaying two or more\nimages of the same scene [1]. Image registration techniques\ncan be divided into two categories; intensity-based registration\nwhere gray scale values are correlated between images, e.g.\n[2] [3], [4], and feature-based registration, whereby corre-\nspondence between the two images is determined through the\nmatching of distinct features common in both images e.g. [5],\n[6].\nThis project is motivated by an important problem in\nsingle molecule microscopy, a recent major advancement in\nﬂuorescence microscopy which allows individual ﬂuorescently\nlabeled molecules to be imaged using optical microscopy\ntechniques and individually localized with accuracies in the\nvery low nanometer range [7], [8], [9]. In a typical experiment\ntwo different proteins in a cell are labeled with different\nThis research was supported in part by the National Institute of Health\ngrant R01 GM085575 and the Engineering and Physical Sciences Research\nCouncil (UK) mathematics platform grant EP/I019111/1.\nE.A.K. Cohen is with the Department of Mathematics, Imperial Col-\nlege London, SW7 2AZ, UK (email: e.cohen@imperial.ac.uk) and R.J.\nOber and D. Kim are with the Department of Biomedical Engineering,\nTexas A&M University, College Station, Texas 77843-3120, USA (email:\nraimund.ober@tamu.edu).\nFirst manuscript received October 02 2014. Resubmitted manuscript re-\nceived April 17 2015. Revised manuscript received June 18 2015. Final\nmanuscript received June 29 2015.\nCopyright (c) 2010 IEEE. Personal use of this material is permitted.\nHowever, permission to use this material for any other purposes must be\nobtained from the IEEE by sending a request to pubs-permissions@ieee.org.\nFig. 1: A diagram illustrating ﬁducial markers visible in\nboth images (left). Each ﬁducial marker’s position is located\nwith a measurement error. Registration requires ﬁnding the\ntransformation that best aligns the ﬁducial markers (right) with\nrespect to an appropriate minimization problem.\nﬂuorescent markers. The biological information is obtained\nfrom the relationship between the two labeled sets of proteins.\nThe imaging experiment consists of taking one exposure\nfor each of the labeled proteins, often using two cameras,\neach equipped with a wavelength dependent optical ﬁlter to\ncapture the emission of the ﬂuorescence for the corresponding\nproteins. In this fashion we obtain two different images each\ndisplaying different aspects of the sample. In order to analyze\nthese images they need to be registered, as it cannot be\nassumed that the cameras are aligned to the degree that is\nnecessary to guarantee the nanometer level accuracy which is\nrequired to obtain the appropriate information. Registration is\ntypically achieved by incorporating ﬁducial markers, usually\nsmall nanometer size beads, into the sample whose ﬂuorescent\nproperties are such they can be imaged in both cameras.\nThese ﬁducial markers can therefore serve as control points\n(CPs) for feature-based registration. The characterization of\nthe registration errors is critical in assessing the deterioration\nof the localization accuracy of a single molecule due to the\nregistration. A number of further single molecule microscopy\nexperiments lead to the same underlying registration problem.\nOne important such example arises from the correction of drift\nin time lapse experiments.\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n2\nPrevious statistical studies on CP registration [10], [11] [12],\n[13], [14], [15], [16], [17] assume one set of positions for the\ncontrol points is taken as truth and errors exist in only the\nsecond set of positions. In such examples a multivariate linear\nregression is used for the data model and the set of localization\nerrors are sometimes referred to as the ﬁducial localization\nerrors (FLEs) [17], [16]. In contrast, a recent study [18] pre-\nsented a multivariate errors-in-variables (EIV) formulation of\nthe control point image registration problem important to the\nmicroscopy application. The errors-in-variables formulation is\nnecessary to model the situation when a ground truth for the\nCP locations is unavailable and the errors in measuring the CP\nlocations are present in both images that are to be registered.\nImportantly, the microscopy application dictates that a het-\neroscedastic model is used as the measurement errors have to\nbe assumed to have different covariance matrices for different\nCPs. A central aspect of the registration problem is the\nestimation of the registration transformation. There have been\nattempts in [19], [20] to estimate registration parameters for\nheteroscedastic errors under an EIV model when the transfor-\nmation is assumed rigid (rotation and translation only) with the\nheteroscedastic EIV (HEIV) algorithm; an iterative procedure\nthat ﬁnds an optimal solution to the HEIV model. However,\nestimator distributions were only determined through boot-\nstrapping methods. In the microscopy setting we take the\nmore general assumption that the registration transformation\nbe afﬁne, allowed due to the high geometrical precision of\nmodern microscope objectives. In [18] we have shown that for\nthis data model a generalized maximum likelihood estimator\nis equivalent to a generalized least squares estimator. Using\nprior results we were able to obtain asymptotic results on\nthe distributions for the estimators for the transformation\nparameters. For a speciﬁc heteroscedastic noise model where\ncovariance matrices are scalar multiples of a known positive\ndeﬁnite matrix, closed form expressions for estimators of the\nafﬁne transformation parameters were derived. This particular\nmodel is applicable in a ﬂuorescence microscopy setting where\nﬁducial markers (e.g. ﬂuorescent beads) act as the CPs but are\neach localized with differing degrees of accuracy.\nRegistration performance is typically quantiﬁed by the\nﬁducial registration error (FRE), which is the root mean-\nsquare distance between ﬁducial markers after registration, and\nmost importantly the target registration error (TRE) which is\nthe difference between corresponding points (other than the\nﬁducial markers) after registration. The distribution of the TRE\nhas been of much interest. Under the multivariate linear regres-\nsion model (which as stated is inappropriate in ﬂuorescence\nmicroscopy) [10], [11] derive approximate expressions for the\nroot mean square of the TRE’s absolute value and [12] gives\nits approximate distribution in the case where the registration\ntransformation is assumed rigid (rotation and translation only)\nand FLEs are independent and identically distributed (iid)\nzero-mean Gaussian. Readers interested in the effect of biased\nFLEs are directed to [21]. Anisotropic iid FLEs are ﬁrst\nconsidered in [15] and [16] derives the maximum likelihood\nestimators for the rigid transformation parameters along with\nthe associated Cram´er-Rao Lower Bounds on their variance for\nthis model. Heteroscedastic FLEs are considered in [17] and\nusing a spatial stiffness model they derive expressions for the\nroot mean square TRE. An overview of these methods is given\nin [22], together with procedures for the optimal selection of\nﬁducial markers with respect to minimizing the TRE.\nIn [18] asymptotic distributions were found for the TRE\nunder the multivariate errors-in-variables data model and\nafﬁne transformation assumption required for ﬂuorescence\nmicroscopy. Further to this, in [18] the asymptotic distribution\nwas also found for the localization registration error (LRE),\na newly deﬁned measure of registration error that combines\nboth a localization error and the TRE of a feature (e.g. single\nmolecule) that is not used in the registration.\nThe quality of a single molecule experiment is assessed by\nthe accuracy with which single molecules are localized in the\nparticular experiment [23]. Here the localization accuracy is\ninterpreted as the standard deviation of an unbiased location\nestimator [24]. In [24] and [25] the fundamental limit of\nlocalization accuracy was introduced as the Cram´er-Rao lower\nbound (CRLB) for the location estimation problem, in the\ncontext of ideal experimental conditions such as an inﬁnite size\nphoton detector without pixilation artefacts and without other\nextraneous noise sources. This measure has proved a reliable\npredictor for the best possible accuracy that can be achieved\nwith a speciﬁc single molecule experiment [26], [27].\nDue to the importance of registration in single molecule\nexperiments the question therefore arises how the uncertainty\nintroduced during the registration process inﬂuences the local-\nization accuracy for a single molecule that has been registered.\nTo this end, a major aspect of this manuscript consists of the\nderivation of the CRLB for the registration problem for several\ndata models that are of relevance here.\nThe CRLB has been derived for registration problems\nbefore. The work of [28] and [29] consider the CRLB for\nfeature-based and intensity-based registration performance in\nseveral scenarios of more general afﬁne transformations be-\ntween the two images, as well as a polynomial based non-\nlinear transformation. However, they restrict themselves to the\nhomoscedastic case, i.e. when all CP measurement errors have\nequal covariance matrix and consider only the CRLB of the\ntransformation parameters themselves.\nThis paper provides the CRLB for registration performance\nwhen a general afﬁne transformation is assumed and in the\ncase of heteroscedastic CP measurement errors assumed zero-\nmean and Gaussian. We give particular focus to a ﬂuorescence\nmicroscopy setting and not only consider the CRLB in esti-\nmating the transformation parameters, but place emphasis on\nﬁnding the lower bound for the covariance matrix of the LRE,\na concise and informative measure of registration performance.\nThe square root of the diagonals of this covariance matrix\n(the standard deviation of the LRE in each dimension) is\nthe accuracy with which single molecules are localized post-\nregistration in each dimension.\nIn Section II we formulate the registration problem and\ndeﬁne the LRE as introduced in [18]. In Section III we\nderive the CRLB for the afﬁne transformation parameters in\nthe most general heteroscedastic setting. In Section IV we\nderive the CRLB for estimating the unknown position of a\nfeature in the registered image, in turn giving a lower bound\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n3\non the variance of the LRE. In Section V we consider the\nspeciﬁc case when the covariance matrices of the measurement\nerrors are a scalar multiple of a common matrix as is the\ncase in a ﬂuorescence microscopy setting. In ﬂuorescence\nmicroscopy it is reasonable to approximate the covariance\nmatrices as multiples of the identity matrix. Further, it is\ncommon for the afﬁne transformation matrix to be a scalar\nmultiple of a unitary matrix (a combination of scaling, rotation\nand reﬂection). In such a scenario we derive an explicit\nexpression for the lower bound of the covariance matrix of\nthe LRE that reveals a more intuitive view of these complex\nexpressions. Importantly, this expression is identical to that\nof the asymptotic covariance of the LRE. This was derived\nin [18] under equivalent assumptions when the registration\nparameters are estimated using the corresponding generalized\nleast-squares or equivalent maximum likelihood estimator. In\nSection VI we verify the theory with simulation studies and\nshow the generalized least-squares estimator of [18] attains\nthis lower bound. We conclude by considering real microscopy\nimaging data and show the CRLB results presented in this\npaper are appropriate in an experimental setting.\nII. FORMULATION\nWe consider the registration experiment formulated in [18].\nThere are K CPs located in both image 1, denoted I1 ⊆Rd,\nand in image 2, denoted I2 ⊆Rd (d = 2 or 3). These\nCPs have true locations {x1,k ∈I1, k = 1, ..., K} and\n{x2,k ∈I2, k = 1, ..., K}, respectively, and these CP coor-\ndinates are related by the afﬁne transformation T : Rd →Rd\nwhere x2,k = T (x1,k) = Ax1,k + s, k = 1, ..., K, with\ninvertible A ∈Rd×d and s ∈Rd. The true positions of\nthe CPs are not known in either image and instead must be\nmeasured with errors. We therefore observe the CP locations\nas {y1,k ∈I1, k = 1, ..., K} and {y2,k ∈I2, k = 1, ..., K},\nwhere yj,k = xj,k + ǫj,k, k = 1, ..., K, j = 1, 2. The\nterm ǫj,k ∈Rd is a random measurement error, sometimes\nreferred to as the ﬁducial localization error (FLE), and are\neach assumed zero mean and to have individual covariance\nmatrix Ωj,k > 0 (where we use notation M > 0 if matrix M is\npositive deﬁnite and M ≥0 if it is non-negative deﬁnite). All\nmeasurement errors are assumed to be pairwise independent\nacross the CPs.\nLet us deﬁne the Rd×K matrices Xj ≡[xj,1, ..., xj,K],\nYj\n≡[yj,1, ..., yj,K] and Ej\n≡[ǫj,1, ..., ǫj,K], j = 1, 2.\nThe measured control point locations can be conveniently\nrepresented as Y1 = X1 + E1 and Y2 = X2 + E2. The latter of\nthese can be equivalently represented as Y2 = AX1+s1T\nK+E2,\nwhere T is the matrix transpose and 1K is a column vector\nof length K with every element taking the value 1. If we\nfurther deﬁne the stacked R2d×K matrices X ≡\n\u0002\nXT\n1 , XT\n2\n\u0003T ,\nY ≡\n\u0002\nY T\n1 , Y T\n2\n\u0003T and E ≡\n\u0002\nET\n1 , ET\n2\n\u0003T then the system of\nequations can be condensed into the single matrix equation\nY = ΛX1 + α1T\nK + E,\n(1)\nwhere α = [0T , sT ]T and Λ = [Id, AT ]T , with Id representing\nthe d-dimensional identity matrix. The columns of E are\nindependent with kth column ǫk ≡[ǫT\n1,k, ǫT\n2,k]T having mean\nzero and known positive deﬁnite covariance matrix\nΩk ≡cov{ǫk} =\n\u0014 Ω1,k\n0\n0\nΩ2,k\n\u0015\n,\n(2)\nwhere cov{v} denotes the covariance matrix of a random\nvector v.\nModels of type (1) are called errors-in-variables models.\nWhen covariance matrices {Ωk, k = 1, ..., K} all equal the\nsame matrix Ω0 > 0 we have a homoscedastic errors-in-\nvariables model. Under the homoscedastic assumption (1)\nis equivalent to the registration formulation of the CRLB\nstudy by [28] and [29]. When the K covariance matrices\n{Ωk, k = 1, ..., K} are in general not equal then we have a het-\neroscedastic errors-in-variables model. It is the heteroscedastic\nassumption that this study focuses on.\nImage registration requires estimating the transformation\nparameters A and s whose elements we can represent in the\ntransformation parameter vector θT = [vec(A)T , sT ]T . In the\nstrict homoscedastic case [30] deﬁnes the generalized least\nsquares (GLS) estimators of A and s and shows them to be\nequivalent to the maximum likelihood (ML) estimators under\nthe assumption of CP measurement errors being Gaussian.\nFurther to this, closed form expressions for the estimators\nof A and s are given along with their joint and marginal\nasymptotic distributions. The work of [31] considers the most\ngeneral heteroscedastic model, where under the assumption\nof Gaussian measurement errors the maximum likelihood\nestimators for A and s are presented along with an iterative\nmethod for their computation and their joint and marginal\nasymptotic distributions. Recently in [18], a heteroscedastic\ngeneralized least squares estimator is deﬁned in an extension\nto the homoscedastic formulation of [30] and is shown to be\nequivalent to the maximum likelihood estimator considered\nin [31]. In the special case where covariance matrices for\nthe measurement errors are of the form Ωk = ηkΩ0, where\nηk ∈R+ and Ω0 > 0 — termed the weighted covariance\nmodel — then [18] gives closed form expressions for the\nestimators of A and s and determines their joint and marginal\nasymptotic distributions. This in turn is used to give concise\nexpressions for the ﬁrst and second moment of the TRE and\nLRE, measures of registration error that we now formally\ndeﬁne.\nA. Registration Errors\nAs has been stated in Section I, the TRE is a commonly\nused measure of registration performance. Here we give its\ndeﬁnition when the registration transformation T is assumed\nafﬁne with matrix parameter A and vector parameter s (see\nFigure 2).\nDeﬁnition II.1. Let A and s be the registration transformation\nparameters and let ˆA and ˆs be their respective estimators. The\ntarget registration error (TRE) τ : I1 →Rd for an arbitrary\npoint x1 ∈I1 with corresponding mapped position in I2 of\nx2 = Ax1 + s is deﬁned as τ(x1) ≡x2 −( ˆAx1 + ˆs) =\nAx1 + s −( ˆAx1 + ˆs).\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n4\nFig. 2: A diagram illustrating the target registration error as\nthe difference between the true position of an arbitrary point\nin I2 (black/upper cross) and its registered position using the\nestimated registration parameters (green/lower cross).\nFig. 3: A diagram illustrating the localization registration\nerror as the difference between the true position of feature\nin I2 (black/upper cross) and its registered position using its\nestimated position in I1 (green/lower cross) and the estimated\nregistration parameters.\nThe LRE is deﬁned in [18] and is of particular use in\nﬂuorescence microscopy registration experiments. Suppose we\nhave a feature (e.g. a single molecule) that is visible in image\n1 but not in image 2 (and therefore is not involved in the\nregistration process). The LRE gives the error with which it\nis localized in image 2 after registration (see Figure 3).\nDeﬁnition II.2. Let A and s be the registration transformation\nparameters and let ˆA and ˆs be their respective estimators.\nFor a feature (e.g. single molecule) in I1 with true and\nmeasured locations x1,F and y1,F = x1,F + ǫ1,F respectively,\nthe localization registration error (LRE) ℓF is deﬁned as the\ndifference between the true position in I2, given by x2,F =\nAx1,F + s, and the registered position ˆx2,F = ˆAy1,F + ˆs, i.e.\nℓF ≡x2,F −ˆx2,F .\nThe standard deviation of an element of ℓF is the accuracy\nwith which a feature/single molecule can be localized in\nthat dimension post-registration. The covariance matrix for\nℓF , denoted Ωℓ, is identical to the covariance matrix for\nthe estimator ˆx2,F and therefore the CRLB for estimating\nx2,F is a lower bound for Ωℓ, i.e. if we denote the CRLB\nmatrix for estimating x2,F as CF F then Ωℓ≥CF F (where\nnotation Ωℓ≥CF F means Ωℓ−CF F ≥0, i.e. Ωℓ−CF F is\nnon-negative deﬁnite). Further discussion on the relationship\nbetween the TRE and LRE can be found in [18].\nIII. CRLB FOR AFFINE TRANSFORMATION PARAMETERS\nThe vector of unknown parameters is given as θT C ≡\n[θT\nT , θT\nC]T , where θT\n≡\n[vec(A)T , sT ]T\nis the R(d2+d)\nvector of afﬁne transformation parameters and\nθC\n≡\n[xT\n1,1, xT\n1,2, ..., xT\n1,K]T is the RdK vector of CP location pa-\nrameters. We make the assumption that measurement errors\nare independent, are zero-mean (validated in [26]) and are\nGaussian (validated in Section VI) with covariance matrix Ωk\nof form (2), i.e. ǫk ∼N2d(0, Ωk). The likelihood function is\ntherefore given as [18],[31]\nL(θT C|y1, ..., yK) =\n1\n(2π)Kd/2\n K\nY\nk=1\n|Ωk|−1/2\n!\n× exp\n \n−1\n2\nK\nX\nk=1\n(yk −µk)T Ω−1\nk (yk −µk)\n!\n,\nwhere µk = [xT\n1,k, xT\n2,k]T , |Ωk| denotes the determinant of\nΩk and y1, ..., yK are the stacked vectors of measured CP\nlocations. The corresponding log-likelihood is\nL(θT C|y1, ..., yK) =\n−Kd\n2 ln(2π)−1\n2\nK\nX\nk=1\nln |Ωk|−1\n2\nK\nX\nk=1\n(yk−µk)T Ω−1\nk (yk−µk).\nIt is well established that for the multivariate normal distri-\nbution with covariance that is independent of parameters the\nFisher information matrix (FIM) for the parameter vector θT C,\ndenoted J(θT C), is given as [32, p. 47]\nJ(θT C) =\nK\nX\nk=1\n∂µT\nk\n∂θT C\nΩ−1\nk\n∂µk\n∂θT\nT C\n,\n(3)\nand the CRLB matrix is given as C(θT C) ≡J−1(θT C). With\nthe CRLB matrix denoted as\nC(θT C) =\n\u0014 CT T\nCT C\nCCT\nCCC\n\u0015\n,\n(4)\nthe diagonals of CT T are the CRLBs for estimating the\ntransformation parameters and the diagonals of CCC are the\nCRLBs for estimating the control point locations. We are\ntherefore primarily interested in the diagonals of CT T . It is\nshown in Appendix A that\nJ(θT C) =\nK\nX\nk=1\n\u0014 HT\nk Ω−1\n2,kHk\nHT\nk Ω−1\n2,kGk\nGT\nk Ω−1\n2,kHk\nF T\nk Ω−1\n1,kFk + GT\nk Ω−1\n2,kGk\n\u0015\n,\nwhere Fk = (e(k)\nK )T ⊗Id, Gk = (e(k)\nK )T ⊗A, Hk =\nh\nId ⊗xT\n1,k, Id\ni\n. Here, e(j)\np\nrepresents the jth standard basis\nvector of Rp, (i.e. vector of length p with 1 placed in the jth\nentry and zeros everywhere else) and ⊗denotes the Kronecker\nproduct. It follows from the block matrix inversion of J(θT C)\nthat\nCT T =\n\u0010\nSHH −SHG (SF F + SGG)−1 ST\nHG\n\u0011−1\n,\n(5)\nwhere SHH = PK\nk=1 HT\nk Ω−1\n2,kHk, SHG = PK\nk=1 HT\nk Ω−1\n2,kGk,\nSF F = PK\nk=1 F T\nk Ω−1\n1,kFk and SGG = PK\nk=1 GT\nk Ω−1\n2,kGk. This\nis the CRLB for the transformation parameters in the most\ngeneral heteroscedastic errors-in-variables model considered\nin [31]. Equations (12), (13) and (14) in Appendix A pro-\nvide expressions for the sums SHH, SHG and SF F + SGG,\nrespectively.\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n5\nIV. FEATURE LOCALIZATION\nLet us now consider including the localization of a feature\n(e.g. single molecule) into the expression. For this we include\nthe term y1,F - the observed location of the feature in I1, and\nthe unknown parameter x2,F - the true position of the feature\nin I2 that we wish to estimate. The associated localization\nerror has covariance matrix Ω1,F . As previously stated in\nSection II-A, the LRE ℓF ∈Rd is the difference between\nthe estimator ˆx2,F = ˆAy1,F + ˆs and the true value x2,F and\nhence the CRLB for estimating x2,F provides a lower bound\nfor Ωℓ, the covariance matrix of ℓF .\nThe combined log-likelihood function for all parameters\nθF T C ≡[θT\nF , θT\nT , θT\nC]T , where θF ≡x2,F , given the observed\ndata is now\nL(θF T C|y1, ..., yK, y1,F ) = −d\n2 ln(2π) −1\n2 ln |Ω1,F |\n−1\n2(y1,F −µ1,F )T Ω−1\n1,F (y1,F −µ1,F ) −Kd\n2 ln(2π)\n−1\n2\nK\nX\nk=1\nln |Ωk| −1\n2\nK\nX\nk=1\n(yk −µk)T Ω−1\nk (yk −µk).\n(6)\nIn terms of the unknown parameter θF ≡x2,F we can write\nµ1,F = A−1(x2,F −s). The FIM for the complete parameter\nvector θF T C is shown in Appendix B to be given as\nJ(θF T C) =\n\n\nA−T Ω−1\n1,F A−1\nDF T\n0\nDT\nF T\nDT T + SHH\nSHG\n0\nST\nHG\nSF F + SGG\n\n,\n(7)\nwhere DT T ≡DT\nT Ω−1\n1,F DT and DF T ≡DT\nF Ω−1\n1,F DT , with\nDF ≡∂µ1,F\n∂θT\nF\n= −A−1,\nDT ≡∂µ1,F\n∂θT\nT\n= −A−1 \u0002\nxT\n1,F ⊗Id, Id\n\u0003\n.\nRepresenting the inverse FIM of θF T C as\nC(θF T C) ≡J−1(θF T C) =\n\n\nCF F\nCF T\nCF C\nCT F\nCT T\nCT C\nCCF\nCCT\nCCC\n\n,\nit is shown in Appendix C that the sub-block\n\u0002 CT T CT C\nCCT CCC\n\u0003\nis\nidentical to C(θT C) in (4) (as one would expect from the\nfact that the feature/single molecule is not involved in the\nregistration process), and the CRLB matrix for estimating\nx2,F , the location of a feature/single molecule in the registered\nimage, is given by\nCF F =\n\u0010\nA−T Ω−1\n1,F A−1 −DF T (DT T + C−1\nT T )−1DT\nF T\n\u0011−1\n,\n(8)\nwhere CT T is the CRLB matrix for estimating the transforma-\ntion parameters given in (5). The d diagonal elements of CF F\nare the CRLBs for estimating the respective elements of x2,F ,\nand with Ωℓ≥CF F offers the lower bounds on the variances\nof the respective elements of the LRE ℓF .\nV. CRLB EXPRESSIONS FOR WEIGHTED COVARIANCE\nMODEL\nSection IV provides the CRLB for localizing a feature/single\nmolecule in the most general heteroscedastic registration\nmodel. While these results provide a very general solution\nto our problem, we will now investigate special cases that\nare of interest in their own right through their relevance\nin applications. In addition, in these special cases we can\nobtain signiﬁcant simpliﬁcations of the above expressions that\nprovide useful insights for experimental design considerations.\nIn this section we look to the weighted covariance model\nformulated in [18], in which we make the assumption that\ncovariance matrices for the measurement errors are of the form\nΩk = ηkΩ0 where ηk ∈R+ and Ω0 > 0, for all k = 1, ..., K.\nHere, we consider the following further assumption.\nAssumption I. Covariance matrices have the forms: Ω1,0 =\nσ2\n1,0I2, Ω2,0 = σ2\n2,0I2, Ω1,F\n= σ2\n1,F I2, and transforma-\ntion matrix A = ςR, where R is a unitary matrix (rota-\ntion/reﬂection) and ς ∈R+ is a scaling factor.\nThe transformation vector s is arbitrary. The assumption here\nthat the covariance matrices are some scalar multiple of the\nidentity matrix is a reasonable assumption in ﬂuorescence mi-\ncroscopy and exact in the case of a non-pixelated detector [24].\nThe assumption on the transformation matrix is a common\ntype of transform experienced in registration.\nA. CRLB for estimating transformation parameters\nLet us deﬁne the following quantities that will be used here:\nγ ≡(1/K) PK\nk=1 η−1\nk , χk ≡x1,kxT\n1,k (k = 1, ..., K), Ξ ≡\n(1/K) PK\nk=1 η−1\nk χk, Xi,k ≡e(i)\n2\n⊗xT\n1,k (i = 1, 2 and k =\n1, ..., K), ¯x1 ≡(1/K) PK\nk=1 η−1\nk x1,k, ¯Xi ≡e(i)\n2\n⊗¯xT\n1 (i =\n1, 2), Ψ ≡Ξ −γ−1¯x1¯xT\n1 and Γi ≡γ−1 ¯XiΨ (i = 1, 2).\nUnder Assumption I it is shown in Appendix D that the\nexpression for CT T in (5) simpliﬁes to\nCT T = 1\nK\n\u0000ς2σ2\n1,0 + σ2\n2,0\n\u0001\n×\n\n\nΨ−1\n0\n−ΓT\n1\n0\nΨ−1\n−ΓT\n2\n−Γ1\n−Γ2\nγ−1I2 + γ−1 \u0000Γ1 ¯XT\n1 + Γ2 ¯XT\n2\n\u0001\n\n.\n(9)\nB. CRLB for estimating the location of a feature/single\nmolecule in the registered image\n1) General model: Under Assumption I it is shown in\nAppendix E that the CRLB matrix for estimating the location\nx2,F of a feature/single molecule is given as\nCF F =\n \n1\nς2σ2\n1,F\nI2−\n1\nς4σ4\n1,F\n\u0002\nxT\n1F , 1\n\u0003\n⊗I2\n \n1\nς2σ2\n1,F\n\u0014 x1,F xT\n1,F\nx1,F\nxT\n1,F\n1\n\u0015\n⊗I2\n+\n\u0000ς2σ2\n1,0 + σ2\n2,0\n\u0001−1\nK\nX\nk=1\nη−1\nk\n\n\nχk\n0\nXT\n1,k\n0\nχk\nXT\n2,k\nX1,k\nX2,k\nI2\n\n\n\n\n−1\n×\n\u0002\nxT\n1F , 1\n\u0003T ⊗I2\n\u0011−1\n.\n(10)\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n6\n2) Simpliﬁed model: Let us consider the case where ηk is\nindependent of CP position and CPs are centrally and symmet-\nrically distributed in the image space. This model leads to the\nfollowing set of assumptions that are appropriate for large K\nand asymptotically exact. These assumptions naturally arise,\nfor example, when considering the experimental disposition of\nﬂuorescent beads in a speciﬁc microscopy experiment setting,\nwhere the beads can be assumed to have a circular Gaussian\nspatial distribution [18].\nAssumption II. Approximate (1/K) PK\nk=1 η−1\nk χk = ν2I2 and\n(1/K) PK\nk=1 η−1\nk Xj,k = 0.\nUnder Assumption I and II it is shown in Appendix F that\nthe CRLB matrix for estimating the feature/single molecule\nlocation x2,F is given as\nCF F = ς2σ2\n1,F I2 +\n1\nKγ\n\u0000ς2σ2\n1,0 + σ2\n2,0\n\u0001 \u0012\n1 + γr2\nν2\n\u0013\nI2.\n3) Applying to a microscopy setting: Consider a ﬂuores-\ncence microscopy example were Assumptions I and II are\nsatisﬁed. That is, we have the weighted covariance model with\nηk = N −1\n1,k, where N1,k is the number of photons associated\nwith control point k in I1, k = 1, ..., K, and Ωj,0 = σ2\nj,0I2\nwhere σ2\n1,0 = ζ1 and σ2\n2,0 = ζ2/c [33]. Constant ζj, j = 1, 2,\nis a known localization accuracy parameter associated with Ij\nand is a function of the numerical aperture, photon wavelength\nand point spread function (see [18, p. 6296]). Constant c is\nthe constant of proportionality assumed in [18] to exist such\nthat N2,k = cN1,k where N2,k are the number of photons\nassociated with the kth CP in I2. This gives\nΩk =\n1\nN1,k\n\u0012 ζ1I2\n0\n0\nc−1ζ2I2\n\u0013\n.\nIn this situation we have γ =\n¯N1 where ¯N1 is the mean\nphoton count for the CPs in I1. Therefore the CRLB matrix\nfor estimating x2,F , the location of the single molecule in I2,\nis given as\nCF F = ς2σ2\n1,F I2 + 1\nK\n\u0012\nς2 ζ1\n¯N1\n+ ζ2\n¯N2\n\u0013 \u0012\n1 +\n¯N1r2\nν2\n\u0013\nI2.\nPhoton counts are independent of CP position and there-\nfore under the (asymptotically exact [18]) assumption that\nν2 = ¯N1κ2, where (1/K) PK\nk=1 χk = κ2I2 (a measure of\nthe spread of the CPs), then\nΩℓ≥CF F = ς2σ2\n1,F I2 + 1\nK\n\u0012\nς2 ζ1\n¯N1\n+ ζ2\n¯N2\n\u0013 \u0012\n1 + r2\nκ2\n\u0013\nI2.\n(11)\nThis expression for the CRLB in estimating x2,F , and hence\nthe lower bound for Ωℓ, exactly matches the large K ex-\npression for Ωℓfound in [18, p. 6297] when the generalized\nleast squares estimator for the weighted covariance model is\nused. The fundamental limit (i.e. the theoretical lower bound)\nof localization accuracy for a single molecule in a pair of\nregistered images is therefore bound by a term that depends\non K (the number of CPs used in the registration process)\nand their associated photon counts, along with κ2 that gives a\nmeasure of the spread of the CPs in the image. We note there\nis no dependence on the translation parameter s.\nVI. SIMULATIONS AND EXPERIMENTAL VERIFICATION\nIn this section we verify the CRLB results given in this\npaper with computational simulations and a real data experi-\nment.\nA. Simulation Studies\nIn these computational simulation studies we consider a\nmicroscopy experiment where we register a pair of different\ncoloured monochromatic images each captured using an op-\ntical system with identical numerical aperture and point-spread\nfunction. The measurement error in localizing the kth CP in\njth image Ij (j = 1, 2) has zero mean and covariance matrix\n(ζj/Nj,k)I2 where ζj = λ2\nj,em/(4π2n2\nF ) [24]. The photon\nwavelength λj,em associated with each image is 540nm and\n650nm respectively, nF is the numerical aperture and assigned\na typical value of 1.4 and Nj,k is the photon count associated\nwith the kth control point in the jth image.\n1) Rotation: CPs are arranged in a square grid of side\nlength 81µm in the object space with varying numbers of\npoints within that grid, and therefore K is restricted to\nthe square numbers from 4 to 64. The photon counts as-\nsociated with each control point are observed realisations\nof a uniformly distributed random integer on the inter-\nval [5000,10000]. In I1 is a single molecule at position\n(16µm,20µm) from the center, with which a photon count of\n1000 is associated. Afﬁne transformation matrix A is a rotation\nmatrix of angle 30 degrees and afﬁne transformation vector s\nis [4.8µm,4.8µm]T.\nWe look to verify the CRLB for estimating the trans-\nformation parameters as given in (9) and the CRLB for\nestimating the position of the single molecule in the registered\nimage (equivalently the lower bound of Ωℓ) in (11). This is\nachieved by estimating the transformation parameters using the\ngeneralized least squares estimator for the weighted covariance\nmodel as developed in [18]. The empirical standard deviations\nof interest are computed using 106 simulations and shown in\nFigure 4.\n2) Shear: CPs are arranged in a square grid of side length\n81µm in the object space with K = 9. The photon counts\nassociated with each control point are observed realisations\nof a uniformly distributed random integer on the interval\n[5000,10000] and covariance matrices for the measurement\nerrors are of the same form as in Section VI-A1. In I1 is\na single molecule at position (16µm,20µm) from the center,\nwith which a photon count of 1000 is associated. Afﬁne\ntransformation matrix A is a shear matrix of type A = ( 1 λ\n0 1 )\nwhere shear parameter λ is varied between values of 0.1 and\n0.9. Transformation vector s is [4.8µm,4.8µm]T.\nWe look to verify the CRLB for estimating the trans-\nformation parameters as given in (9) and the CRLB for\nestimating the position of the single molecule in the registered\nimage (equivalently the lower bound of Ωℓ) in (11). This is\nachieved by estimating the transformation parameters using the\ngeneralized least squares estimator for the weighted covariance\nmodel as developed in [18]. The empirical standard deviations\nof interest are computed using 106 simulations and shown in\nFigure 5.\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n7\n4 9 16 25\n36\n49\n64\n1.85\n1.9\n1.95\n2\nLocalization Accuracy (nm)\n(a) x2,F\n4 9 16 25\n36\n49\n64\n5\n10\n15\nStandard Deviation\nNumber of Control Points − K\n(c) a11\n4 9 16 25\n36\n49\n64\n0\n0.2\n0.4\n0.6\n0.8\nStandard Deviation (nm)\n(b) s1\n4 9 16 25\n36\n49\n64\n5\n10\n15\nStandard Deviation\nNumber of Control Points − K\n(d) a21\nFig. 4: The line indicates the square root of the CRLB and\nthe crosses mark the sample standard deviation plotted as a\nfunction of the number of CPs K for the following estimated\nparameters: (a) the ﬁrst dimension of the unknown single\nmolecule position parameter x2,F , (b) s1, the ﬁrst element\nof transformation vector s, (c) a11, the leading element of\ntransformation matrix A, (d) a21, the (2, 1)th element of A.\nIn this simulation study CPs are in a grid conﬁguration and\nthe transformation consists of a rotation and translation (see\nSection VI-A1 for more details). The vertical axes in (a) and\n(b) have units as nanometers, the vertical axes in (c) and (d)\nare unitless and are on the scale ×10−5. Results are based on\na sample of 106 simulations.\n3) Asymptotic covariance versus CRLB: It has been men-\ntioned in Section V-B3 that under Assumption I and II the\nlower bound for Ωℓin (11) matches the large K covari-\nance matrix of the LRE given in [18] when transformation\nparameters are estimated using the generalized least squares\nestimator. We now consider relaxing Assumption I such that\nΩ0 is no longer the identity matrix and look at how the CRLB\nfor estimating x2,F compares with the more general large K\ncovariance matrix expression in [18, p. 6295].\nWe have exactly the same experimental set-up as in Section\nVI-A1 except the measurement error in localizing the kth\nCP in jth image Ij (j = 1, 2) now has covariance matrix\n(ζj/Nj,k)S where S = ( 1\n0.5\n0.5\n1 ) . The CRLB for estimating\nthe single molecule location x2,F is calculated using the more\ngeneral expression (8). In Figure 6 the square root of its\nleading diagonal is compared to the large K standard deviation\nfor the ﬁrst dimension of the LRE given in [18, p. 6295] when\nregistration is performed using the generalized least squares\nestimator. It is clear to see that the two expressions take very\nsimilar values, particularly for large values of K, and hence the\nclose association between the CRLB expressions derived here\nand the large K results of [18] can be extended to the more\n0\n0.2\n0.4\n0.6\n0.8\n1.8\n2\n2.2\n2.4\nLocalization Accuracy (nm)\n(a) x2,F\n0\n0.2\n0.4\n0.6\n0.8\n0.95\n1\n1.05\n1.1\n1.15\nStandard Deviation\nShear Parameter λ\n(c) a11\n0\n0.2\n0.4\n0.6\n0.8\n0.32\n0.34\n0.36\n0.38\nStandard Deviation (nm)\n(b) s1\n0\n0.2\n0.4\n0.6\n0.8\n0.95\n1\n1.05\n1.1\n1.15\nStandard Deviation\nShear Parameter λ\n(d) a21\nFig. 5: The line indicates the square root of the CRLB and\nthe crosses mark the sample standard deviation plotted as a\nfunction of shear parameter λ for the following estimated\nparameters: (a) the ﬁrst dimension of the unknown single\nmolecule position parameter x2,F , (b) s1, the ﬁrst element\nof transformation vector s, (c) a11, the leading element of\ntransformation matrix A, (d) a21, the (2, 1)th element of A. In\nthis simulation study there are nine CPs in a grid conﬁguration\n(see Section VI-A2 for more details). The vertical axes in (a)\nand (b) have units as nanometers, the vertical axes in (c) and\n(d) are unitless and are on the scale ×10−4. Results are based\non a sample of 106 simulations.\ngeneral weighted covariance model. This result is general and\nnot speciﬁc to the microscopy setting.\n4) Low SNR: To demonstrate that the CRLB is an ap-\npropriate bound for low signal strengths we consider the\nsame simulation study as in Section VI-A1 but where the\nphoton count associated with each control point is a uniformly\ndistributed random variable on the interval [200, 700] and 300\nphotons are collected for the single molecule. Figure 7 shows\nthe CRLB is still appropriate in this setting.\n5) Estimating the CRLB: For the simulations studies pre-\nsented thus far the theoretical values of the CRLB have been\npossible to calculate due to artiﬁcial knowledge of the true\nparameter values that form the parameter vector θF T C. As\nthis is the very thing that needs estimating the theoretical\nvalues of the CRLB is obviously unavailable to experimenters\nand therefore it becomes important to know how well we can\nestimate the CRLB given the estimated parameter values.\nWe consider the same simulation set-up of Section VI-A2\nand now estimate the CRLB from (11) using estimated values\nˆA, ˆs, y1,F and {y1,1, ..., y1,K}, instead of true values A, s,\nx2,F and {x1,1, ..., x1,K}, respectively. In Figure 8 we plot\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n8\n4\n9\n16\n25\n36\n49\n64\n1.87\n1.88\n1.89\n1.9\n1.91\n1.92\n1.93\n1.94\nlocalization accuracy (nm)\nnumber of control points − K\nFig. 6: The line indicates the square root of the CRLB for\nthe ﬁrst dimension of the unknown single molecule position\nparameter x2,F (and hence a lower bound for the standard\ndeviation of the LRE) in object space dimensions, plotted\nas a function of the number of CPs. CPs are in a grid\nconﬁguration (see Section VI for more details). The crosses\nare the theoretical standard deviation of the LRE assuming the\nlarge K distribution given in [18].\n4 9 16 25\n36\n49\n64\n3.4\n3.6\n3.8\n4\n4.2\n4.4\n4.6\n4.8\n5\nLocalization Accuracy (nm)\nNumber of Control Points − K\n(a) x2,F\n4 9 16 25\n36\n49\n64\n1.5\n2\n2.5\n3\n3.5\n4\n4.5\n5\n5.5\n6\n6.5\nStandard Deviation\nNumber of Control Points − K\n(b) a11\nFig. 7: Low SNR example (see Section VI-A4 for more\ndetails). The line indicates the square root of the CRLB and\nthe crosses mark the sample standard deviation plotted as a\nfunction of the number of CPs K for the following estimated\nparameters: (a) the ﬁrst dimension of the unknown single\nmolecule position parameter x2,F , (b) a11, the leading element\nof transformation matrix A. In this simulation study CPs are\nin a grid conﬁguration and the transformation consists of a\nrotation and translation. The vertical axis in (a) has units as\nnanometers, the vertical axis in (b) is unitless and on the scale\n×10−4. Results are based on a sample of 106 simulations.\nthe theoretical value of the CRLB for estimating x2,F , together\nwith the maximum and minimum value of the estimated CRLB\nover 106 simulations, clearly demonstrating that estimated\nparameter values can be used by experimenters to get an\nexcellent estimate of the CRLB.\nB. Experimental veriﬁcation\nHere we describe the experimental set up used to verify\nthe theoretical results of this paper. A bead sample was\nprepared by adsorbing a dilute solution of 100-nm Tetraspeck\nmicrospheres (Thermo Fisher, Waltham, MA, USA) on Poly-\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n1.9\n2\n2.1\n2.2\n2.3\n2.4\n2.5\nLocalization Accuracy (nm)\nShear Parameter λ\n0.5\n2.12\n2.121\n2.122\n2.123\n2.124\n2.125\n2.126\n2.127\n2.128\n2.129\nLocalization Accuracy (nm)\nShear Parameter λ\nFig. 8: Left — the line indicates the square root of the true\nCRLB for the ﬁrst dimension of the unknown single molecule\nposition parameter x2,F (the leading diagonal in (11)) in object\nspace dimensions, plotted as a function of shear parameter λ.\nThe ‘×’ marks the minimum value of the estimated CRLB\nand the ‘+’ marks the maximum value of the estimated CRLB\ntaken over 106 simulations. Right — a magniﬁcation of the\nleft plot for a single value of shear parameter.\nL-Lysine (Sigma-Aldrich, St. Louis, MO, USA) coated glass\ncoverslip (Zeiss, Thornwood, NY, USA). A standard inverted\nmicroscope (Zeiss Axiovert 200) was conﬁgured with a\n63×1.46 numerical aperture Zeiss Plan Apochromat objective\nlens. The beads were excited by a 488nm diode laser (Toptica,\nVictor, NY, USA) and a 635nm diode laser (OptoEngine, Mid-\nvale, UT, USA). The emission light from the beads was split\ninto two wavelength ranges, 502.5nm-537.5nm and 657.5nm-\n694.5nm, using a dichroic ﬁlter set (FF560-Di01-25x36; FF01-\n520/35-25; FF01-676/37-25; Semrock, Rochester, NY, USA),\nand imaged using two identical charge-coupled device (CCD)\ncameras (iXon DU897-BV; Andor, South Windsor, CT, USA).\nThe imaging experiments were carried out by illuminating\nthe beads with two lasers in 100ms pulse width over 599 repeat\nacquisitions. To estimate the coordinates of the beads acquired\nfrom each camera, we ﬁrst selected region of interests (ROIs)\ncontaining a bead and ﬁtted a Gaussian model using maximum\nlikelihood estimation. All computations were performed using\ncustom written software in MATLAB (MathWorks, Natick,\nMA, USA).\nAcquisitions 300-599 (a total of 300) were used in our\nanalysis as they showed the greatest stability in photon counts\nbetween acquisitions and hence localization errors are consid-\nered approximately iid. An example pair of images from each\ncamera that need to be registered are shown in Figure 9.\n1) Veriﬁcation of Gaussian distributed measurement er-\nrors: Throughout this paper localization errors have been\nassumed Gaussian in order to form the likelihood function\nfrom which the CRLBs are derived. Here, we verify this\nassumption by analysing the empirical localization estimates\nfor the beads. Figure 10 shows quantile-quantile (QQ) plots\nfor the distribution of the localization estimates. The curve\nis produced by ordering the 300 independent estimates for\neither the x or y localization coordinate into increasing order\nof size. The probability of a value less than the jth ordered\nestimate (sample quantile) is approximately pj = j/301.\nThe corresponding theoretical quantile of the standard normal\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n9\n−4\n−2\n0\n2\n4\n14.21\n14.22\n14.23\n14.24\n14.25\nQuantiles of Input Sample\nCamera 1 x−direction\n−4\n−2\n0\n2\n4\n8.75\n8.76\n8.77\n8.78\n8.79\n8.8\nStandard Normal Quantiles\nQuantiles of Input Sample\n−4\n−2\n0\n2\n4\n4.13\n4.14\n4.15\n4.16\n4.17\n4.18\nCamera 1 y−direction\n−4\n−2\n0\n2\n4\n6.36\n6.37\n6.38\n6.39\n6.4\n6.41\n6.42\nStandard Normal Quantiles\n−4\n−2\n0\n2\n4\n14.05\n14.06\n14.07\n14.08\n14.09\nCamera 2 x−direction\n−4\n−2\n0\n2\n4\n8.73\n8.74\n8.75\n8.76\n8.77\nStandard Normal Quantiles\n−4\n−2\n0\n2\n4\n4.21\n4.22\n4.23\n4.24\n4.25\n4.26\nCamera 2 y−direction\n−4\n−2\n0\n2\n4\n6.73\n6.74\n6.75\n6.76\n6.77\n6.78\nStandard Normal Quantiles\nFig. 10: QQ-plots (see Section IV-B1 for details) for the x and y coordinates of the localization estimates in both cameras.\nEach row of plots corresponds to one of two beads analysed.\nFig. 9: Example (acquisition 599) of the pair of images of\nthe bead sample to be registered, taken with the two separate\ncameras as described in Section VI-B.\ndistribution is the value tj such that pj = F(tj), where F(·)\nis the cumulative density function of the standard normal\ndistribution. The values t1, ..., t300 are plotted on the horizontal\naxis against the ordered estimates on the vertical axes. This\nis done for x and y coordinates in both cameras for two\nseparate beads (one row of QQ plots for each bead). The\nstraight line indicates the ideal ﬁt for Gaussian samples. It\nis clear the localization estimates are Gaussian distributed to a\nclose approximation, except for some minor deviations at the\ndistribution tails.\n2) Registration performance: Fourteen of the ﬂuorescent\nbeads that were present in the ﬁeld of view for all acquisi-\ntions and able to be pair-matched were considered for image\nregistration. One of the beads was isolated as a feature and reg-\nistration performed using the weighted covariance generalized\nleast squares estimators for A and s [18] with 8,9,10,11,12 and\n13 of the remaining beads. Calculating the sample variance of\nthe LRE in the x-direction across the 300 acquisitions, we\ncompare it to the CRLB as given in (8) estimated using the\ntransformation parameter estimates (example values of these\nare ˆA = [ 0.997 0.054\n0.055 0.996 ] and ˆs = [1.000, 1.000]T (each to 3\nd.p.)). Figure 11 displays the results. The four plots correspond\nto four random permutations of the beads we register with.\nIt is clear that in this experiment the CRLB, to a close\napproximation, is attained.\nVII. CONCLUDING REMARKS\nWe have derived the CRLB for image registration per-\nformance under the heteroscedastic multivariate errors-in-\nvariables model. Particular focus has been given to the case\nwhere the covariance matrices for the errors in localizing the\nCPs are all scalar multiples of a common positive deﬁnite\nmatrix, a suitable model for ﬂuorescence microscopy. Un-\nder this model the CRLB for estimating the location of a\nfeature/single molecule has been found and is equal to the\nlower bound of the covariance matrix of the LRE, the error in\nlocalizing a feature/single molecule in the registered image. In\nthe simpliﬁed case of that common matrix being the identity\nand the afﬁne transformation between the pair of images being\na scaled version of a unitary matrix, it has been shown that\nthe lower bound for the covariance matrix of the LRE exactly\nmatches the previously published large K expression when\ntransformation parameters are estimated with the weighted\ncovariance generalized least squares estimators. Therefore (11)\ncan now be considered to be the lower bound for the accuracy\nwith which we can localize a single molecule in a registered\nimage. Beyond this, it could also be used in future to develop\nstrategies for the placement of the control points so that the\nestimation errors can be reduced.\nSimulations comparing the sample standard deviation of the\ntransformation parameters and an element of the LRE with\ntheir respective theoretical lower bounds conﬁrm that using\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n10\n8\n9\n10\n11\n12\n13\n0\n2\n4\n6\n8\n10\nLocalization Accuracy (nm)\n8\n9\n10\n11\n12\n13\n0\n2\n4\n6\n8\n10\n8\n9\n10\n11\n12\n13\n0\n2\n4\n6\n8\n10\nNumber of Control Points (K)\n8\n9\n10\n11\n12\n13\n0\n2\n4\n6\n8\n10\nLocalization Accuracy (nm)\nNumber of Control Points (K)\nFig. 11: Experimental data results. The crosses indicate the\nsquare root of the sample variance of the ﬁrst dimension\nof the LRE. The dots are the bootstrapped 95% conﬁdence\ninterval. The circles indicate the square root of the CRLB in\nthe ﬁrst dimension as calculated from (8) using the estimated\ntransformation parameters.\nthe weighted covariance generalized least squares estimators\nfor the afﬁne parameters appears to be efﬁcient even for low\nnumbers of control points. Experimental data validates the\ntheory presented.\nAPPENDIX A\nHere we derive the FIM for the parameter vector θT C under\nthe most general heteroscedastic model. We note that under the\nafﬁne transformation assumed then µk ∈R2d, the mean vector\nfor the measured kth CP locations yk = [yT\n1,k, yT\n2,k]T is given\nas\nµk =\n\u0014\nx1,k\nAx1,k + s\n\u0015\n.\nTherefore we have\n∂µk\n∂θT\nT C\n=\n\u0014\n0\nFk\nHk\nGk\n\u0015\n,\nwhere Fk = (e(k)\nK )T ⊗Id, Gk\n= (e(k)\nK )T ⊗A, Hk =\nh\nId ⊗xT\n1,k, Id\ni\n. From (3) we have\nJ(θT C) =\nK\nX\nk=1\n\u0014\n0\nHT\nk\nF T\nk\nGT\nk\n\u0015 \u0014 Ω−1\n1,k\n0\n0\nΩ−1\n2,k\n\u0015 \u0014\n0\nFk\nHk\nGk\n\u0015\n=\nK\nX\nk=1\n\u0014 HT\nk Ω−1\n2,kHk\nHT\nk Ω−1\n2,kGk\nGT\nk Ω−1\n2,kHk\nF T\nk Ω−1\n1,kFk + GT\nk Ω−1\n2,kGk\n\u0015\n.\n≡\n\u0014 SHH\nSHG\nST\nHG\nSF F + SGG\n\u0015\n,\nwhere SHH = PK\nk=1 HT\nk Ω−1\n2,kHk, SHG = PK\nk=1 HT\nk Ω−1\n2,kGk,\nSF F\n= PK\nk=1 F T\nk Ω−1\n1,kFk and SGG = PK\nk=1 GT\nk Ω−1\n2,kGk.\nDealing with each term individually, we can write\nSHH =\nK\nX\nk=1\n\n\nXT\n1,kΩ−1\n2,kX1,k\n· · ·\nXT\n1,kΩ−1\n2,kXd,k\nXT\n1,kΩ−1\n2,k\n...\n...\n...\nXT\nd,kΩ−1\n2,kX1,k\n· · ·\nXT\nd,kΩ−1\n2,kXd,k\nXT\nd,kΩ−1\n2,k\nΩ−1\n2,kX1,k\n· · ·\nΩ−1\n2,kXd,k\nΩ−1\n2,k\n\n,\n(12)\nSHG =\n\n\nXT\n1,1Ω−1\n2,1AT\nXT\n1,2Ω−1\n2,2AT\n· · ·\nXT\n1,KΩ−1\n2,KAT\n...\n...\n...\nXT\nd,1Ω−1\n2,1AT\nXT\nd,2Ω−1\n2,2AT\n· · ·\nXT\nd,KΩ−1\n2,KAT\nΩ−1\n2,1AT\nΩ−1\n2,2AT\n· · ·\nΩ−1\n2,KAT\n\n,\n(13)\nSF F + SGG =\n\n\nΛT Ω−1\n1 Λ\n0\n· · ·\n0\n0\nΛT Ω−1\n2 Λ\n· · ·\n0\n...\n...\n...\n...\n0\n0\n· · ·\nΛT Ω−1\nK Λ\n\n,\n(14)\nwhere Λ = [Id, AT ]T and Xi,k = e(i)\nd ⊗xT\n1,k, i = 1, ..., d and\nk = 1, ..., K.\nAPPENDIX B\nHere we derive the FIM for the parameter vector θF T C\nunder the most general heteroscedastic model. The FIM is\ndeﬁned as\nJ(θF T C) ≡E\n\u001a∂L(θF T C, x2,F |y1, ..., yK, y1,F)\n∂θF T C\n×∂L(θF T C, x2,F |y1, ..., yK, y1,F )\n∂θT\nF T C\n\u001b\n.\nGiven (6) this can be expressed as\nJ(θF T C) =\n\u0014 0\n0\n0\nJ(θT C)\n\u0015\n+ JF (θF T C),\n(15)\nwhere J(θT C) is as given in (3) and\nJF (θF T C) =\nK\nX\nk=1\n∂µT\n1,F\n∂θF T C\nΩ−1\n1,F\n∂µ1,F\n∂θT\nF T C\n.\nThe zeros in the right-hand-side of (15) are a consequence of\nthe control point localizations being independent of the feature\nlocation. We have the following identities\n∂µ1,F\n∂aij\n= −A−1P (ij)A−1(x2,F −s) = −A−1P (ij)x1,F ,\n∂µ1,F\n∂s\n= −A−1,\n∂µ1,F\n∂x1,k\n= 0,\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n11\nwhere P (ij) is a d × d matrix of zeros except for a 1 placed\nin the (i, j)th element. It follows from these identities that\nDF ≡∂µ1,F\n∂θT\nF\n= −A−1,\nDT ≡∂µ1,F\n∂θT\nT\n= −A−1 \u0002\nxT\n1,F ⊗Id, Id\n\u0003\n.\nDeﬁne DT T ≡DT\nT Ω−1\n1,F DT and DF T ≡DT\nF Ω−1\n1,F DT and\nDT F ≡DT\nT Ω−1\n1,F DF = DT\nF T . It follows that\nJF (θF T C) = ∂µT\n1,F\n∂θF T C\nΩ−1\n1,F\n∂µ1,F\n∂θT\nF T C\n=\n\n\nA−T Ω−1\n1,F A−1\nDF T\n0\nDT\nF T\nDT T\n0\n0\n0\n0\n\n.\nThe zeros in the ﬁnal row and column can be interpreted as\narising because estimating the feature location in I1 occurs\nbefore registration and therefore has no dependence on the\nCP locations. The expression in (7) follows from (15).\nAPPENDIX C\nWe consider the CRLB block matrix\nC(θF T C) ≡J−1(θF T C) =\n\n\nCF F\nCF T\nCF C\nCT F\nBT T\nBT C\nCCF\nBCT\nBCC\n\n\nwhere we initially use the notations BT T , BT C, BCT and\nBCC to distinguish these from the matrices CT T , CT C, CCT\nand CCC considered in (4) and (5).\nWe note that\n\u0014 BT T\nBT C\nBCT\nBCC\n\u0015\n=\n\u0012\u0014 DT T + SHH\nSHG\nST\nHG\nSF F + SGG\n\u0015\n−\n\u0014 DT\nF T\n0\n\u0015\nAΩ1,F AT [DF T , 0]\n\u0013−1\n=\n\u0012\u0014\nDT T + SHH\nSHG\nST\nHG\nSF F + SGG\n\u0015\n−\n\u0014\nDT\nF T AΩ1,F AT DF T\n0\n0\n0\n\u0015\u0013−1\n.\nIt is straightforward to show that DT\nF T AΩ1,F AT DF T = DT T\nand hence\n\u0014\nBT T\nBT C\nBCT\nBCC\n\u0015\n=\n\u0014\nSHH\nSHG\nST\nHG\nSF F + SGG\n\u0015−1\n=\n\u0014 CT T\nCT C\nCCT\nCCC\n\u0015\nrecovering the inverse FIM from Section III in which only the\ntransformation parameters and CP locations are considered,\nan expected result stemming from the fact that the feature has\nno involvement in estimating either the parameters and CP\nlocations.\nWe are interested in the term CF F whose diagonals are the\nCRLB for the localization of the feature/molecule in image\nI2. It follows that\nCF F =\n\u0010\nA−T Ω−1\n1,F A−1\n−[DF T, 0]\n\u0014 DT T + SHH\nSHG\nST\nHG\nSF F + SGG\n\u0015−1 \u0014\nDT\nF T\n0\n\u0015!−1\n=\n\u0010\nA−T Ω−1\n1,F A−1 −DF T M11DT\nF T\n\u0011−1\nwhere\n\u0014\nM11\nM12\nM21\nM22\n\u0015\n=\n\u0014\nDT T + SHH\nSHG\nST\nHG\nSF F + SGG\n\u0015−1\n.\nWe therefore recognise that we can write CF F as in (8).\nAPPENDIX D\nHere we derive CT T , the CRLB matrix for estimating the\ntransformation parameters, under Assumption I. Consider each\nterm in (5) with Ω1,0 = σ2\n1,0I2, Ω2,0 = σ2\n2,0I2 and A = ςR,\nwhere R is a unitary matrix (rotation/reﬂection) and ς ∈R+\nis a scaling factor. Then from (12), (13) and (14) we have\nSHH =\nK\nX\nk=1\n1\nσ2\n2,k\n\n\nχk\n0\nXT\n1,k\n0\nχk\nXT\n2,k\nX1,k\nX2,k\nI2\n\n,\nwhere χk = x1,kxT\n1,k,\nSHG =\n\n\nσ−2\n2,1XT\n1,1AT\nσ−2\n2,2XT\n1,2AT\n· · ·\nσ−2\n2,KXT\n1,KAT\nσ−2\n2,1XT\n2,1AT\nσ−2\n2,2XT\n2,2AT\n· · ·\nσ−2\n2,KXT\n2,KAT\nσ−1\n2,1AT\nσ−2\n2,2AT\n· · ·\nσ−2\n2,KAT\n\n\nand\nSF F + SGG =\n\n\n(σ−2\n1,1 + ς2σ−2\n2,1)\n· · ·\n0\n...\n...\n...\n0\n· · ·\n(σ−2\n1,K + ς2σ−2\n2,K)\n\n⊗I2.\nThis gives\nSHG (SF F + SGG)−1 ST\nHG\n=\nK\nX\nk=1\nς2\nσ4\n2,k(σ−2\n1,k + ς2σ−2\n2,k)\n\n\nχk\n0\nXT\n1,k\n0\nχk\nXT\n2,k\nX1,k\nX2,k\nI2\n\n\nand therefore\nSHH −SHG (SF F + SGG)−1 ST\nHG\nequals\nK\nX\nk=1\n \nσ−2\n2,k −\nς2\nσ4\n2,k(σ−2\n1,k + ς2σ−2\n2,k)\n! \n\nχk\n0\nXT\n1,k\n0\nχk\nXT\n2,k\nX1,k\nX2,k\nI2\n\n\n=\n\u0000ς2σ2\n1,0 + σ2\n2,0\n\u0001−1\nK\nX\nk=1\nη−1\nk\n\n\nχk\n0\nXT\n1,k\n0\nχk\nXT\n2,k\nX1,k\nX2,k\nI2\n\n\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n12\nand\nCT T =\n\u0010\nSHH −SHG (SF F + SGG)−1 ST\nHG\n\u0011−1\nbecomes\nCT T =\n\u0000ς2σ2\n1,0 + σ2\n2,0\n\u0001\n×\n\n\nΨ−1\n0\n−ΓT\n1\n0\nΨ−1\n−ΓT\n2\n−Γ1\n−Γ2\nγ−1I2 + γ−1 \u0000Γ1 ¯XT\n1 + Γ2 ¯XT\n2\n\u0001\n\n,\nwhere γ ≡(1/K) PK\nk=1 η−1\nk , Ψ ≡Ξ −γ−1¯x1¯xT\n1 where Ξ ≡\n(1/K) PK\nk=1 η−1\nk x1,kxT\n1,k and ¯x1 ≡(1/K) PK\nk=1 η−1\nk x1,k,\nand Γi ≡γ−1 ¯XiΨ where ¯Xi ≡PK\nk=1 η−1\nk Xi,k = e(i)\n2 ⊗¯xT\n1 ,\ni = 1, 2.\nAPPENDIX E\nHere we consider CF F , the CRLB for estimating the\nlocation of the feature/single molecule in the registered image,\nunder Assumption I. Appendix D shows that\nC−1\nT T =\n\u0000ς2σ2\n1,0 + σ2\n2,0\n\u0001−1\nK\nX\nk=1\nη−1\nk\n\n\nχk\n0\nXT\n1,k\n0\nχk\nXT\n2,k\nX1,k\nX2,k\nI2\n\n,\nunder the weighted covariance model and with Ω1,0 = σ2\n1,0I2,\nΩ2,0 = σ2\n2,0I2, Ω1,F = σ2\n1,F I2 and A = ςR where R is a\nunitary matrix (rotation/reﬂection) and ς ∈R+ is a scaling\nfactor, it follows that\nDT T =\n1\nς2σ2\n1,F\n\u0014 x1,F xT\n1,F\nx1,F\nxT\n1,F\n1\n\u0015\n⊗I2,\nDF T =\n1\nς2σ2\n1,F\n\u0002\nxT\n1F , 1\n\u0003\n⊗I2.\nTherefore the result follows from (8).\nAPPENDIX F\nHere we derive CF F under Assumptions I and II. With\n(1/K) PK\nk=1 η−1\nk χk = ν2I2 and (1/K) PK\nk=1 η−1\nk Xj,k = 0\n(10) becomes\nCF F =\n\u0000α−1I2−\nα−2 \u0002\nxT\n1F , 1\n\u0003\n⊗I2\n\u0012\nα−1\n\u0014 x1,F xT\n1,F\nx1,F\nxT\n1,F\n1\n\u0015\n⊗I2\n+β−1\n\u0014\nKν2I2\n0\n0\nKγ\n\u0015\n⊗I2\n\u0013−1 \u0002\nxT\n1F , 1\n\u0003T ⊗I2\n!−1\n=\n\u0010\nα−1I2 −α−2 \u0002\nxT\n1F , 1\n\u0003\n⊗I2\n\u0000L−1 ⊗I2\n\u0001 \u0002\nxT\n1F , 1\n\u0003T ⊗I2\n\u0011−1\n=\n\u0010\nα−1I2 −α−2 \u0010\u0002\nxT\n1F , 1\n\u0003\nL−1 \u0002\nxT\n1F , 1\n\u0003T \u0011\n⊗I2\n\u0011−1\n,\nwhere\nL =\n\u0014 α−1x1,F xT\n1,F + β−1Kν2I2\nα−1x1,F\nα−1xT\n1,F\nα−1 + Kγβ−1\n\u0015\n,\nwith α = ς2σ2\n1,F and β = ς2σ2\n1,0 + σ2\n2,0.\nLet A = α−1x1,F xT\n1,F + β−1Kν2I2, B = α−1x1,F ,\nC = α−1xT\n1,F , D = α−1 + Kγβ−1, then A −BD−1C =\nα−1Θ + β−1Kν2I2 −α−2(α−1 + Kγβ−1)−1Θ = (α +\n(Kγ)−1β)−1Θ + β−1Kν2I2, where Θ = x1,F xT\n1,F . If a =\n(α+(Kγ)−1β)−1 and b = β−1Kν2 then (A−BD−1C)−1 =\n(aΘ + bI2)−1 = b−1(b + ar2)−1 (aΘ∗+ bI2), where Θ∗=\nRΘRT, with R the π/2 rotation matrix. This gives (A −\nBD−1C)−1 = βK−1ν−2(αβ−1 + Kν2 + r2 + Kν2)−1Θ∗+\ncI2, where c = (β−1Kν2 + (α + (Kγ)−1β)−1r2)−1. In a\nfurther condensing of notation we deﬁne ¯β ≡(1/K)γ−1β.\nWith Θ∗x1,F = 0 it can be shown that\nCF F = (α−1 −α−2 \u0000cr2 −2cr2(α−1 + ¯β−1)−1α−1+\n(α−1 + ¯β−1)−1 + cr2α−2(α−1 + ¯β−1)−2\u0001\n)−1I2\n= α(1 −α−1(cr2(α−1(α−1 + ¯β−1)−1 −1)2+\n(α−1 + ¯β−1)−1))−1I2\n= α\n\u0012\n1 −α−1\n\u0012 cr2α2\n(α + ¯β)2 + (α−1 + ¯β−1)−1\n\u0013\u0013−1\nI2\n= α\n\u0012\n1 −\ncr2α\n(α + ¯β)2 −\n¯β\nα + ¯β\n\u0013−1\nI2.\nWith\ncr2α\n(α + ¯β)2 =\n\u0012 ν2\nγr2 (α−1 + ¯β−1) + α−1\n\u0013−1\n(α + ¯β)−1\nit follows that\nCF F = α\n\n\n1 −\n\u0010\nν2\nγr2 (α−1 + ¯β−1) + α−1\u0011−1\n(α + ¯β)\n−\n¯β\nα + ¯β\n\n\n\n−1\nI2\n= α\n\n\n\nα −\n\u0010\nν2\nγr2 (α−1 + ¯β−1) + α−1\u0011−1\nα + ¯β\n\n\n\n−1\nI2\n= α(α + ¯β)\n\nα −\n1\n\u0010\nν2\nγr2 (α−1 + ¯β−1) + α−1\n\u0011\n\n\n−1\nI2\n= α(α + ¯β)\n\n\nα ν2\nγr2 (α−1 + ¯β−1)\n\u0010\nν2\nγr2 (α−1 + ¯β−1) + α−1\n\u0011\n\n\n−1\nI2\n= (α + ¯β)\n\n1 +\n1\nα\n\u0010\nν2\nγr2 (α−1 + ¯β−1)\n\u0011\n\nI2\n= (α + ¯β)\n \n1 +\nγr2\nν2 ¯β\nα + ¯β\n!\nI2\n= α + ¯β\n\u0012\n1 + γr2\nν2\n\u0013\nI2\n= α +\n1\nKγ β\n\u0012\n1 + γr2\nν2\n\u0013\nI2.\nREFERENCES\n[1] B. Zitov´a and J. Flusser. Image registration methods: a survey. Image\nVision Comput, 21:977 — 1000, 2003.\n[2] J. Ashburner, P. Neelin, D. L. Collins, A. Evans, and K. Friston.\nIncorporating prior knowledge into image registration.\nNeuroimage,\n6:344 — 352, 1997.\nPREPRINT. COPYRIGHT (C) 2010 IEEE\n13\n[3] N. Chumchob and K. Chen. A robust afﬁne image registration method.\nInt J Numer Anal Mod, 6:311 — 334, 2009.\n[4] A. Myronenko and X. Song.\nIntensity-based image registration by\nminimizing residual complexity.\nIEEE T Med Imaging, 29:1882 —\n1891, 2010.\n[5] S. Liao and A. C. S. Chung. Feature based nonrigid brain MR image\nregistration with symmetric alpha stable ﬁlters. IEEE T Med Imaging,\n29:106 — 119, 2010.\n[6] M. S. Yasein and P. Agathoklis.\nA feature-based image registration\ntechnique for images of different scales. IEEE Pacif, pages 792 — 797,\n2009.\n[7] Z. Shen and S. B. Andersson. Bias and precision of the ﬂuoroBrancroft\nalgorithm for single particle localization in ﬂuorescence microscopy.\nIEEE T Signal Proces, 59:4041 — 4046, 2011.\n[8] Z. Shen and S. B. Andersson.\nTracking nanometer-scale ﬂuorescent\nparticles in two dimensions with a confocal microscope. IEEE T Contr\nSyst T, 19:1269 — 1278, 2011.\n[9] Y. Wong, Z. Lin, and R. J. Ober. Limit of the accuracy of parameter esti-\nmation for moving single molecules imaged by ﬂuorescence microscopy.\nIEEE T Signal Proces, 59:895 — 911, 2011.\n[10] J. M. Fitzpatrick, J. B. West, and C. R. Maurer.\nPredicting error in\nrigid-body point-based registration. IEEE T Med Imaging, 17:694 —\n702, 1998.\n[11] J. M. Fitzpatrick, J. B. West, and C. R. Maurer. Derivation of expected\nregistration error for point-based rigid-body registration. Proc SPIE Med\nImag: Imag Process, 3338:16 — 27, 1998.\n[12] J. M. Fitzpatrick and J. B. West. The distribution of target registration\nerror in rigid-body point-based registration.\nIEEE T Med Imaging,\n20:917 — 927, 2001.\n[13] M. H. Moghari and P. Abolmaesumi.\nA high-order solution for\nthe distribution of target registration error in rigid-body point-based\nregistration. Med Image Comput Comput Assist Interv - Lecture Notes\nin Computer Science, 4191:603 — 611, 2006.\n[14] B. Ma, M. H. Moghari, R. E. Ellis, and P. Abolmaesumi. On ﬁducial\ntarget registration error in the presence of anisotropic noise. Med Image\nComput Comput Assist Interv, 10:628 — 635, 2007.\n[15] A. D. Wiles, A. Likholyot, D. D. Frantz, and T. M. Peters. A statistical\nmodel for point-based target registration error with anisotropic ﬁducial\nlocalizer error. IEEE T Med Imaging, 27:378 — 390, 2008.\n[16] M. H. Moghari and P. Abolmaesumi. Distribution of target registration\nerror for anisotropic and inhomogeneous ﬁducial localization error. IEEE\nT Med Imaging, 28:799 — 813, 2009.\n[17] B. Ma, M. H. Moghari, R. E. Ellis, and P. Abolmaesumi. Estimation of\noptimal ﬁducial target registration error in the presence of heteroscedas-\ntic noise. IEEE T Med Imaging, 29:708 — 723, 2010.\n[18] E. A. K. Cohen and R. J. Ober.\nAnalysis of point based image\nregistration errors with applications in ﬂuorescence microscopy. IEEE\nT Signal Proces, 61:6291 — 6306, 2013.\n[19] B. Matei and P. Meer. Optimal rigid motion estimation and performance\nevaluation with bootstrap. Proc CVPR IEEE, 1:1339 — 1342, 1999.\n[20] B. Matei and P. Meer. A general method for errors-in-variables problems\nin computer vision. Proc CVPR IEEE, 2:2018 — 2021, 2000.\n[21] M. H. Moghari and P. Abolmaesumi. Understanding the effect of bias in\nﬁducial localization error on point-based rigid-body registration. IEEE\nT Med Imaging, 29:1730 — 1738, 2010.\n[22] R. R. Shamir, L. Joskowicz, and Y. Shoshan. Fiducial optimization for\nminimal target registration error in image-guided neurosurgery. IEEE T\nMed Imaging, 31:725 — 737, 2012.\n[23] E. Betzig, G. H. Patterson, R. Sougrat, O. W. Lindwasser, S. Olenych,\nJ. S. Bonifacino, M. W. Davidson, J. Lippincott-Schwartz, and H. F.\nHess. Imaging intracellular ﬂuorescent proteins at nanometer resolution.\nScience, 313:1642 — 1645, 2006.\n[24] R. J. Ober, S. Ram, and E. S. Ward. Localization accuracy in single-\nmolecule microscopy. Biophys J, 86:1185 — 1200, 2004.\n[25] S. Ram, E. S. Ward, and R. J. Ober. A stochastic analysis of distance\nestimation approaches in single molecule microscopy: quantifying the\nresolution limits of photon-limited imaging systems. Multidim Syst Sign\nP, 3:503 — 542, 2012.\n[26] A. V. Abraham, S. Ram, J. Chao, E. S. Ward, and R. J. Ober. Quantitative\nstudy of single molecule location estimation techniques. Opt Express,\n17:23352 — 23373, 2009.\n[27] C. S. Smith, N. Joseph, B. Rieger, and K. A. Lidke. Fast, single molecule\nlocalization that acheives theoretical minimum uncertainty. Nat Methods,\n7:373 — 375, 2010.\n[28] I. S. Yetik and A. Nehorai. Performance bounds on image registration.\nIEEE T Signal Proces, 54:1737 — 1749, 2006.\n[29] J. Li and P. Huang.\nA comment on “performance bounds on image\nregistration”. IEEE T Signal Proces, 57:2432 — 2433, 2009.\n[30] L. J. Gleser. Estimation in a multivariate “errors in variable” regression\nmodel: large sample results. Ann Stat, 9:24 — 44, 1981.\n[31] N. N. Chan and T. K. Mak. Heteroscedastic errors in a linear-functional\nrelationship. Biometrika, 71:212 — 215, 1984.\n[32] S. M. Kay. Fundamentals of Statistical Signal Processing: Estimation\nTheory. Prentice Hall, 1993.\n[33] E. A. K. Cohen and R. J. Ober. Measurement errors in ﬂuorescence\nmicroscopy experiments. Conf Rec Asilomar C, pages 1602 — 1606,\n2012.\n"}