{"text": "An Analysis of Active Learning With Uniform Feature Noise\nAaditya Ramdas12\naramdas@cs.cmu.edu\nBarnab´as P´oczos2\nbapoczos@cs.cmu.edu\nAarti Singh2\naarti@cs.cmu.edu\nLarry Wasserman12\nlarry@stat.cmu.edu\nDepartment of Statistics1 and Machine Learning Department2\nCarnegie Mellon University\nAugust 6, 2018\nAbstract\nIn active learning, the user sequentially chooses values for feature X and an oracle returns\nthe corresponding label Y . In this paper, we consider the eﬀect of feature noise in active\nlearning, which could arise either because X itself is being measured, or it is corrupted in\ntransmission to the oracle, or the oracle returns the label of a noisy version of the query\npoint. In statistics, feature noise is known as “errors in variables” and has been studied\nextensively in non-active settings. However, the eﬀect of feature noise in active learning has\nnot been studied before. We consider the well-known Berkson errors-in-variables model with\nadditive uniform noise of width σ.\nOur simple but revealing setting is that of one-dimensional binary classiﬁcation setting\nwhere the goal is to learn a threshold (point where the probability of a + label crosses half).\nWe deal with regression functions that are antisymmetric in a region of size σ around the\nthreshold and also satisfy Tsybakov’s margin condition around the threshold. We prove min-\nimax lower and upper bounds which demonstrate that when σ is smaller than the minimiax\nactive/passive noiseless error derived in Castro & Nowak (2007), then noise has no eﬀect on\nthe rates and one achieves the same noiseless rates. For larger σ, the unﬂattening of the\nregression function on convolution with uniform noise, along with its local antisymmetry\naround the threshold, together yield a behaviour where noise appears to be beneﬁcial. Our\nkey result is that active learning can buy signiﬁcant improvement over a passive strategy\neven in the presence of feature noise.\n1\nIntroduction\nActive learning is a machine learning paradigm where the algorithm interacts with a label-\nproviding oracle in a feedback driven loop where past training data (features queried and cor-\nresponding labels) are used to guide the design of subsequent queries. Typically, the oracle is\n1\narXiv:1505.04215v1  [stat.ML]  15 May 2015\nqueried with an exact feature value and the oracle returns the label corresponding precisely to\nthat feature value. However, in many scenarios, the feature value being queried can be noisy and\nit helps to analyze what would happen in such a setting. Such situations include noisy sensor\nmeasurements of features, corrupted transmission of data from source to storage, or just access\nto a limited noisy oracle.\nThe errors-in-variables model has been well studied in the statistical literature and their eﬀect\ncan be profound.\nIn density estimation, Gaussian error causes the minimax rate to become\nlogarithmic in sample size instead of polynomial, see Fan (1991). For results in passive regression,\nrefer to Fan et al. (1993); Fuller (2009); Carroll et al. (2010), and for passive classiﬁcation,\nsee Loustau & Marteau (2012).\nHowever, classiﬁcation has not been studied in the Berkson\nmodel introduced below. Also, deconvolution estimators require the noise fourier transform to\nbe bounded away from zero, ruling out uniform noise. Finally, to the best of our knowledge,\nfeature noise has not been studied for active learning in any setting.\nThe classical errors in variables model has the graphical form W ←X →Y , representing\nW = X + δ ,\nY = m(X) + ϵ .\nHere, the label Y depends on the feature X but we do not observe X; rather we observe the\nnoisy feature W. The Berkson errors in variables model is\nX = W + δ ,\nY = m(X) + ϵ .\nThe diﬀerence is that we start with an observed feature W and then noise is added to determine\nX. Graphically, this model is W →X →Y .\nIn this paper, we focus on the Berkson error model since it intuitively makes more sense for active\nlearning - it captures the idea that we request a label for feature W, but the oracle returns the\nlabel for X which is a corrupted version generated from W, i.e. the noise occurs between the\nlabel request and the oracle output. We use uniform noise since it yields insightful behavior and\nalso has not been addressed in the literature. We conjecture that qualitatively similar results\nhold for other symmetric error models.\n1.1\nSetup\nThreshold Classiﬁcation.\nLet X = [−1, 1], Y = {+, −}, and f : X →Y denote a classiﬁ-\ncation rule. Assuming 0/1 loss, the risk of the classiﬁcation rule f is R(f) = E[1{f(X)̸=Y }] =\nP(f(X) ̸= Y ). It is known that the Bayes optimal classiﬁer, the best measurable classiﬁer that\nminimizes the risk f ∗= arg minf R(f), has the following form\nf ∗(x) =\n(\n+\nif m(x) ≥1/2 ,\n−\nif m(x) < 1/2 ,\nwhere m(x) = P(Y = +|X = x) is the unknown regression function. In what follows, we will\nconsider the case where the f ∗is a threshold classiﬁer, i.e. there exists a unique t ∈[−1, 1] with\nm(t) = 1/2 such that m(x) < 1/2 if x < t, and m(x) > 1/2 if x > t.\n2\nBerkson Error Model.\nThe model is:\n1. User chooses W and requests label.\n2. Oracle receives a noisy W namely X = W + U.\n3. Oracle returns Y where P(Y = +|X = x) = m(x).\nWe take the noise to be uniform: U ∼Unif[−σ, σ], where the noise width σ is known for\nsimplicity.\nSampling Strategies.\nIn passive sampling, assume that we are given a batch of wi ∼Unif[−1, 1]\nand corresponding labels yi sampled independently of {wj}j̸=i and {yj}j̸=i. In this case, a strat-\negy S is just an estimator Sn : (W × Y )n →[−1, 1] that returns a guess bt of the threshold t on\nseeing {wi, yi}n\ni=1.\nIn active sampling we are allowed to sequentially choose wi = Si(w1, . . . , wi−1, y1, . . . , yi−1),\nwhere Si is a possibly random function of past queries and labels, where the randomness is\nindependent of queries and labels. In this case, a strategy A is a sequence of functions Si :\n(W × Y )i−1 →[−1, 1] returning query points and an estimator Sn : (W × Y )n →[−1, 1] that\nreturns a guess bt at the end.\nLet SP\nn , SA\nn be the set of all passive or active strategies (and estimators) with a total budget of\nn labels.\nTo avoid the issue of noise resulting in a point outside the domain, we make a (Q)uerying\nassumption:\n(Q). Querying within σ of the boundary is disallowed.\nLoss Measure.\nLet bt = bt(W n\n1 , Y n\n1 ) denote an estimator of t using n samples from a passive or\nactive strategy. Our task will be to estimate the location of t, where we measure accuracy of an\nestimator bt by a loss function which is the point error |bt −t|.\nFunction Class.\nIn the analysis of rates for classiﬁcation (among others), it is common to\nuse the Tsybakov Noise/Margin Condition (see Tsybakov (2004)), to characterize the behavior\nof m(x) around the threshold t. Given constants c, C with C ≥c, k ≥1, and noise level σ, let\nP(c, C, k, σ) be the set of regression functions m(x) that satisfy the following conditions (T,M,B)\nfor some threshold t:\n(T). |x −t|k−1 ≥|m(x) −1/2| ≥c|x −t|k−1 whenever |m(x) −1/2| ≤ϵ0 for some constant ϵ0\n(M). m(t + δ) −1/2 = 1/2 −m(t −δ) for all δ ≤σ.\n(B). t is at least σ away from the boundary.\nOn adding noise U, the point where m ⋆U (⋆means convolution) crosses half may diﬀer from\nt, the point where m crosses half. However, the antisymmetry assumption (M) and boundary\nassumption (B) together imply that the two thresholds are the same. Getting rid of (M,B) seems\nsubstantially diﬃcult.\nWhen σ = 0, (Q), (M) and (B) are vacuously satisﬁed, and this is exactly the class of functions\nand strategies considered in Castro & Nowak (2007). Smaller k means that the regression function\n3\nis steeper, which makes it easier to estimate the threshold and classify future labels (cf. Steinwart\n& Scovel (2004)). k = 1 captures a discontinuous m(x) jumping at t.\nMinimax Risk.\nWe are interested in the minimax risk under the point error loss :\nRn(P(c, C, k, σ)) = inf\nS∈Sn\nsup\nP ∈P(c,C,k,σ)\nE|bt −t|\n(1)\nwhere Sn is the set of strategies accessing n samples. For brevity, RP\nn (k, σ) or RA\nn (k, σ) denotes\nrisk for (P)assive/(A)ctive sampling stratgies SP\nn , SA\nn .\nNotation ≺, ≻, ≍, ⪯, ⪰.\nWe analyse minimax point error rates in diﬀerent regimes of σ as a\nfunction of n (or equivalently, for a given point error, we can analyse how the sample size n\ndepends on σ) and we write σn for emphasis. In this paper, fn ≺gn means fn/gn →0, fn ≍gn\nmeans c1gn ≤fn ≤c2gn where c1, c2 are constants, fn ⪯gn means fn ≺gn or fn ≍gn, fn ⪰gn\nmeans gn ⪯fn and fn ≻gn means gn ≺fn.\n2\nMain Result and Comparisions\nThe main result of this paper is as follows.\nTheorem 1. Under the Berkson error model, when given n labels sampled actively or passively\nwith assumption (Q), and when the true underlying regression function lies in P(c, C, k, σn) for\nknown k, σn, the minimax risk under the point error loss is:\n1. RP\nn (P(k, σ)) ≍\n(\nn−\n1\n2k−1\nif σn ≺n−\n1\n2k−1\nσ\n−(k−3\n2 )\nn\nq\n1\nn otherwise\n2. RA\nn (P(k, σ)) ≍\n(\nn−\n1\n2k−2\nif σn ≺n−\n1\n2k−2\nσ−(k−2)\nn\nq\n1\nn otherwise\nWhen k = 1, m(x) jumps at the threshold, and we interpret the quantity n−\n1\n2k−2 as being\nexponentially small, i.e. being smaller than n−p for any p. We also suppress logarithmic factors\nin n, σn. If the domain was [−R, R], the corresponding passive rates are obtained by substituting\nn by n/R, but active rates remain the same upto logarithmic factors in R.\nRemark.\nIn this paper, we focus on learning the threshold t. This is relevant because the\nthreshold maybe of intrinsic interest, and also of interest for prediction if, for example, future\nqueries could be made with a diﬀerent noise model or can be obtained (with some cost) noise-free.\nSimilar results can be derived for 0/1-risk.\nZero Noise.\nWhen σ = 0, the assumptions (Q,B,M) are vacuously true, and our class P(c, C, k, 0)\nmatches the class P(c, C, k) considered in Castro & Nowak (2007), and our rates for σ = 0 i.e.\nn−\n1\n2k−1 and n−\n1\n2k−2 are precisely the passive and active minimax point error rates in Castro &\nNowak (2007).\n4\nSmall Noise.\nWhen the noise is small, we get what we expect - the risk does not change with\nnoise as long as the noise itself is smaller than the noiseless error. In other words, as long as\nthe noise is smaller than the noiseless error rate of n−\n1\n2k−1 for passive learning, passive learners\nwill not really be able to notice this tiny noise, and the minimax rate remains n−\n1\n2k−1 . Similarly,\nas long as the noise is smaller than the noiseless error rate of n−\n1\n2k−2 for active learning, active\nlearners will not really be able to notice this tiny noise, and the minimax rate remains n−\n1\n2k−1 .\nAlso, the passive rates vary smoothly - at the point when σn ≍n−\n1\n2k−1 , the rates for small and\nlarge noise coincide. Similarly, at the point when σn ≍n−\n1\n2k−2 , the aforementioned active rates\nfor small and large noise coincide.\nLarge Noise and Assumption (M).\nWhen the noise is large, we see a curious behaviour\nof the rates. When k > 2, the error rates seem to get smaller/better with larger noise for both\nactive and passive learning, and furthermore the noisy rates can also be better than the noiseless\nrate! This might seem to violate both the information processing inequality, and our intuition\nthat more noise shouldn’t help estimation. Moreover, a noiseless active learner may be able to\nsimulate a noisy situation by adding noise and querying at the resulting point, and get better\nrates, violating lower bounds in Castro & Nowak (2007).\nHowever, we make the following crucial but subtle observation. Our claimed rates are not about\na ﬁxed function class - due to assumption (M), the function class changes with σ, and in fact\n(M) requires the antisymmetry of the regression function to hold over a larger region for larger\nσ. This set of functions is actually getting smaller with larger σ. Even though the functions can\nbehave quite arbitrarily outside (t −σ, t + σ), this assumption (M) on a small region of size 2σ\nactually helps us signiﬁcantly.\nGiven that there is no contradiction to the results of Castro & Nowak (2007) or more funda-\nmental information theoretic ideas, there is also an intuitive explanation of why assumption (M)\nhelps when we have large noise. As we will see in a later ﬁgure, convolution with noise seems to\n“stretch/unﬂatten” the function around the threshold. Speciﬁcally, for larger k > 2, the regres-\nsion function can be quite ﬂat around the threshold - convolution with noise makes it less ﬂat\nand more linear - in fact it behaves linearly over a large region of width nearly 2σ. This is true\nregardless of whether assumption (M) holds - however if (M) does not hold, then the convolved\nthreshold, which is the point where the convolved function crosses half, need not be the original\nthreshold t. While dropping assumption (M) will not hurt if we only want to ﬁnd the convolved\nthreshold, but given that our aim is to estimate t, the problem of ﬁguring out how much the\nthreshold shifted can be quite non-trivial.\nHence, large noise ensures a behaviour that is less ﬂat and more linear around the threshold, and\nassumption (M) ensures that the threshold doesn’t shift from t. Intuitively this is why (M) and\nlarge noise help, and technically there is no contradiction becasue the function class is getting\nprogressively simpler because of more controlled growth around the threshold.\nThe main takeaway is that in all settings, active learning yields a gain over passive sampling. We\nnow describe the upper and lower bounds that lead to Theorem 1. The case k = 1 is handled in\ndetail for intuitionb but proofs for k > 1 are in the Appendix.\n5\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.3\n0.4\n0.5\n0.6\n0.7\nQuery Domain\nη(x) in red, F(w) in blue\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.3\n0.4\n0.5\n0.6\n0.7\nQuery Domain\nη(x) in red, F(w) in blue\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.3\n0.4\n0.5\n0.6\n0.7\nQuery Domain\nη(x) in red, F(w) in blue\nFigure 1: Regression function η(x) (red) before and F(w) (blue) after convolution with noise.\nIn all 3 ﬁgures, Tsybakov’s margin condition holds for x ∈[0.4, 0.6]. The top plot has a linear\nregression function (k = 2), and its two blue curves are for σn = 0.05 (narrow), 0.2 (wide), and\nthey show that a linear growth around t = 0.5 remains linear. The middle and bottom ﬁgure are\nfor a ﬂatter regression function with k = 4, and σn = 0.05, 0.2 respectively, plotted separately\nfor clarity. k = 4 is harder than for k = 2 because the red curve is ﬂatter around t, making it\nharder to pinpoint the threshold. However, as one can see in both plots, noise actually helps by\nsmoothing it out and making it more linear. However, note that the eﬀect of assumption (M)\ncannot be understated, due to which in all plots the threshold before and after noise cross half\nat the same point. The eﬀect of noise when k = 1 can be seen in the following section.\n2.1\nSimulation of Noise Convolution\n2.2\nPaper Roadmap\nWe devote the next two sections to proving the lower and upper bounds, in that order, that lead\nto Theorem 1. While the proofs will be self-contained, we leave some detailed calculations to the\nappendix.\nFor easier readibility, we present lower bounds for k = 1 ﬁrst to absorb the technique and then\nthe lower bounds for k > 1. In Section 2 we will prove\nTheorem 2 (Lower Bounds). Under the Berkson error model and assumption (Q),\n6\n1. For k = 1, the passive/active lower bounds are\ninf\nS∈SP\nn\nsup\nP ∈P(1,σn)\nE|bt −t| ⪰\n(\n1\nn\nif σn ≺1\nn\np σn\nn\notherwise\ninf\nS∈SA\nn\nsup\nP ∈P(1,σn)\nE|bt −t| ⪰\n(\ne−n\nif σn ≺e−n\nσn\n√n\notherwise\n2. For k > 1, the passive/active lower bounds are\ninf\nS∈SP\nn\nsup\nP ∈P(k,σn)\nE|bt −t| ⪰\n(\nn−\n1\n2k−1 if σn ≺n−\n1\n2k−1\nσ\n−(k−3\n2 )\nn\nq\n1\nn otherwise\ninf\nS∈SA\nn\nsup\nP ∈P(k,σn)\nE|bt −t| ⪰\n(\nn−\n1\n2k−2 if σn ≺n−\n1\n2k−2\nσ−(k−2)\nn\nq\n1\nn otherwise\nFollowing that, we again present active and passive algorithms for k = 1 ﬁrst to gather intuition\nand then generalize them for k > 1. In Section 3 we will prove\nTheorem 3 (Upper Bounds). Under the Berkson error model and assumption (Q),\n1. For k = 1, a passive algorithm (WIDEHIST) and an active algorithm (ACTPASS) return\nbt s.t.\nsup\nP ∈P(1,σn)\nE|bt −t| ⪯\n(\n1\nn\nif σn ≺1\nn\np σn\nn\notherwise\nsup\nP ∈P(1,σn)\nE|bt −t| ⪯\n(\ne−n\nif σn ≺e−n\nσn\n√n\notherwise\n2. For k > 1, a passive algorithm (WIDEHIST) and an active algorithm (ACTPASS) return\nbt s.t.\nsup\nP ∈P(k,σn)\nE|bt −t| ⪯\n(\nn−\n1\n2k−1 if σn ≺n−\n1\n2k−1\nσ\n−(k−3\n2 )\nn\nq\n1\nn otherwise\nsup\nP ∈P(k,σn)\nE|bt −t| ⪯\n(\nn−\n1\n2k−2 if σn ≺n−\n1\n2k−2\nσ−(k−2)\nn\nq\n1\nn otherwise\n3\nLower Bounds\nTo derive lower bounds, we will follow the approach of Ibargimov & Hasminskii (1981); Tsybakov\n(2009) which were exempliﬁed in lower bounds for active learning problems without feature noise\nin Castro & Nowak (2007, 2008). The standard methodology is to reduce the problem of classi-\nﬁcation in the class P(c, C, k, σ) to one of hypothesis testing. Similar to Castro & Nowak (2007,\n7\n2008), it will suﬃce to consider two hypotheses and use the following version of Fano’s lemma\nfrom Tsybakov (2009) (Theorem 2.2).\nTheorem 4 (Tsybakov (2009)). Let F be a class of models. Associated with each f ∈F we\nhave a probability measure Pf deﬁned on a common probability space. Let d(., .) : F, F →R\nbe a semi-distance. Let f0, f1 ∈F be such that d(f0, f1) ≥2a, with a > 0. Also assume that\nKL(Pf0, Pf1) ≤γ, where KL denotes the Kullback-Leibler divergence. Then, the following bound\nholds:\ninf\nb\nf\nsup\nf∈F\nPf(d( bf, f) ≥a)\n≥\ninf\nbt\nmax\nj∈{0,1} Pfj(d( bf, fj) ≥a)\n≥\nmax\n \ne−γ\n4 , 1 −\np γ\n2\n2\n!\n=: ρ\nwhere the inf is taken with respect to the collection of all possible estimators of f based on a\nsample from Pf.\nCorollary 5. If γ is a constant, then ρ is a constant, and by Markov’s inequality, we would get\ninf\nb\nf\nsup\nf∈F\nEd( bf, f) ≥ρa\nand the minimax risk under loss d would be ⪰a.\nProof of Theorem 2, k = 1.\nChoose F = P(1, σn). Let Pt ∈P(1, σn) denote a regression\nfunction with threshold at t. We choose the semi-metric to be the distance between thresholds,\ni.e. d(Pr, Ps) = |r −s|. We now choose two such distributions with thresholds at least 2an apart\n(we use an to explicitly remind the reader that a will later be set to depend on n) - let them be\ndenoted Pt0 and Pt1 with t0 = −an, t1 = an and\nPt(Y = +|X = x) =\n(\n0.5 −c\nx < t ,\n0.5 + c\nx ≥t .\nDue to addition of noise, we get convolved distributions P 0 = Pt0(Y |W) and P 1 := Pt1(Y |W).\nAs hinted by the above corollary, we will choose an so that KL(P 0, P 1) is bounded by a constant,\nto get a lower bound on risk ⪰an. This follows by the following argument from Castro & Nowak\n(2008).\n8\nThe KL(P 0, P 1) can be bounded as\nE1\nW,Y\n\u0014\nlog P 1(W n\n1 , Y n\n1 )\nP 0(W n\n1 , Y n\n1 )\n\u0015\n(2)\n=\nE1\nW,Y\n\u0014\nlog\nQ\ni P 1(Yi|Wi)P(Wi|W i−1\n1\n, Y i−1\n1\n)\nQ\ni P 0(Yi|Wi)P(Wi|W i−1\n1\n, Y i−1\n1\n)\n\u0015\n=\nE1\nW,Y\n\u0014\nlog\nQ\ni P 1(Yi|Wi)\nQ\ni P 0(Yi|Wi)\n\u0015\n(3)\n=\nX\ni\nE1\nW\n\u0014\nE1\nY\n\u0014\nlog P 1(Yi|Wi)\nP 0(Yi|Wi)\n\f\f\f W1, ..., Wn\n\u0015\u0015\n(4)\n≤\nn\nmax\nw∈[−1,1] E1\nY\n\u0014\nlog P 1(Y |W)\nP 0(Y |W)\n\f\f\f W = w\n\u0015\n(5)\n⪯\nn\nmax\nw∈[−1,1](P 1(Y |w) −P 0(Y |w))2\n(6)\nwhere (3) holds for active learning because the algorithm determines Wi when given {W i−1\n1\n, Y i−1\n1\n}\nand is independent of the model, and follows by the independence of future from past for passive\nlearning. (4) holds by law of iterated expectation. (5) is used for active learning but is not needed\nfor passive learning. (6) follows by an approximation\nKL(Ber(1/2 + p), Ber(1/2 + q)) ⪯(p −q)2\nfor suﬃciently small constants p, q.\nt0 \n1/2 \n0 \nλ\t\n\r\nλ\t\n\r\nP(Y=+|X=x) \nx  \n1/2-λ\t\n\r\n1/2+λ\t\n\r\nt1 \nm1\nm0\nt0 \n1/2 \n0 \nP(Y=+|W=w) \nx  \n1/2-λ\t\n\r\n1/2+λ\t\n\r\nt1 \n˜\nm1\n˜\nm0\n2σn\n2σn\nFigure 2: Regression functions before (top) and after (bottom) convolution with noise.\nFt(w) := Pt(Y |W = w) =\nR\nPt(Y |X)P(X|W = w)dX and a straightforward calculation reveals\nthat\nFt(w) =\n\n\n\n\n\n0.5 −c\nw ≤t −σn ,\n0.5 +\nc\nσn (w −t)\nw ∈[t −σn, t + σn] ,\n0.5 + c\nw ≥t + σn .\n(7)\nAs depicted in Fig.2, note the behavior before and after convolution with noise: (i) m(t) =\nF(t) = 1/2, hence F1(an) = 1/2 = F0(−an) (ii) Both convolved regression functions grow\nlinearly for a region of width 2σn, and diﬀer only on a width of 2(σn +an); (iii) For a large region\n9\n[an −σn, −an + σn] of size 2(σn −an), we have\n\f\fF1(w) −F0(w)\n\f\f = 2anc/σn, a constant. Their\ngap varies when σn ⪰an as\n\f\fF0(w) −F1(w)\n\f\f =\n\n\n\n\n\n\n\n\n\n\n\n\u0010\nw + an + σn\n\u0011\nc\nσn\nw ∈[−an −σn, an −σn]\n2an c\nσn\nw ∈[an −σn, −an + σn]\n\u0010\n(an + σn) −w\n\u0011\nc\nσn\nw ∈[−an + σn, an + σn]\n0\notherwise.\nWhen σn ≺an,\n\f\fF1(w) −F0(w)\n\f\f =\n\n\n\n\n\n\n\n\n\n\n\n\u0010\nw + an + σn\n\u0011\nc\nσn\nw ∈[−an −σn, −an + σn]\n2c\nw ∈[−an + σn, an −σn]\n\u0010\n(an + σn) −w\n\u0011\nc\nσn\nw ∈[an −σn, an + σn]\n0\notherwise.\nFor active learning, when σn ⪰an we note\nmax\nw∈[−1,1] |P 1(Y |w) −P 0(Y |w)| = 2anc\nσn\nand get KL(P 0, P 1) ⪯n a2\nn\nσ2n by Eq.(6). We choose an ≍σn\n√n, which becomes our active minimax\nerror rate by Corollary 5 when σn ⪰an i.e. σn ⪰e−n.\nSimilarly, if σn ≺exp{−n}, setting an ≍exp{−n} easily gives us an exponentially small lower\nbound.\nIn the passive setting, Eq.(5) does not apply. Since the two convolved distributions diﬀer only\non an interval of size 2(σn + an), the eﬀective number of points falling in this interval would be\n≍n(σn + an).\nWhen σn ⪰an, a simple calculation shows\nKL(P 0, P 1) ⪯n(σn + an)a2\nn\nσ2n\n≍na2\nn\nσn\n,\ngiving rise to a choice of an ≍p σn\nn , which is the passive minimax rate when σn ⪰an i.e.\nσn ⪰1\nn.\nWhen σn ≺1\nn, a similar calculation shows\nKL(P 0, P 1) ⪯n(σn + an)4c2 ≍nan\ngiving rise to a choice of an ≍1\nn, which is the passive minimax rate when σn ⪰an i.e. σn ≺1\nn.\n■\nProof of Theorem 2, k > 1\nWe follow a very similar setup to the case k = 1. The diﬀerence\nwill lie in picking functions that are in P(c, C, k, σn) for general k ̸= 1, and calculating the bounds\non KL divergence appropriately. However, for notational convenience, we will assume that the\n10\ndomain is shifted to [−σn, 2 −σn] instead of [−1, 1] and that the distance between thresholds is\nan instead of 2an. Deﬁne\nP0(Y |x) =\n(\n1/2 −c|x|k−1 if x ∈[−σn, 0]\n1/2 + c|x|k−1 if x > 0\nP1(Y |x) =\n\n\n\n\n\n1/2 −c|x −an|k−1 if x ∈[−σn, an]\n1/2 + c|x −an|k−1 if x ∈[an, βan + σn]\n1/2 + c|x|k−1\nif x > βan + σn\nwhere β =\n1\n1−(c/C)1/(k−1) ≥1 is a constant chosen such that P1 ∈P(c, C, k, σn) (this fact is\nveriﬁed explicitly in the Appendix).\nFor ease of notation, P0, P1 are understood to actually\nsaturate at 0, 1 if need be (i.e.\nwe are implicitly working with min{P0/1, 1}, etc).\nThe two\nthresholds are clearly at 0, an respectively, and after the point βan + σn, the two functions are\nthe same.\nContinuing the same notation as for k = 1, we let P i = Pi(Y |W) = Fi(w) for\ni = 0, 1.\nThe following claims hold true (Appendix).\n1. When σn ⪯an, maxw |F1(w) −F2(w)| ≍ak−1\nn\n.\n2. When σn ⪰an, maxw |F1(w) −F2(w)| ≍σk−2\nn\nan.\n3. As a subpart of the above cases, when σn ≍an, maxw |F1(w) −F2(w)| ≍σk−2\nn\nan ≍ak−1\nn\nIf the above propositions are true, we can verify:\n1. In the ﬁrst case, KL(P 0, P 1) ⪯na2k−2\nn\n, hence an ≍n−\n1\n2k−2 is a lower bound when σn ⪯\nn−\n1\n2k−2 .\n2. Otherwise, KL(P 0, P 1) ⪯nσ2k−4\nn\na2\nn, hence an ≍\nσ−(k−2)\nn√n\nis a lower bound when σn ≻\nn−\n1\n2k−2 .\nThe passive bounds follow by not just considering the maximum diﬀerence between |F1(w) −\nF2(w)| but also the length of that diﬀerence, since it is directly proportional to the number of\npoints that may randomly fall in that region. Following the same calculations,\n1. When σn ≺an, |F1(w) −F2(w)| ≍ak−1\nn\nfor all w ∈[0, βan + 2σn]. Hence KL(P 0, P 1) ⪯\nn(βan + 2σn)a2k−2\nn\n≍na2k−1\nn\nand an ≍n−\n1\n2k−1 is the minimax passive rate when σn ≺\nn−\n1\n2k−1 .\n2. When σn ≻an, |F1(w) −F2(w)| ≍σk−2\nn\nan for all w ∈[0, βan + 2σn]. Hence KL(P 0, P 1) ⪯\nn(βan+2σn)σ2k−4\nn\na2\nn and an ≍σ\n−(k−3\n2 )\nn\nq\n1\nn is the minimax passive rate when σn ≻n−\n1\n2k−1 .\nas veriﬁed from the Appendix calculation.\n■\n4\nUpper Bounds\nFor passive sampling, we present a modiﬁed histogram estimator, WIDEHIST, when the noise\nlevel σn is larger than the noiseless minimax rate of 1/n.\nAssume for simplicity that the n\nsampled points on [−1, 1] are equally spaced to mimic a uniform distribution, lying at (2j−1)\n2n\n,\nj = 1, ..., n.\n11\nAlgorithm WIDEHIST.\n1. Divide [−1, 1] into m bins of width h > 2\nn so m = 2\nh < n. The ith bin covers [−1 + (i −\n1)h, −1+ih], i ∈{1, ..., m} and hence each bin has nh\n2 points. Let bi be the average number\nof positive labels in bin i of these nh\n2 points.\n2. Let bpi be the average of the bi’s over a all bins within ±σn/2 of bin i. We “classify” regions\nwith bpi < 1/2 as being −and bpi > 1/2 as being +, and return bt as the center of the ﬁrst\nbin from left to right where bpi crosses half.\nObserve that we need not operate on [−1, 1] with n queries - WIDEHIST(D,B) could take as\ninputs any domain D and any query budget B. The argument below hinges on the fact that the\nconvolved regression function behaves linearly around t.\nProof of Theorem 3, k = 1, (Passive).\nLet i∗∈{1, ..., m} denote the true bin [(i∗−1)h, i∗h]\nthat contains t. Let bt be from bin bi, i.e. bpbi < 1/2 and bpbi+1 > 1/2. We will argue that bi is very\nclose to i∗, in which case the point error we suﬀer is |bi −i∗|h. Speciﬁcally, we prove that all bins\nexcept I∗= {i∗−1, i∗, i∗+1} will be “classiﬁed” correctly with high probability. In other words,\nwe claim w.h.p. bpi < 1/2 if i < i∗−1 and bpi > 1/2 if i > i∗+ 1.\nIndeed, we can show (Appendix)\nFor i > i∗+ 2, E[bpi] ≥E[bpi∗+2] ≥1/2 +\nc\nσn h\n(8)\nFor i < i∗−2, E[bpi] ≤E[bpi∗−2] ≤1/2 −\nc\nσn h\n(9)\nUsing Hoeﬀding’s inequality, we get that for bin i, Pr(|bpi −pi| > ϵ) ≤2 exp\n\b\n−2 nσn\n2 ϵ2\t\nTaking\nunion bound over all bins other than those in i∗−1, i∗, i∗+ 1 and setting ϵ =\nc\nσn h, we get\nPr(∀i\\I∗, |bpi −pi| >\nc\nσn h) ≤2m exp\n\u001a\n−2 nσn\n2\n\u0010\nch\nσn\n\u00112\u001b\nSo we get bins i\\I∗correct andbi ∈{i∗−1, i∗, i∗+ 1} with probability ≥1−2n exp\n\u001a\n−nσn\n\u0010\nch\nσn\n\u00112\u001b\nsince m < n. Setting h = 1\nc\nq\nσn\nn log( 2n\nδ ) makes this hold with probability ≥1 −δ so the point\nerror |bi −i∗|h < 2h behaves like h ⪯p σn\nn .\n■\nFor active sampling when the noise level σn is larger than the minimax noiseless rate e−n, we\npresent a algorithm ACTPASS which makes its n queries on the domain [−1, 1] in E diﬀerent\nepochs/rounds. As a subroutine, it uses any optimal passive learning algorithm, like WIDE-\nHIST(D,B). In each round, ACTPASS runs WIDEHIST on progressively smaller domains D\nwith a restricted budget B. Hence it “activizes” the WIDEHIST and achieves the optimal ac-\ntive rate in the process. This algorithm was inspired by a similar idea from Ramdas & Singh\n(2013).\nAlgorithm ACTPASS.\nLet E = ⌈log(1/σn)⌉be the number of epochs and D1 = [−1, 1] denote the domain of “radius”\nR1 = 1 around t0 = 0. The budget of every epoch is a constant B = n/E. For epochs 1 ≤e ≤E,\ndo:\n1. Query for B labels uniformly on De.\n2. Let te = WIDEHIST(De, B) be the returned estimator using the most recent samples and\nlabels.\n12\n3. Deﬁne De+1 = [te −2−e, te + 2−e] ∩[−1, 1] with a radius of at most Re+1 = 2−e around te.\nRepeat.\nObserve that ACTPASS runs while Re > σn, since by design E ≥log(1/σn) so σn ≤2−E =\nRE+1.\nProof of Theorem 3, k = 2, (Active).\nThe analysis of ACTPASS proceeds in two stages\ndepending on the value of σn. Initially, when Re is large, it is possible that σn ⪯Re/n and in\nthis phase, the passive algorithm WIDEHIST will behave as if it is in the noiseless setting since\nthe noise is smaller than its noiseless rate. However, after some point, when Re becomes quite\nsmall, σn ⪰Re/n is possible and then WIDEHIST will behave as if it is in the noisy setting since\nnoise is larger than its noiseless rate. Observe that it cannot stay in the ﬁrst phase till the end\nof the algorithm, since the ﬁrst phase runs while σn ⪯Re/n but we know that σn > RE+1 by\nconstruction, so there must be an epoch where it switches phases, and ends the algorithm in its\nsecond phase.\nWe prove (by a separate induction in each epoch) that with high probability, the true threshold\nt will always lie inside the domain at the start of every epoch (this is clearly true before the ﬁrst\nepoch). We claim:\n1. Before all e in phase one, t ∈De w.h.p.\n2. Before all e in phase two, t ∈De w.h.p.\nWe prove these in the Appendix. If these are true, then in the second phase, WIDEHIST is in\nthe large noise setting and it gets an error of\nq\nReσn\nB\n. Hence the ﬁnal error of the algorithm is\nq\nREσn\nn/E ≍σn\n√n.\n■\nProof of Theorem 3, k > 1.\nThe proofs for k > 1 are simply generalizations of those for\nk = 1. Again, we present concise arguments here for the settings where the algorithm can actually\ndetect noise, i.e. when the noise level is larger than the noiseless minimax rate (otherwise, one\ncan argue that algorithms which worked for the noiseless case will suﬃce). In both cases, the\nalgorithm remains unchanged.\n1. We outline the proof for WIDEHIST when σn ⪰n−\n1\n2k−1 . Using similar notation as before, we\nwill again show that if t is in bin i∗of width h < σn, then except for bins i∗−1, i∗, i∗+ 1, we\nwill ”classify” all other bins correct with high probability, by averaging over the nσn/2 points to\nthe left and right of that bin. Speciﬁcally, we claim\nFor i > i∗+ 2, E[bpi] ≥E[bpi∗+2] ≥1/2 + λσk−2\nn\nh\n(10)\nFor i < i∗−2, E[bpi] ≤E[bpi∗−2] ≤1/2 −λσk−2\nn\nh\n(11)\nA similar use of Hoeﬀding’s inequality gives\nPr(∀i\\I∗, |bpi −pi|\n>\nλσk−2\nn\nh) ≤\n2m exp\n\b\n−2( nσn\n2R )h2λ2σ2k−4\nn\n\t\n.\nArguing as before, w.h.p. we get a point error of h ⪯\nq\nR\nσ2k−3\nn\nn < σn when σn ≻n−\n1\n2k−1 .\n2. We outline the proof for ACTPASS when σn ⪰n−\n1\n2k−2 . As before, the algorithm runs in two\nphases, and we will prove required properties within each phase by induction.\n13\nThe ﬁrst phase is when Re is large and so σn may possibly be smaller than (Re/n)\n1\n2k−1 and\nWIDEHIST will achieve noiseless rates within each epoch. In the second phase, after Re has\nshrunk enough, σn will become larger than (Re/n)\n1\n2k−1 and WIDEHIST will achieve noisy rates\nin these epochs.\nOne can verify, as before, that the second phase must occur, by design. Intuitively, the second\nphase must occur because we make a ﬁxed number of queries n/E ≍n/ log n in a halving\ndomain size (equivalently we make geometrically increasing queries on a rescaled domain), and\nso relatively in successive epochs this noiseless error shrinks, and at some point σn becomes larger\nthan this shrinking noiseless error rate.\nAs before we make the following claims:\n1. Before all e in phase one t ∈De w.h.p.\n2. Before all e in phase two t ∈De w.h.p.\nThese are proved in the Appendix by induction.\nThe ﬁnal point error is given by WIDEHIST in the last epoch as\nq\nRE\nσ2k−3\nn\nn/E ≍\n1\nσk−2\nn\nq\n1\nn since\nRE ≍σn and E ≍log n.\n5\nConclusion\nIn this paper, we propose a simple Berkson error model for one-dimensional threshold classiﬁ-\ncation, inspired by the setup and model analysed in Castro & Nowak (2007, 2008), in which we\ncan analyse active learning with additive uniform feature noise. To the best of our knowledge,\nthis is the ﬁrst attempt at jointly tackling feature noise and label noise in active learning.\nThis simple setting already yields interesting behaviour depending on the additive feature noise\nlevel and the label noise of the underlying regression function.\nFor both passive and active\nlearning, whenever the noise level is smaller than the minimax noiseless rate, the learner cannot\nnotice that there is noise, and will continue to achieve the noiseless rate.\nAs the noise gets\nlarger, the rates do depend on the noise level. Importantly, one can achieve better rates than\npassive learning in most scenarios, and we propose unique algorithms/estimators to achieve\ntight rates. The idea of “activizing” passive algorithms, like algorithm ACTPASS did, seems\nespecially powerful and could carry forward to other settings beyond our paper and Ramdas &\nSingh (2013).\nThe immediate future work and most direct extension to this paper concerns the main weakness\nof the paper - the possibility of getting rid of Assumption (M), which is the only hurdle to a\nfair comparision with the noiseless setting. We would like to re-emphasize that at ﬁrst glance,\nthe rates may be misleading and counterintuitive because it “appears” as if larger noise could\npossibly help estimation due to the presence of σn in the denominator for larger k.\nHowever, we point out once more that the class of functions is not constant over all σn - it\ndepends on σn, and in fact it gets “smaller” in some sense with larger σn because the assumption\n(M) becomes more stringent. This observation about the non-constant function class, along with\nthe fact that convolution with uniform noise seems to unﬂatten the regression function as shown\nin the ﬁgures, together cause the rates to seemingly improve with larger noise levels.\n14\nAnalysing the case without (M) seems to be quite a challenging task since the noiseless and\nconvolved thresholds can be diﬀerent - we did attempt to formulate a few kernel-based estimators\nwith additional assumptions, but do not presently have tight bounds, and leave those for a future\nwork.\nAcknowledgements\nWe thank Rui Castro for detailed conversations about our model and results.\nThis work is\nsupported in part by NSF Big Data grant IIS-1247658.\nReferences\nCarroll, Raymond J, Ruppert, David, Stefanski, Leonard A, and Crainiceanu, Ciprian M.\nMeasurement error in nonlinear models: a modern perspective, volume 105. Chapman and\nHall/CRC, 2010.\nCastro, R. and Nowak, R. Minimax bounds for active learning. IEEE Transactions on Informa-\ntion Theory, 54(5):2339–2353, 2008.\nCastro, Rui M. and Nowak, Robert D. Minimax bounds for active learning. In Proceedings of\nthe 20th annual conference on Learning theory, COLT’07, pp. 5–19, Berlin, Heidelberg, 2007.\nSpringer-Verlag.\nFan, Jianqing. On the optimal rates of convergence for nonparametric deconvolution problems.\nThe Annals of Statistics, pp. 1257–1272, 1991.\nFan, Jianqing, Truong, Young K, et al. Nonparametric regression with errors in variables. The\nAnnals of Statistics, 21(4):1900–1925, 1993.\nFuller, Wayne A. Measurement error models, volume 305. Wiley, 2009.\nIbargimov, I. A. and Hasminskii, R. Z. Statistical Estimation. Asymptotic Theory. Springer-\nVerlag, 1981.\nLoustau, S´ebastien and Marteau, Cl´ement. Discriminant analysis with errors in variables. arXiv\npreprint arXiv:1201.3283, 2012.\nRamdas, Aaditya and Singh, Aarti. Algorithmic connections between active learning and stochas-\ntic convex optimization. In Algorithmic Learning Theory, pp. 339–353. Springer, 2013.\nSteinwart, Ingo and Scovel, Clint. Fast rates to bayes for kernel machines. In Advances in neural\ninformation processing systems, pp. 1345–1352, 2004.\nTsybakov, A.B. Optimal aggregation of classiﬁers in statistical learning. The Annals of Statistics,\n32(1):135–166, 2004.\nTsybakov, Alexandre B. Introduction to Nonparametric Estimation. Springer Publishing Com-\npany, Incorporated, 1st edition, 2009. ISBN 0387790519, 9780387790510.\n15\nA\nJustifying Claims in the Lower Bounds\nApproximations:\n1. (x + y)k = xk(1 + y/x)k ≈xk + kxk−1y when y ≺x. Even when y ⪯x, both terms are the\nsame order.\n2. (x −y)k = xk(1 −y/x)k ≈xk −kxk−1y when y ≺x. Even when y ⪯x both terms are the\nsame order.\n3. When y < x but not y ≺x, by Taylor expansion of (1 + z)k around z = 0, we have\n(x + y)k = xk(1 + y/x)k = xk[1 + (1 + c)k−1y/x] = xk + Cxk−1y for some 0 < c < y/x < 1\nand some constant C. Similarly for (x −y)k.\nLet’s assume the boundary is at −σ for easier calculations. (we denote an, σn as a, σ here).\nRemember\nm1(x) = 1/2 + cx|x|k−2 if x ≥−σ\nm2(x) =\n(\n1/2 + c(x −a)|x −a|k−2\nif x < βa + σ\nm1(x)\nif x ≥βa + σ\nwhere β =\n1\n1−(c/C)1/(k−1) ≥1 is such that m2 ∈P(κ, c, C, σ). Clearly, when x < βa + σ, m2\nsatisﬁes condition (T). So, we only need to verify that whenever x ≥βa + σ we have\nm2(x) −1/2 = cxk−1\n≤\nC(x −a)k−1\n(12)\nThis statement holds iﬀ\n(c/C)1/(k−1) ≤1−a/x ⇔a/x ≤1−(c/C)1/(k−1) ⇔x ≥βa, which\nholds for all σ ≥0, and hence m2 satisﬁes condition (T).\nProposition 1. When σ ≺a, maxw |F1(w) −F2(w)| ≍ak−1\nProposition 2. When σ ≻a maxw |F1(w) −F2(w)| ≍σk−2a\nLet us now prove these two propositions, with detailed calculations in each case (note that when\nσ ≍a, then maxw |F1(w)−F2(w)| ≍ak−1 ≍σk−2a, and can be checked using our approximations\n1,2,3).\n1. When σ ≺a, we will prove proposition 1. Remember that we can’t query in −σ ≤w ≤0.\n(a) When 0 ≤w ≤σ, we have\nF1(w) = (m1 ⋆U)(w)\n=\nZ 0\nw−σ\n(1/2 −cx|x|k−2)dx/2σ +\nZ w+σ\n0\n(1/2 + cxk−1)dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ)k −(σ −w)k]\n=\n1/2 +\nc\n2σk σk[(1 + w/σ)k −(1 −w/σ)k]\n≈\n1/2 + cσk−2w\nF2(w) = (m2 ⋆U)(w)\n=\nZ w+σ\nw−σ\n(1/2 −c(x −a)|x −a|k−2)dx/2σ\n=\n1/2 −\nc\n2σk [(a −w −σ)k −(a + σ −w)k]\n≈\n1/2 −c(a −w)k−1\n16\n[Boundaries: F1(0)−1\n2 = 0, F1(σ)−1\n2 ≍σk−1, F2(0)−1\n2 ≍−ak−1, F2(σ)−1\n2 ≍−ak−1].\nF1(w) −F2(w)\n⪯\nak−1\n(b) When σ ≤w ≤a −σ\nF1(w) = (m1 ⋆U)(w)\n=\nZ w+σ\nw−σ\n(1/2 + cxk−1)dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ)k −(w −σ)k]\n≈\n1/2 + cwk−1\nF2(w) = (m2 ⋆U)(w)\n=\nZ w+σ\nw−σ\n(1/2 −c(x −a)|x −a|k−2)dx/2σ\n=\n1/2 −\nc\n2σk [(a −w −σ)k −(a + σ −w)k]\n≈\n1/2 −c(a −w)k−1\n[Boundaries: F1(σ)−1\n2 ≍σk−1, F1(a−σ)−1\n2 ≍ak−1, F2(σ)−1\n2 ≍−ak−1, F2(a−σ)−\n1\n2 ≍−σk−1].\nF1(w) −F2(w)\n=\ncwk−1 + c(a −w)k−1\n≤\nc(a −σ)k−1 + c(a −σ)k−1\n⪯\nak−1\n(c) When a −σ ≤w ≤a\nF1(w)\n≈\n1/2 + cwk−1\nF2(w)\n=\nZ a\nw−σ\n(1/2 −c(x −a)|x −a|k−2)dx/2σ +\nZ w+σ\na\n1/2 + c(x −a)k−1dx/2σ\n=\n1/2 −\nc\n2σk [(a −w + σ)k −(w + σ −a)k]\n≈\n1/2 −cσk−2(a −w)\n[Boundaries: F1(a−σ) −1\n2 ≍ak−1, F1(a) −1\n2 ≍ak−1, F2(a−σ) −1\n2 ≍−σk−1, F2(a) −\n1\n2 = 0]\nF1(w) −F2(w)\n≈\ncwk−1 + cσk−2(a −w)\n≤\ncak−1 + cσk−2σ\n⪯\nak−1\n(d) When a ≤w ≤a + σ\nF1(w)\n≈\n1/2 + cwk−1\nF2(w)\n≈\n1/2 + cσk−2(a −w)\n[Boundaries: F1(a) −1\n2 ≍ak−1, F1(a + σ) −1\n2 ≍ak−1, F2(a) −1\n2 = 0, F2(a + σ) −1\n2 ≍\nσk−1]\nF1(w) −F2(w) ⪯ak−1\n17\n(e) When a + σ ≤w ≤βa −σ\nF1(w)\n≈\n1/2 + cwk−1\nF2(w)\n=\nZ w+σ\nw−σ\n1/2 + c(x −a)k−1dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ −a)k −(w −σ −a)k]\n≈\n1/2 + c(w −a)k−1\n[B: F1(a+σ)−1\n2 ≍ak−1, F1(βa−σ)−1\n2 ≍ak−1, F2(a+σ)−1\n2 ≍σk−1, F2(βa−σ)−1\n2 ≍\nak−1]\nF1(w) −F2(w)\n≈\ncwk−1 −c(w −a)k−1\n≤\nc(βa −σ)k−1 + cσk−1\n≤\nc(βk−1 + 1)ak−1\n⪯\nak−1\n(f) When βa −σ ≤w ≤βa + σ\nF1(w)\n≈\n1/2 + cwk−1\nF2(w)\n=\nZ βa\nw−σ\n1/2 + c(x −a)k−1dx/2σ +\nZ w+σ\nβa\n1/2 + xk−1dx/2σ\n=\n1/2 +\nc\n2σk [(βa −a)k −(w −σ −a)k + (w + σ)k −(βa)k]\n[F1(βa−σ)−1\n2 ≍ak−1, F1(βa+σ)−1\n2 ≍ak−1, F2(βa−σ)−1\n2 ≍ak−1, F2(βa+σ)−1\n2 ≍\nak−1]\nF1(w) −F2(w)\n=\ncwk−1 +\nc\n2σk [(βk −(β −1)k)ak + (w −σ −a)k −(w −σ)k]\n≤\nc(β + 1)k−1ak−1 +\nc\n2σk [(βa)k −(βa −2σ)k] −\nc\n2σk [(β −1)kak −((β −1)a −σ)k]\n≈\nc(β + 1)k−1ak−1 +\nc\n2σk [k(βa)k−12σ] −\nc\n2σk [k(β −1)k−1ak−1σ]\n=\ncak−1[(β + 1)k−1 + βk−1 −1\n2(β −1)k−1]\n≍\nak−1\n(g) When βa + σ ≤w ≤βa + 2σ\nF1(w)\n=\n1/2 +\nc\n2σk [(w + σ)k −(w −σ)k]\nF2(w)\n=\nZ βa+σ\nw−σ\n1/2 + c(x −a)k−1dx/2σ +\nZ w+σ\nβa+σ\n1/2 + cxk−1dx/2σ\n=\n1/2 +\nc\n2σk [(βa + σ −a)k −(w −σ −a)k + (w + σ)k −(βa + σ)k]\n18\n[F1(βa+σ)−1\n2 ≍ak−1, F1(βa+2σ)−1\n2 ≍ak−1, F2(βa+σ)−1\n2 ≍ak−1, F2(βa+2σ)−1\n2 ≍\nak−1]\nF1(w) −F2(w)\n=\nc\n2σk [(βa + σ)k −(βa + σ −a)k + (w −σ −a)k −(w −σ)k]\n≈\nc\n2σk [(βa + σ)k−1ka −(w −σ)k−1ka]\n≤\nca\n2σ [(βa + σ)k−1 −(βa)k−1]\n≈\nca\n2σ [(βa)k−1(1 + (k −1)σ\nβa\n) −(βa)k−1]\n=\nak−1[cβk−2(k −1)/2]\n≍\nak−1\n(h) When w ≥βa + 2σ\nF1(w) = F2(w)\nThat completes the proof of the ﬁrst claim.\n2. When σ ≻a, we will prove the second proposition.\n(a) When −σ ≤w ≤0, we are not allowed to query here.\n(b) When 0 < w ≤βa\nF1(w) = (m1 ⋆U)(w)\n=\nZ 0\nw−σ\n(1/2 −cx|x|k−2)dx/2σ +\nZ w+σ\n0\n(1/2 + cxk−1)dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ)k −(σ −w)k]\n=\n1/2 +\nc\n2σk σk[(1 + w/σ)k −(1 −w/σ)k]\n≈\n1/2 + cσk−2w\nSimilarly F2(w) ≈1/2 + cσk−2(w −a)\n[Boundaries: F1(0)−1\n2 = 0, F1(βa)−1\n2 ≍σk−2a, F2(0)−1\n2 ≍−σk−2a, F2(βa) ≍σk−2a]\nF1(w) −F2(w) ≍σk−2\nn\na.\n(c) When βa ≤w ≤σ\nF1(w) =\n=\nZ 0\nw−σ\n(1/2 −cx|x|k−2)dx/2σ +\nZ w+σ\n0\n(1/2 + cxk−1)dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ)k −(σ −w)k]\n=\n1/2 +\nc\n2σk σk[(1 + w/σ)k −(1 −w/σ)k]\n≈\n1/2 + cσk−2w\n19\nF2(w)\n=\nZ a\nw−σ\n(1/2 −c(x −a)|x −a|k−2)dx\n2σ +\nZ βa+σ\na\n(1/2 + c(x −a)k−1)dx\n2σ +\nZ w+σ\nβa+σ\n1/2 + cxk−1 dx\n2σ\n=\n1/2 +\nc\n2σk [−(σ + a −w)k + (βa + σ −a)k + (w + σ)k −(βa + σ)k]\n≈\n1/2 +\nc\n2σk [−σk(1 −k(w −a)\nσ\n) + σk(1 + k(β −1)a\nσ\n) + σk(1 + kw\nσ ) −σk(1 + kβa\nσ )]\n=\n1/2 + c\n2σk−2[w −a + (β −1)a + w −βa]\n=\n1/2 + cσk−2(w −a)\n[Boundaries: F1(βa) −1\n2 ≍σk−2a, F1(σ) −1\n2 ≍σk−1, F2(βa) ≍σk−2a, F2(σ) −1\n2 ≍\n−σk−2a]\nF1(w) −F2(w) ≍σk−2a\nSpeciﬁcally, verify the boundary at σ\nF1(σ) −F2(σ)\n=\nc\n2σk [ak −(βa + σ −a)k + (βa + σ)k]\n=\nc\n2σk [ak −σk(1 + k βa −a\nσ\n) + σk(1 + k βa\nσ )]\n=\nc\n2σk [ak + kσk−1a]\n≤\ncσk−2a\n(d) When σ ≤w ≤a + σ\nF1(w)\n=\nZ w+σ\nw−σ\n(1/2 + cxk−1)dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ)k −(w −σ)k]\nF2(w)\n=\nZ a\nw−σ\n(1/2 −c(x −a)|x −a|k−2)dx\n2σ +\nZ βa+σ\na\n(1/2 + c(x −a)k−1)dx\n2σ +\nZ w+σ\nβa+σ\n1/2 + cxk−1 dx\n2σ\n=\n1/2 +\nc\n2σk [−(σ + a −w)k + (βa + σ −a)k + (w + σ)k −(βa + σ)k]\nF1(w) −F2(w)\n=\nc\n2σk [(σ + a −w)k −(βa + σ −a)k −(w −σ)k + (βa + σ)k]\nDiﬀerentiating the above term with respect to w, gives\nc\n2σ[−(σ + a −w)k−1 −(w −\nσ)k−1] ≤0 because σ ≤w ≤a + σ and hence F1(w) −F2(w) is decreasing with w. We\nalready saw F1(σ) −F2(σ) ≤cσk−2a. We can also verify that at the other boundary,\nF1(a + σ) −F2(a + σ)\n=\nc\n2σk [−(βa + σ −a)k −ak + (βa + σ)k]\n=\nc\n2σk [−ak −σk(1 + k βa −a\nσ\n) + σk(1 + k βa\nσ )]\n=\nc\n2σk [−ak + kσk−1a]\n≤\nc\n2σk−2a\n20\n(e) When σ + a ≤w ≤βa + σ\nF1(w)\n=\nZ w+σ\nw−σ\n(1/2 + cxk−1)dx/2σ\n=\n1/2 +\nc\n2σk [(w + σ)k −(w −σ)k]\nF2(w)\n=\nZ βa+σ\nw−σ\n(1/2 + c(x −a)k−1)dx\n2σ +\nZ w+σ\nβa+σ\n1/2 + cxk−1 dx\n2σ\n=\n1/2 +\nc\n2σk [(βa + σ −a)k −(w −σ −a)k + (w + σ)k −(βa + σ)k]\nF1(w) −F2(w)\n=\nc\n2σk [(w −σ −a)k −(βa + σ −a)k −(w −σ)k + (βa + σ)k]\nDiﬀerentiating with respect to w gives\nc\n2σ[(w −σ −a)k−1 −(w −σ)k−1] ≤0 because\nw−σ−a ≤w−σ and so F1−F2 is decreasing with w. We know F1(a+σ)−F2(a+σ) ≤\nc\n2σk−2a, and we can verify at the other boundary that\nF1(βa + σ) −F2(βa + σ)\n=\nc\n2σk [(βa −a)k −(βa + σ −a)k −(βa)k + (βa + σ)k]\n≈\nc\n2σk [(βa −a)k −(βa)k −σk(1 + k βa −a\nσ\n) + σk(1 + k βa\nσ )]\n=\nc\n2σk [(βa −a)k −(βa)k + kσk−1a]\n≤\nc\n2σk−2a\n(f) When βa + σ ≤w ≤βa + 2σ\nF1(w) = 1/2 +\nc\n2σk [(w + σ)k −(w −σ)k]\nF2(w)\n=\nZ βa+σ\nw−σ\n1/2 + c(x −a)k−1dx/2σ +\nZ w+σ\nβa+σ\n1/2 + cxk−1dx/2σ\n=\n1/2 +\nc\n2kσ [(βa + σ −a)k −(w −σ −a)k + (w + σ)k −(βa + σ)k]\nHence\nF1(w) −F2(w)\n=\nc\n2σk [(βa + σ)k −(βa + σ −a)k + (w −σ −a)k −(w −σ)k]\n≈\nc\n2σk [(βa + σ)k−1ka −(w −σ)k−1ka]\n≤\nca\n2σ [(βa + σ)k−1 −(βa)k−1]\n≈\nc/2σk−2a\n≍\nσk−2a\n21\nAlternately, by the same argument as in the previous case, diﬀerentiating with respect\nto w gives\nc\n2σ[(w −σ −a)k−1 −(w −σ)k−1] ≤0 because w −σ −a ≤w −σ and so\nF1 −F2 is decreasing with w. We know F1(βa + σ) −F2(βa + σ) ≤c\n2σk−2a, and we\ncan verify at the other endpoint that\nF1(βa + 2σ) −F2(βa + 2σ)\n=\n0\n(g) When w ≥βa + 2σ, F1(w) = F2(w)\nThat completes the proof of the second proposition.\nB\nConvolved Regression Function, Justifying Eqs.(8-11)\nFor ease of presentation, let us assume the threshold is at 0, and deﬁne m ∈P(c, C, k, σ) as\nm(x) =\n(\n1/2 + f(x) + ∆(x) if x ≥0\n1/2 −f(x) if x < 0\nDue to assumption (M), ∆(x) must be 0 when 0 ≤x ≤σ. Hence, the Taylor expansion of ∆(x)\naround x = σ looks like\n∆(x) = (x −σ)∆′(σ) + (x −σ)2∆′′(σ) + ...\nIf one represents, as before, F(x) = m ⋆U, then directly from the deﬁnitions, it follows for δ > 0\nthat\nF(δ) −F(0) =\nZ σ+δ\nσ\n(1/2 + f(z) + ∆(z)) dz\n2σ −\nZ −σ+δ\n−σ\n(1/2 −f(z)) dz\n2σ\nIn particular, due to the form (T) of m, let f = c1|x|k−1 for some c ≤c1 ≤C (we could also\nbreak f into parts where it has diﬀerent c1s but this is a technicality and does not change the\nbehaviour). Then\nF(δ) −F(0)\n=\nc1\n2kσ [(xk)σ+δ\nσ\n−(xk)−σ+δ\n−σ\n] +\nZ δ+σ\nσ\n[(z −σ)∆′(σ) + (z −σ)2∆′′(σ) + ...] dz\n2σ\n=\nc1\n2kσ [(σ + δ)k −σk + (−σ + δ)k −(−σ)k] + [(z −σ)2]σ+δ\nσ\n4σ\n∆′(σ) + ...\n≈\nc1σk−2δ + δ2\n4σ ∆′(σ) + o(δ2)\nThus we get behaviour of the form\nF(t + h) ≥1/2 + cσk−2h\nOne can derive similar results when δ < 0.\nThe claims about WIDEHIST immediately follow from the above, but we can make them a little\nmore explicit. First note that F(w) = 1/2+ c\nσn (w−t) for w close to t (in fact for w ∈[t−σ, t+σ]),\nas seen in Section 1 of this Appendix. Consider a bin just outside the bins i∗−1, i∗, i∗+ 1, for\n22\ninstance bin i = i∗+ 2 centered at bi (note bi ≥t + h), and let J be the set of points j that fall\nwithin bi ± σ/2. Deﬁne\nbpi =\n1\nnσ/2R\nX\nj∈J\nI(Yj = +)\nwhere Yj ∈{±1} are observations at points j ∈J. Now, we have, since P(Yj = +) = F(j)\nE[bpi]\n=\n1\nnσ/2R\nX\nj∈J\nF(j)\n=\n1\nnσ/2R\n\nX\nj∈J\n1/2 +\nc\nσn (Xj −t)\n\n\n≈\n1/2 + 1\nσ\nZ bi−t+σ/2\nbi−t−σ/2\nc\nσn zdz\n=\n1/2 +\nc\n2σ2\n\u0002\n(bi −t + σ/2)2 −(bi −t −σ/2)2\u0003\n=\n1/2 +\nc\nσn (bi −t)\n≥\n1/2 +\nc\nσn h\nC\nJustifying Claims in the Active Upper Bounds\nPhase 1 (k = 1). In the ﬁrst phase of the algorithm, it is possible that σ ⪯Re/n but ⪰Ree−n\n- in other words the noise may be small enough that passive learning cannot make out that we\nare in the errors-in-variables setting, and then the passive estimator will get a point error of C1Re\nn/E\nin each of those epochs (as if there is no feature noise). This point error is to the best point in\nepoch e, which we can prove by induction is the true threshold t with high probability. Since\nit trivially holds in the ﬁrst epoch (t ∈D1 = [−1, 1]), we assume that it is true in epoch e −1.\nThen, in epoch e, the true threshold t is still the best point if the estimator xe−1 of epoch e −1\nwas within Re of t, or in other words if |xe−1−t| ≤Re. This would deﬁnitely hold if C1Re−1\nn/E\n≤Re\ni.e. n ≥2C1E = 2C1⌈log(1/σ)⌉, which is true since σ ≻exp{−n/2C1}. However, the algorithm\ncannot stay in this phase of σ ⪯Re/n this until the last epoch since σ > RE+1 = RE/2.\nPhase 2 (k = 1). When σ ⪰Re/n, WIDEHIST gets an estimation error of C2\nq\nReσ\nn/E in epoch\ne. This error is the distance to the best point in epoch e, which is t by the following similar\ninduction. In epoch e, t is still the best point only if |xe−1 −t| ≤Re, i.e. C2\n2\nRe−1σ\nn/E\n≤R2\ne i.e.\nnRe ≥2C2\n2Eσ which holds since Re > σ for all e ≤E and since n ≥2C2\n2E (σ ≻exp{−n/2C2\n2}\nimplies E ≤n/2C2\n2).\nThe ﬁnal error of the algorithm is is\nq\nREσ\nn/E = ˜O( σ\n√n) since RE < 2σ.\nExplanation for k > 1\nAssume σ ≻n−\n1\n2k−2 , otherwise active learning won’t notice the feature\nnoise, and so log(1/σ) ≤\nlog n\n(2k−2). Choose total epochs E = ⌈log( 1\nσ)⌉≤\nlog n\n(2k−2) ≤C log n for some\nC. In each epoch of length n/E in a region of radius Re = 2−e+1, we get a passive bound of\nC1\nq\nRe\nσ2k−3n/E whenever σ > ( Re\nn )\n1\n2k−1 . (This must happen at some e ≤E = ⌈log( 1\nσ)⌉because\nRE = 2−E+1 < 2σ < σσ2k−2n since σ ≻n−\n1\n2k−2 and hence in the last epoch σ > ( RE\nn )\n1\n2k−1 .)\n23\nBy the same logic as for k = 1, we need to verify that |xe−1 −t| ≤Re so that if t was in the\nsearch space in epoch e −1 then it remains the in the search space in epoch e, i.e. we want to\nverify C2\n1\nRe−1\nσ2k−3n/E ≤R2\ne ⇔σ2k−2Re ≥2C2\n1E\nn\nσ which is true since Re ≥σ and σ2k−2 > 2C2\n1E/n .\n(By choice of E = ⌈log( 1\nσ)⌉, Re ≥RE ≥σ ≥RE+1 . Since σ ≻n−\n1\n2k−2 we get σ2k−2 > 2C2\n1E/n\nsince E ≤C log n .)\nThe ﬁnal point error is given by the passive algorithm in the last epoch as\nq\nRE\nσ2k−3n/E ; since\nRE < 2σ and E ≤C log n, this becomes ⪯\n1\nσk−2\nq\n1\nn .\n24\n"}