{"text": "arXiv:1508.05994v2  [math.ST]  29 Jan 2016\nImproved estimation in a general multivariate elliptical model\nTatiane F. N. Melo\nInstitute of Mathematics and Statistics, Federal University of Goi´as, Brazil\nemail: tmelo@ufg.br\nSilvia L. P. Ferrari\nDepartment of Statistics, University of S˜ao Paulo, Brazil\nemail: silviaferrari@usp.br\nAlexandre G. Patriota\nDepartment of Statistics, University of S˜ao Paulo, Brazil\nemail: patriota@ime.usp.br\nAbstract\nThe problem of reducing the bias of maximum likelihood estimator in a general multivariate elliptical regression\nmodel is considered. The model is very ﬂexible and allows the mean vector and the dispersion matrix to have parame-\nters in common. Many frequently used models are special cases of this general formulation, namely: errors-in-variables\nmodels, nonlinear mixed-effects models, heteroscedastic nonlinear models, among others. In any of these models, the\nvector of the errors may have any multivariate elliptical distribution. We obtain the second-order bias of the maximum\nlikelihood estimator, a bias-corrected estimator, and a bias-reduced estimator. Simulation results indicate the effective-\nness of the bias correction and bias reduction schemes.\nKeywords: Bias correction; bias reduction; elliptical model; maximum likelihood estimation; general parameteri-\nzation.\n1\nIntroduction\nIt is well known that, under some standard regularity conditions, maximum-likelihood estimators (MLEs) are consistent\nand asymptotically normally distributed. Hence, their biases converge to zero when the sample size increases. However,\nfor ﬁnite sample sizes, the MLEs are in general biased and bias correction plays an important role in the point estimation\ntheory.\nA general expression for the term of order O(n−1) in the expansion of the bias of MLEs was given by Cox and\nSnell (1968). This term is often called second-order bias and can be useful in actual problems. For instance, a very high\nsecond-order bias indicates that other than maximum-likelihood estimation procedures should be used. Also, corrected\nestimators can be formulated by subtracting the estimated second-order biases from the respective MLEs. It is expected\nthat these corrected estimators have smaller biases than the uncorrected ones, especially in small samples.\n1\nCox and Snell’s formulae for second-order biases of MLEs were applied in many models. Cordeiro and McCullagh\n(1991) use these formulae in generalized linear models; Cordeiro and Klein (1994) compute them for ARMA models;\nCordeiro et al. (2000) apply them for symmetric nonlinear regression models; Vasconcellos and Cordeiro (2000) obtain\nthem for multivariate nonlinear Student t regression models. More recently, Cysneiros et al. (2010) study the univariate\nheteroscedastic symmetric nonlinear regression models (which are an extension of Cordeiro et al. 2000) and Patriota\nand Lemonte (2009) obtain a general matrix formula for the bias correction in a multivariate normal model where the\nmean and the covariance matrix have parameters in common.\nAn alternative approach to bias correction was suggested by Firth (1993). The idea is to adjust the estimating function\nso that the estimate becomes less biased. This approach can be viewed as a “preventive” method, since it modiﬁes the\noriginal score function, prior to obtaining the parameter estimates. In this paper, estimates obtained from Cox and\nSnell’s approach and Firth’s method will be called bias-corrected estimates and bias-reduced estimates, respectively.\nFirth showed that in generalized linear models with canonical link function the preventive method is equivalent to\nmaximizing a penalized likelihood that is easily implemented via an iterative adjustment of the data. The bias reduction\nproposed by Firth has received considerable attention in the statistical literature. For models for binary data, see Mehrabi\nand Matthews (1995); for censored data with exponential lifetimes, see Pettitt et al. (1998). In Bull et al. (2002) bias\nreduction is obtained for the multinomial logistic regression model. In Kosmidis and Firth (2009) a family of bias-\nreducing adjustments was developed for a general class of univariate and multivariate generalized nonlinear models. The\nbias reduction in cumulative link models for ordinal data was studied in Kosmidis (2014). Additionally, Kosmidis and\nFirth (2011) showed how to obtain the bias-reducing penalized maximum likelihood estimator by using the equivalent\nPoisson log-linear model for the parameters of a multinomial logistic regression.\nIt is well-known and was noted by Firth (1993) and Kosmidis and Firth (2009) that the reduction in bias may\nsometimes be accompanied by inﬂation of variance, possibly yielding an estimator whose mean squared error is bigger\nthan that of the original one. Nevertheless, published empirical studies such as those mentioned above show that, in some\nfrequently used models, bias-reduced and bias-corrected estimators can perform better than the unadjusted maximum\nlikelihood estimators, especially when the sample size is small.\nOur goal in this paper is to obtain bias correction and bias reduction to the maximum likelihood estimators for\nthe general multivariate elliptical model. We extend the work of Patriota and Lemonte (2009) to the elliptical class of\ndistributions deﬁned in Lemonte and Patriota (2011). We focus on analytical methods only, because simulations for a\ngeneral multivariate normal model suggests that analytical bias corrections outperforms the computationally intensive\nbootstrap methods (Lemonte, 2011).\nIn order to illustrate the ampleness of the general multivariate elliptical model, we mention some of its submodels:\nmultiple linear regression, heteroscedastic multivariate nonlinear regressions, nonlinear mixed-effects models (Patriota\n2011), heteroscedastic errors-in-variables models (Patriota et al. 2009a,b), structural equation models, multivariate\nnormal regression model with general parametrization (Lemonte, 2011), simultaneous equation models and mixtures of\nthem. It is important to note that the usual normality assumption of the error is relaxed and replaced by the assumption of\nelliptical errors. The elliptical family of distributions includes many important distributions such as multivariate normal,\nStudent t, power exponential, contaminated normal, Pearson II, Pearson VII, and logistic, with heavier or lighter tails\nthan the normal distribution; see Fang et al. (1990).\nThe paper is organized as follows. Section 2 presents the notation and general results for bias correction and bias\nreduction. Section 3 presents the model and our main results, namely the general expression for the second-order bias\nof MLEs, in the general multivariate elliptical model. Section 4 applies our results in four important special cases:\nheteroscedastic nonlinear (linear) model, nonlinear mixed-effects models, multivariate errors-in-variables models and\nlog-symmetric regression models. Simulations are presented in Section 5. Applications that use real data are presented\n2\nand discussed in Section 6. Finally, Section 7 concludes the paper. Technical details are collected in one appendix.\n2\nBias correction and bias reduction\nLet θ be the p-vector of unknown parameters and θr its rth element. Also, let U(θ) be the score function and Ur(θ) = Ur\nits rth element. We use the following tensor notation for the cumulants of the log-likelihood derivatives introduced by\nLawley (1956):\nκrs = E\n\u0012∂Ur\n∂θs\n\u0013\n,\nκr,s = E(UrUs),\nκrs,t = E\n\u0012∂Ur\n∂θs\nUt\n\u0013\n,\nκrst = E\n\u0012 ∂2Ur\n∂θs∂θt\n\u0013\n,\nκ(t)\nrs = ∂κrs\n∂θt\n,\nκr,s,t = E(UrUsUt),\nand so on. The indices r, s and t vary from 1 to p. The typical (r, s)th element of the Fisher information matrix\nK(θ) is κr,s and we denote by κr,s the corresponding element of K(θ)−1. All κ’s refer to a total over the sample and\nare, in general, of order n. Under standard regular conditions, we have that κrs = −κr,s, κrs,t = κ(t)\nrs −κrst and\nκr,s,t = 2κrst −κ(t)\nrs −κ(s)\nrt −κ(r)\nst . These identities will be used to facilitate some algebraic operations.\nLet Bbθ(θ) be the second-order bias vector of bθ whose jth element is Bbθj(θ), j = 1, 2, . . . , p. It follows from the\ngeneral expression for the multiparameter second-order biases of MLEs given by Cox and Snell (1968) that\nBbθj(θ) =\np\nX\nr,s,t=1\nκj,rκs,t\n\u001a1\n2κrst + κrs,t\n\u001b\n.\n(1)\nThe bias corrected MLE is deﬁned as\nbθBC = bθ −Bbθ(bθ).\nThe bias-corrected estimator bθBC is expected to have smaller bias than the uncorrected estimator, bθ.\nFirth (1993) proposed an alternative method to partially remove the bias of MLEs. The method replaces the score\nfunction by its modiﬁed version\nU ∗(θ) = U(θ) −K(θ)Bbθ(θ),\nand a modiﬁed estimate, bθBR, is given as a solution to U ∗(θ) = 0. It is noticeable that, unlike Cox and Snell’s approach,\nFirth’s bias reduction method does not depend on the ﬁniteness of bθ.\n3\nModel and main results\nWe shall follow the same notation presented in Lemonte and Patriota (2011). The elliptical model as deﬁned in Fang et\nal. (1990) follows. A q × 1 random vector Y has a multivariate elliptical distribution with location parameter µ and a\ndeﬁnite positive scale matrix Σ if its density function is\nfY (y) = |Σ|−1/2g\n\u0000(y −µ)⊤Σ−1(y −µ)\n\u0001\n,\n(2)\n3\nTable 1: Generating functions of some multivariate elliptical distributions.\nDistribution\nGenerating function g(u)\nnormal\n1\n(\n√\n2π)q e−u/2\nCauchy\nΓ( 1+q\n2 )\nΓ( 1\n2) π−q/2(1 + u)−(1+q)/2\nStudent t\nΓ( ν+q\n2 )\nΓ( ν\n2 ) π−q/2ν−q/2 \u00001 + u\nν\n\u0001−(ν+q)/2, ν > 0\npower exponential\nλΓ( q\n2)\nΓ( q\n2λ)2−q/(2λ)π−q/2e−uλ/2, λ > 0\nwhere g : [0, ∞) →(0, ∞) is called the density generating function, and it is such that\nR ∞\n0\nu\nq\n2 −1g(u)du < ∞. We will\ndenote Y ∼Elq(µ, Σ, g) ≡Elq(µ, Σ). It is possible to show that the characteristic function is ψ(t) = E(exp(it⊤Y )) =\nexp(it⊤µ)ϕ(t⊤Σt), where t ∈Rq and ϕ : [0, ∞) →R. Then, if ϕ is twice differentiable at zero, we have that E(Y ) = µ\nand Var(Y ) = ξΣ, where ξ = ϕ′(0). We assume that the density generating function g does not have any unknown\nparameter, which implies that ξ is a known constant. From (2), when µ = 0 and Σ = Iq, where Iq is a q × q identity\nmatrix, we obtain the spherical family of densities. A comprehensive exposition of the elliptical multivariate class of\ndistributions can be found in Fang et al. (1990). Table 1 presents the density generating functions of some multivariate\nelliptical distributions.\nLet Y1, Y2, ..., Yn be n independent random vectors, where Yi has dimension qi ∈N, for i = 1, 2, ..., n. The general\nmultivariate elliptical model (Lemonte and Patriota 2011) assumes that\nYi = µi(θ, xi) + ei,\ni = 1, . . . , n,\nwith ei\nind\n∼Elqi(0, Σi(θ, wi)), where “\nind\n∼” means “independently distributed as”, xi and wi are mi × 1 and ki × 1\nnonstochastic vectors of auxiliary variables, respectively, associated with the ith observed response Yi, which may have\ncomponents in common. Then,\nYi\nind\n∼Elqi(µi, Σi),\ni = 1, . . . , n,\n(3)\nwhere µi = µi(θ, xi) is the location parameter and Σi = Σi(θ, wi) is the deﬁnite positive scale matrix. Both µi and Σi\nhave known functional forms and are twice differentiable with respect to each element of θ. Additionally, θ is a p-vector\nof unknown parameters (where p < n and it is ﬁxed). Since θ must be identiﬁable in model (3), the functions µi and Σi\nmust be deﬁned to accomplish such restriction.\nSeveral important statistical models are special cases of the general formulation (3), for example, linear and nonlinear\nregression models, homoscedastic or heteroscedastic measurement error models, and mixed-effects models with normal\nerrors. It is noteworthy that the normality assumption for the errors may be relaxed and replaced by any distribution\nwithin the class of elliptical distributions, such as the Student t and the power exponential distributions. The general\n4\nformulation allows a wide range of different speciﬁcations for the location and the scale parameters, coupled with a large\ncollection of distributions for the errors. Section 4 presents four important particular cases of the main model (3) that\nshow the applicability of the general formulation.\nFor the sake of simplifying the notation, let zi = Yi −µi and ui = z⊤\ni Σ−1\ni zi. The log-likelihood function associated\nwith (3), is given by\nℓ(θ) =\nn\nX\ni=1\nℓi(θ),\n(4)\nwhere ℓi(θ) = −1\n2 log |Σi| + log g(ui). It is assumed that g(·), µi and Σi are such that ℓ(θ) is a regular log-likelihood\nfunction (Cox and Hinkley 1974, Ch. 9) with respect to θ. To obtain the score function and the Fisher information matrix,\nwe need to derive ℓ(θ) with respect to the unknown parameters and to compute some moments of such derivatives. We\nassume that such derivatives exist. Thus, we deﬁne\nai(r) = ∂µi\n∂θr\n,\nai(sr) =\n∂2µi\n∂θs∂θr\n,\nCi(r) = ∂Σi\n∂θr\n,\nCi(sr) =\n∂2Σi\n∂θs∂θr\nand\nAi(r) = −Σ−1\ni Ci(r)Σ−1\ni ,\nfor r, s = 1, . . . , p. We make use of matrix differentiation methods (Magnus and Neudecker 2007) to compute the\nderivatives of the log-likelihood function. The score vector and the Fisher information matrix for θ can be shortly\nwritten as\nU(θ) = F ⊤Hs\nand\nK(θ) = F ⊤eHF,\n(5)\nrespectively, with F =\n\u0000F ⊤\n1 , . . . , F ⊤\nn\n\u0001⊤, H = block-diag{H1, . . . , Hn}, s = (s⊤\n1 , . . . , s⊤\nn )⊤, eH = HMH and\nM = block-diag\n\b\nM ⊤\n1 , . . . , M ⊤\nn\n\t\n, wherein\nFi =\n\u0012\nDi\nVi\n\u0013\n,\nHi =\n\u0014\nΣi\n0\n0\n2Σi ⊗Σi\n\u0015−1\n,\nsi =\n\u0014\nvizi\n−vec(Σi −viziz⊤\ni )\n\u0015\n,\nwhere the “vec” operator transforms a matrix into a vector by stacking the columns of the matrix, Di = (ai(1), . . . , ai(p)),\nVi = (vec(Ci(1)), . . . , vec(Ci(p))), vi = −2Wg(ui) and Wg(u) = d log g(u)/du. Here, we assume that F has rank p\n(i.e., µi and Σi must be deﬁned to hold such condition). The symbol “⊗” indicates the Kronecker product. Following\nLange et al. (1989) we have, for the q-variate Student t distribution with ν degrees of freedom, tq(µ, Σ, ν), that Wg(u) =\n−(ν + q)/{2(ν + u)}. Following G´omez et al. (1998) we have, for the q-variate power exponential PEq(µ, δ, λ) with\nshape parameter λ > 0 and u ̸= 0, that Wg(u) = −λuλ−1/2, λ ̸= 1/2. In addition, we have\nMi =\n\"\n4ψi(2,1)\nqi\nΣi\n0\n0\n2ciΣi ⊗Σi\n#\n+ (ci −1)\n\u00140\n0\n0\nvec(Σi)vec(Σi)⊤\n\u0015\n,\nwhere\nci\n=\n4ψi(2,2)/{qi(qi\n+\n2)},\nψi(2,1)\n=\nE(W 2\ng (ri)ri)\nand\nψi(2,2)\n=\nE(W 2\ng (ri)r2\ni ), with ri = ||Li||2, Li ∼Elqi(0, Iqi). Here, we assume that g(u) is such that ψi(2,1) and ψi(2,2) ex-\nist and are ﬁnite for all i = 1, . . . , n. One can verify these results by using standard differentiation techniques and some\nstandard matrix operations.\nThe values of ψi(l,k) are obtained from solving the following one-dimensional integrals (Lange et al. 1989):\nψi(l,k) =\nZ ∞\n0\nWg(s2)lg(s2)rqi+2k−1cqids,\n(6)\n5\nwhere cqi = 2π\nqi\n2 /Γ( qi\n2 ) is the surface area of the unit sphere in Rqi and Γ(a) is the well-known gamma function. One\ncan ﬁnd these quantities for many distributions simply solving (6) algebraically or numerically. Table 2 shows these\nquantities for the normal, Cauchy, Student t and power exponential distributions.\nTable 2: Functions ψi(2,1), ψi(2,2), ψi(3,2), ψi(3,3) for normal, Cauchy, Student t and power exponential (P.E.) distribu-\ntions.\nψi(2,1)\nψi(2,2)\nψi(3,2)\nψi(3,3)\nnormal\nqi\n4\nqi(qi+2)\n4\n−qi(qi+2)\n8\n−qi(qi+2)(qi+4)\n8\nqi ≥1\nCauchy\nqi(qi+1)\n4(qi+3)\nqi(qi+2)(qi+1)\n4(qi+3)\n−qi(qi+2)(qi+1)2\n8(qi+3)(qi+5)\n−qi(qi+2)(qi+4)(qi+1)2\n8(qi+3)(qi+5)\nqi ≥1\nStudent t\nqi(qi+ν)\n4(qi+ν+2)\nqi(qi+2)(qi+ν)\n4(qi+ν+2)\n−\nqi(qi+2)(qi+ν)2\n8(qi+2+ν)(qi+4+ν)\n−qi(qi+2)(qi+4)(qi+ν)2\n8(qi+2+ν)(qi+4+ν)\nqi ≥1\nP.E.\nλ2Γ( 4λ−1\n2λ\n)\n21/λΓ( 1\n2λ )\n2λ+1\n4\n−λ3Γ( 6λ−1\n2λ\n)\n21/λΓ( 1\n2λ )\n−(2λ+1)(4λ+1)\n8\nqi = 1, λ > 1\n4\nP.E.\nλ2Γ( qi−2\n2λ +2)\n21/λΓ( qi\n2λ )\nqi(2λ+qi)\n4\n−λ3Γ( qi−2\n2λ +3)\n21/λΓ( qi\n2λ )\n−qi(2λ+qi)(4λ+qi)\n8\nqi ≥2, λ > 0\nIt is important to remark that the ψi(l,k)’s may involve unknown quantities (for instance, the degrees of freedom\nν of the Student t distribution and the shape parameter λ of the power exponential distribution). One may want to\nestimate these quantities via maximum likelihood estimation. Here, we consider these as known quantities for the\npurpose of keeping the robustness property of some distributions. Lucas (1997) shows that the protection against “large”\nobservations is only valid when the degrees of freedom parameter is kept ﬁxed for the Student t distribution. Therefore,\nthe issue of estimating these quantities is beyond of the main scope of this paper. In practice, one can use model selection\nprocedures to choose the most appropriate values of such unknown parameters.\nNotice that, in the Fisher information matrix K(θ), the matrix M carries all the information about the adopted\ndistribution, while F and H contain the information about the adopted model. Also, K(θ) has a quadratic form that can\nbe computed through simple matrix operations. Under the normal case, vi = 1, M = H−1 and hence eH = H.\nThe Fisher scoring method can be used to estimate θ by iteratively solving the equation\n(F (m)⊤eH(m)F (m))θ(m+1) = F (m)⊤eH(m)s∗(m),\nm = 0, 1, . . .,\n(7)\nwhere the quantities with the upper index “(m)” are evaluated at bθ, m is the iteration counter and\ns∗(m) = F (m)θ(m) + H−1(m)M −1(m)s(m).\nEach loop, through the iterative scheme (7), consists of an iterative re-weighted least squares algorithm to optimize the\nlog-likelihood (4). Thus, (5) and (7) agree with the corresponding equations derived in Patriota and Lemonte (2009).\nObserve that, despite the complexity and generality of the postulated model, expressions (5) and (7) are very simple and\nfriendly.\n6\nNow, we can give the main result of the paper.\nTheorem 3.1. The second-order bias vector Bbθ(θ) under model (3) is given by\nBbθ(θ) = (F ⊤eHF)−1F ⊤eHξ,\n(8)\nwhere ξ = (Φ1, . . . , Φp)vec((F ⊤eHF)−1), Φr = (Φ⊤\n1(r), . . . Φ⊤\nn(r))⊤, and Φi(r) is given in the Appendix.\nProof: See the Appendix.\nIn many models the location vector and the scale matrix do not have parameters in common, i.e., µi = µi(θ1, xi)\nand Σi = Σi(θ2, wi), where θ = (θ⊤\n1 , θ⊤\n2 )⊤. Therefore, F = block–diag{Fθ1, Fθ2} and the parameter vectors θ1 and\nθ2 will be orthogonal (Cox and Reid 1987). This happens in mixed models, nonlinear models, among others. However,\nin errors-in-variables and factor analysis models orthogonality does not hold. Model (3) is general enough to encompass\na large number of models even those that do not have orthogonal parameters.\nCorollary 3.1. When µi = µi(θ1, xi) and Σi = Σi(θ2, wi), where θ = (θ⊤\n1 , θ⊤\n2 )⊤the second-order bias vector of bθ1\nand bθ2 are given by\nBbθ1(θ) = (F ⊤\nθ1 eH1Fθ1)−1F ⊤\nθ1 eH1ξ1\nand\nBbθ2(θ) = (F ⊤\nθ2 eH2Fθ2)−1F ⊤\nθ2 eH2ξ2,\nrespectively. The quantities Fθ1, Fθ2, eH1, eH2, ξ1 and ξ2 are deﬁned in the Appendix.\nProof: See the Appendix.\nFormula (8) says that, for any particular model of the general multivariate elliptical class of models (3), it is always\npossible to express the bias of bθ as the solution of an weighted least-squares regression. Also, if zi ∼Nqi(0, Σi) then\nci = −eωi = 1, η1i = 0, η2i = −2, eH = H,\nJi(r) =\n\u0012\n0\n2(Iqi ⊗ai(r))Di\n\u0013\n,\nand formula (8) reduces to the one obtained by Patriota and Lemonte (2009).\nTheorem 3.1 implies that all one needs to compute bias-corrected and bias-reduced MLEs in the general elliptical\nmodel is: (i) the ﬁrst and second derivatives of the location vector µi and the scale matrix Σi with respect to all the\nparameters; (2) the derivatives Wg(u); (3) some moments involving the chosen elliptical distribution (these moments\nare given in Table 2 for some elliptical distributions). With these quantities, the matrices in (8) can be computed and the\nbias vector can be computed through an weighted least-squares regression.\n7\n4\nSpecial models\nIn this section, we present four important particular cases of the main model (3). All special cases presented in Patriota\nand Lemonte (2009) are also special cases of the general multivariate elliptical model deﬁned in this paper.\n4.1\nHeteroscedastic nonlinear models\nConsider the univariate heteroscedastic nonlinear model deﬁned by\nYi = f(xi, α) + ei, i = 1, 2, . . . , n,\nwhere Yi is the response, xi is a column vector of explanatory variables, α is a column vector p1 × 1 of unknown\nparameters and f is a nonlinear function of α. Assume that e1, e2, . . . , en are independent, with ei ∼El(0, σ2\ni ). Here\nσ2\ni = σ2\ni (γ) = h(ω⊤\ni γ), where γ is a p2 × 1 vector of unknown parameters. Then\nYi\nind\n∼El(f(xi, α), σ2\ni ),\nwhich is a special case of (3) with θ = (α⊤, γ⊤)⊤, µi = f(xi, α) and Σi = σ2\ni . Here El stands for El1. Notice that for\nthe heteroscedastic linear model f(xi, α) = x⊤\ni α.\nThe second-order bias vector Bbθ(θ) comes from (8), which depends on derivatives of f(xi, α) and σ2\ni with respect\nto the parameter vector θ. Also, it depends on the quantities ψi(2,1), ψi(2,2), ψi(3,2), ψi(3,3) (see Table 2) and Wg(ui)\ncontaining information about the adopted distribution.\n4.2\nNonlinear mixed-effects model\nOne of the most important examples is the nonlinear mixed-effects model introduced by Lange et al. (1989) and studied\nunder the assumption of a Student t distribution. Let\nYi = µi(xi, α) + Zibi + ui,\nwhere Yi is the qi × 1 vector response, µi is a qi-dimensional nonlinear function of α, xi is a vector of nonstochastic\ncovariates, Zi is a matrix of known constants, α is a p1 × 1 vector of unknown parameters and bi is an r × 1 vector of\nunobserved random regression coefﬁcients. Assume that,\n\u0012 bi\nui\n\u0013\n∼Elr+qi\n\u0012\u0014 0\n0\n\u0015\n,\n\u0014 Σb(γ1)\n0\n0\nRi(γ2)\n\u0015\u0013\n,\nwhere γ1 is a p2-dimensional vector of unknown parameters and γ2 is a p3 × 1 vector of unknown parameters. Fur-\nthermore, the vectors (b1, u1)⊤, (b2, u2)⊤, . . ., (bn, un)⊤are independent. Therefore, the marginal distribution of the\nobserved vector is\nYi ∼Elqi (µi(xi, α); Σi(Zi, γ)) ,\n(9)\nwhere γ = (γ⊤\n1 , γ⊤\n2 )⊤and Σi(Zi, γ) = ZiΣb(γ1)Z⊤\ni\n+ Ri(γ2). Equation (9) is a special case of (3) with θ =\n(α⊤, γ⊤)⊤, µi = µi(xi, α) and Σi = Σi(Zi, γ). From (8) one can compute the bias vector Bbθ(θ).\n8\n4.3\nErrors-in-variables model\nConsider the model\nx1i = β0 + β1x2i + qi,\ni = 1, . . . , n,\nwhere x1i is a v ×1 latent response vector, x2i is a m×1 latent vector of covariates, β0 is a v ×1 vector of intercepts, β1\nis a v × m matrix of slopes, and qi is the equation error having a multivariate elliptical distribution with location vector\nzero and scale matrix Σq. The variables x1i and x2i are not directly observed, instead surrogate variables X1i and X2i\nare measured with the following additive structure:\nX1i = x1i + δx1i\nand\nX2i = x2i + δx2i.\n(10)\nThe random quantities x2i, qi, δx1i and δx2i are assumed to follow an elliptical distribution given by\n\n\n\n\nx2i\nqi\nδx1i\nδx2i\n\n\n\n\nind\n∼El2v+2m\n\n\n\n\n\n\nµx2\n0\n0\n0\n\n\n\n,\n\n\n\n\nΣx2\n0\n0\n0\n0\nΣq\n0\n0\n0\n0\nτx1i\n0\n0\n0\n0\nτx2i\n\n\n\n\n\n,\nwhere the matrices τxi and τzi are known for all i = 1, . . . , n. These “known” matrices may be attained, for example,\nthrough an analytical treatment of the data collection mechanism, replications, machine precision, etc (Kulathinal et al.\n(2002)).\nTherefore, the observed vector Yi = (X⊤\n1i, X⊤\n2i)⊤has marginal distribution given by\nYi\nind\n∼Elv+m(µ(θ), Σi(θ))\n(11)\nwith\nµ(θ) =\n\u0012β0 + β1µx2\nµx2\n\u0013\nand\nΣi(θ) =\n\u0012β1Σx2β⊤\n1 + Σq + τx1i\nβ1Σx2\nΣx2β⊤\n1\nΣx2 + τx2i\n\u0013\n,\nwhere θ = (β⊤\n0 , vec(β1)⊤, µ⊤\nx2, vech(Σx2)⊤, vech(Σq)⊤)⊤, “vech” operator transforms a symmetric matrix into a vec-\ntor by stacking into columns its diagonal and superior diagonal elements. The mean vector (θ) and the covariance-\nvariance matrix Σi(θ) of observed variables have the matrix β1 in common, i.e., they share mv parameters. Kulathinal\net al. (2002) study the linear univariate case (v = 1, m = 1).\nEquation (11) is a special case of (3) with qi = v + m, θ = (α⊤, γ⊤)⊤, µi = µi(θ) and Σi = Σi(θ). In this case, a\nprogramming language or software that can perform operations on vectors and matrices, e.g. Ox (Doornik, 2013) and R\n(Ihaka and Gentleman, 1996), can be used to obtain the bias vector Bbθ(θ) from (8).\n4.4\nLog-symmetric regression models\nLet T be a continuous positive random variable with probability density function\nfT (t; η, φ, g) =\n1\n√φtg\n \nlog2\n\"\u0012 t\nη\n\u0013\n1\n√φ\n#!\n, η > 0, φ > 0,\n(12)\n9\nwhere g is the density generating function of a univariate elliptical distribution, and we write T ∼LS(η, φ, g). Vanegas\nand Paula (2014) called the class of distribution in (12) the log-symmetric class of distributions. It includes log-normal,\nlog-Student t, log-power-exponential distributions, among many others, as special cases. It is easy to verify that log(T )\nhas a univariate elliptical distribution (i.e., symmetric distribution) with location parameter µ = log(η) and scale param-\neter φ. The parameter η is the median of T , and φ can be interpreted as a skewness or relative dispersion parameter.\nVanegas and Paula (2015) deﬁned and studied semi-parametric regression models for a set T1, T2, . . . , Tn with\nTi ∼LS(ηi, φi, g) with ηi > 0 and φi > 0 following semi-parametric regression structures. Here we assume parametric\nspeciﬁcation for ηi and φi as ηi = ηi(xi, α) and φi = φi(ωi, γ).\nHence,\nYi = log(Ti)\nind\n∼El (µi(xi, α), φi(ωi, γ)) ,\n(13)\nwhere µi(xi, α) = log(η(xi, α)). Therefore, (13) is a special case of the general elliptical model (3), and formula (8)\napplies.\n5\nSimulation results\nIn this section, we shall present the results of Monte Carlo simulation experiments in which we evaluate the ﬁnite sample\nperformances of the original MLEs and their bias-corrected and bias-reduced versions. The simulations are based on the\nunivariate nonlinear model without random effects (Section 4.1) and the errors-in-variables model presented in Section\n4.2, when Yi follows a normal distribution, a Student t distribution with ν degrees of freedom, or a power exponential\ndistribution with shape parameter λ. For all the simulations, the number of Monte Carlo replications is 10,000 (ten\nthousand) and they have been performed using the Ox matrix programming language (Doornik, 2013).\nFirst consider the model described in (9) with qi = 1, Zi = 0, Σi = σ2 and\nµi(α) = µi(xi, α) = α1 +\nα2\n1 + α3xα4\ni\n,\ni = 1, . . . , n.\n(14)\nHere the unknown parameter vector is θ = (α1, α2, α3, α4, σ2)⊤. The values of xi were obtained as random draws from\nthe uniform distribution U(0, 100). The sample sizes considered are n = 10, 20, 30, 40 and 50. The parameter values\nare α1 = 50, α2 = 500, α3 = 0.50, α4 = 2 and σ2\ni = 200. For the Student t distribution, we ﬁxed the degrees of\nfreedom at ν = 4, and for the power exponential model the shape parameter is ﬁxed at λ = 0.8.\nTables 3-4 present the bias, and the root mean squared errors (\n√\nMSE) of the maximum likelihood estimates, the\nbias-corrected estimates and the bias-reduced estimates for the nonlinear model with normal and Student t distributed\nerrors, respectively. To save space, the corresponding results for the power exponential model are not shown.1 We note\nthat the bias-corrected estimates and the bias-reduced estimates are less biased than the original MLE for all the sample\nsizes considered. For instance, when n = 20 and the errors follow a Student t distribution (see Table 4) the estimated\nbiases of bσ2 are −41.24 (MLE), −12.30 (bias-corrected) and −4.55 (bias-reduced). For the normal case with n = 10\n(see Table 3), the estimated biases of bα2 are 2.16 (MLE), 0.70 (bias-corrected) and −0.27 (bias-reduced). We also\nobserve that the bias-reduced estimates are less biased than the bias-corrected estimates in most cases. As n increases,\nthe bias and the root mean squared error of all the estimators decrease, as expected. Additionally, we note that the MLE\n1All the omitted tables in this paper are presented in a supplement available from the authors upon request.\n10\nof α2 has\n√\nMSE larger than those of the modiﬁed versions. For the estimation of σ2,\n√\nMSE is smaller for the original\nMLE. In other cases, we note that the estimators have similar root mean squared errors.\nTable 3: Biases and\n√\nMSE of the maximum likelihood estimate and its adjusted versions; nonlinear model; normal\ndistribution.\nMLE\nBias-corrected MLE\nBias-reduced MLE\nn\nθ\nBias\n√\nMSE\nBias\n√\nMSE\nBias\n√\nMSE\nα1\n−0.29\n6.69\n−0.13\n6.67\n−0.01\n6.67\nα2\n2.16\n20.07\n0.70\n19.40\n−0.27\n19.06\n10\nα3\n0.01\n0.13\n0.00\n0.12\n0.00\n0.12\nα4\n0.03\n0.30\n0.01\n0.29\n−0.00\n0.29\nσ2\n−80.05\n106.44\n−32.06\n103.32\n9.09\n128.72\nα1\n−0.08\n4.07\n−0.01\n4.07\n0.01\n4.07\nα2\n0.66\n17.94\n−0.08\n17.84\n−0.27\n17.82\n20\nα3\n0.00\n0.09\n0.00\n0.09\n−0.00\n0.09\nα4\n0.02\n0.21\n0.01\n0.20\n0.00\n0.20\nσ2\n−40.07\n69.73\n−8.09\n68.95\n0.86\n72.02\nα1\n−0.10\n3.11\n−0.04\n3.10\n−0.02\n3.10\nα2\n0.71\n17.24\n−0.05\n17.15\n−0.18\n17.13\n30\nα3\n0.00\n0.09\n−0.00\n0.09\n−0.00\n0.09\nα4\n0.02\n0.20\n0.00\n0.19\n0.00\n0.19\nσ2\n−26.41\n55.26\n−3.26\n55.11\n0.82\n56.32\nα1\n−0.08\n2.69\n−0.02\n2.69\n−0.01\n2.69\nα2\n0.83\n16.80\n0.09\n16.70\n0.01\n16.69\n40\nα3\n0.00\n0.09\n0.00\n0.09\n0.00\n0.09\nα4\n0.02\n0.19\n0.00\n0.18\n−0.00\n0.18\nσ2\n−20.04\n47.26\n−2.04\n47.13\n0.33\n47.74\nα1\n−0.08\n2.39\n−0.03\n2.38\n−0.02\n2.38\nα2\n1.07\n14.25\n0.30\n14.12\n0.23\n14.11\n50\nα3\n0.00\n0.08\n0.00\n0.08\n0.00\n0.08\nα4\n0.01\n0.19\n0.00\n0.18\n−0.00\n0.18\nσ2\n−15.93\n41.41\n−1.21\n41.30\n0.36\n41.67\nWe now consider the errors-in-variables model described in (10). The sample sizes considered are n = 15, 25, 35 and\n50. The parameter values are β0 = 0.70 1v×1, β1 = 0.40 1v×m, µx2 = 70 1m×1, Σq = 40 Iv×1 and Σx2 = 250 Im×1.\nHere, 1r×s is as r ×s matrix of ones and Ir×s is the identity matrix with dimension r ×s. For the Student t distribution,\nwe ﬁxed the degrees of freedom at ν = 4 and, for power exponential model, the shape parameter was ﬁxed at λ = 0.7.\nWe consider v ∈{1, 2} and m = 1.\nIn Tables 5-6, we present the MLE, the bias-corrected estimates, the bias-reduced estimates, and corresponding\n11\nTable 4: Biases and\n√\nMSE of the maximum likelihood estimate and its adjusted versions; nonlinear model; Student t\ndistribution.\nMLE\nBias-corrected MLE\nBias-reduced MLE\nn\nθ\nBias\n√\nMSE\nBias\n√\nMSE\nBias\n√\nMSE\nα1\n−0.51\n8.66\n−0.31\n8.63\n−0.20\n8.56\nα2\n3.34\n28.47\n1.39\n27.34\n2.05\n27.67\n10\nα3\n0.01\n0.17\n0.00\n0.16\n0.01\n0.16\nα4\n0.06\n0.42\n0.03\n0.39\n−0.01\n0.38\nσ2\n−93.18\n127.60\n−54.24\n130.73\n−17.40\n170.35\nα1\n−0.17\n5.03\n−0.07\n5.02\n−0.04\n5.01\nα2\n2.01\n25.64\n0.91\n25.11\n1.29\n24.98\n20\nα3\n0.01\n0.14\n0.01\n0.14\n0.01\n0.13\nα4\n0.04\n0.29\n0.01\n0.28\n0.00\n0.27\nσ2\n−41.24\n85.51\n−12.30\n89.41\n−4.55\n93.08\nα1\n−0.10\n3.81\n−0.01\n3.80\n0.01\n3.82\nα2\n2.25\n25.75\n1.13\n25.34\n1.61\n25.41\n30\nα3\n0.01\n0.14\n0.01\n0.14\n0.01\n0.14\nα4\n0.04\n0.29\n0.01\n0.27\n0.00\n0.26\nσ2\n−27.15\n70.02\n−6.15\n72.64\n−1.78\n107.53\nα1\n−0.10\n3.27\n−0.02\n3.26\n−0.01\n3.26\nα2\n1.82\n24.94\n0.75\n24.67\n1.18\n24.78\n40\nα3\n0.01\n0.12\n0.00\n0.12\n0.01\n0.12\nα4\n0.03\n0.26\n0.01\n0.25\n0.00\n0.25\nσ2\n−20.38\n60.43\n−4.01\n62.21\n−1.82\n62.98\nα1\n−0.13\n2.86\n−0.05\n2.85\n−0.03\n2.85\nα2\n1.48\n18.86\n0.38\n18.59\n0.24\n18.46\n50\nα3\n0.01\n0.11\n0.00\n0.11\n0.00\n0.11\nα4\n0.02\n0.24\n0.00\n0.23\n0.00\n0.23\nσ2\n−15.40\n53.99\n−1.94\n55.56\n−0.43\n56.11\n12\nestimated root mean squared errors for the Student t and power exponential distributions, for the errors-in-variables\nmodel. The results for the normal distribution are not shown to save space. We observe that, in absolute value, the\nbiases of the bias-corrected estimates and bias-reduced estimates are smaller than those of the original MLE for different\nsample sizes. Furthermore, the bias-reduced estimates are less biased than the bias-corrected estimates in most cases.\nThis can be seen e.g. in Table 6 when v = 1, m = 1, Yi follows a power exponential distribution and n = 15. In this\ncase, the bias of the MLE, the bias-corrected estimate and the bias-reduced estimate of Σq are −4.92, −0.66 and −0.17,\nrespectively. When Yi follows a Student t distribution, n = 15, v = 1 and m = 1 we observe the following biases of the\nestimates of Σx2: 5.18 (MLE), 2.91 (bias-corrected) and 2.66 (bias-reduced); see Table 5. We note that the root mean\nsquared errors decrease with n.\nFor the sake of saving space, the simulation results for the normal, Student t and power exponential errors-in-variable\nmodels with v = 2 and m = 1 are not presented. Overall, our ﬁndings are similar to those reached for the other models.\nTable 5: Biases and\n√\nMSE of the maximum likelihood estimate and its adjusted versions; errors-in-variables model;\nv = 1 and m = 1; Student t distribution.\nMLE\nBias-corrected MLE\nBias-reduced MLE\nn\nθ\nBias\n√\nMSE\nBias\n√\nMSE\nBias\n√\nMSE\nβ0\n−0.00\n9.90\n0.01\n9.90\n0.01\n9.89\nβ1\n0.00\n0.14\n0.00\n0.14\n0.00\n0.14\n15\nµx2\n0.05\n4.82\n0.05\n4.82\n0.05\n4.82\nΣx2\n5.18\n129.34\n2.91\n128.12\n2.66\n127.86\nΣq\n−3.64\n19.52\n−0.68\n20.72\n−0.42\n20.85\nβ0\n−0.02\n7.14\n−0.01\n7.14\n−0.01\n7.14\nβ1\n0.00\n0.10\n0.00\n0.10\n0.00\n0.10\n25\nµx2\n0.03\n3.69\n0.03\n3.69\n0.03\n3.69\nΣx2\n3.61\n97.32\n2.25\n96.76\n2.17\n96.69\nΣq\n−2.31\n14.87\n−0.47\n15.41\n−0.38\n15.44\nβ0\n−0.02\n5.93\n−0.02\n5.93\n−0.02\n5.93\nβ1\n0.00\n0.08\n0.00\n0.08\n0.00\n0.08\n35\nµx2\n−0.01\n3.12\n−0.01\n3.12\n−0.01\n3.12\nΣx2\n1.94\n79.78\n0.98\n79.45\n0.94\n79.44\nΣq\n−1.65\n12.63\n−0.31\n12.96\n−0.26\n12.97\nβ0\n−0.01\n4.92\n−0.01\n4.92\n−0.01\n4.92\nβ1\n0.00\n0.07\n0.00\n0.07\n0.00\n0.07\n50\nµx2\n0.01\n2.59\n0.01\n2.59\n0.01\n2.59\nΣx2\n1.04\n65.50\n0.37\n65.33\n0.36\n65.33\nΣq\n−1.18\n10.53\n−0.24\n10.78\n−0.21\n10.79\n13\nTable 6: Biases and\n√\nMSE of the maximum likelihood estimate and its adjusted versions; errors-in-variables model;\nv = 1 and m = 1; power exponential distribution.\nMLE\nBias-corrected MLE\nBias-reduced MLE\nn\nθ\nBias\n√\nMSE\nBias\n√\nMSE\nBias\n√\nMSE\nβ0\n−0.12\n9.25\n−0.11\n9.25\n−0.11\n9.24\nβ1\n0.00\n0.13\n0.00\n0.13\n0.00\n0.13\n15\nµx2\n−0.02\n6.47\n−0.02\n6.47\n−0.02\n6.47\nΣx2\n−9.27\n103.32\n0.52\n107.51\n0.82\n107.64\nΣq\n−4.92\n15.67\n−0.66\n17.55\n−0.17\n17.76\nβ0\n0.02\n6.83\n0.03\n6.83\n0.03\n6.83\nβ1\n0.00\n0.09\n−0.00\n0.09\n−0.00\n0.09\n25\nµx2\n−0.02\n4.98\n−0.02\n4.98\n−0.02\n4.98\nΣx2\n−5.60\n80.20\n0.36\n81.95\n0.47\n81.99\nΣq\n−3.04\n12.94\n−0.36\n13.49\n−0.18\n13.54\nβ0\n0.01\n5.59\n0.02\n5.58\n0.02\n5.58\nβ1\n−0.00\n0.08\n−0.00\n0.08\n−0.00\n0.08\n35\nµx2\n−0.04\n4.21\n−0.04\n4.21\n−0.04\n4.21\nΣx2\n−3.53\n68.01\n0.77\n69.10\n0.82\n69.12\nΣq\n−2.14\n11.11\n−0.18\n11.46\n−0.08\n11.49\nβ0\n0.03\n4.67\n0.03\n4.67\n0.03\n4.67\nβ1\n−0.00\n0.06\n−0.00\n0.06\n−0.00\n0.06\n50\nµx2\n−0.03\n3.52\n−0.03\n3.52\n−0.03\n3.52\nΣx2\n−2.83\n56.89\n0.18\n57.51\n0.21\n57.52\nΣq\n−1.51\n9.21\n−0.12\n9.41\n−0.07\n9.42\n14\n6\nApplications\n6.1\nRadioimmunoassay data\nTiede and Pagano (1979) present a dataset, referred here as the radioimmunoassay data, obtained from the Nuclear\nMedicine Department at the Veterans Administration Hospital, Buffalo, New York. Lemonte and Patriota (2011) ana-\nlyzed the data to illustrate the applicability of the elliptical models with general parameterization. Following Tiede and\nPagano (1979) we shall consider the nonlinear regression model (14), with n = 14. The response variable is the observed\nradioactivity (count in thousands), the covariate corresponds to the thyrotropin dose (measured in micro-international\nunits per milliliter) and the errors follow a normal distribution or a Student t distribution with ν = 4 degrees of free-\ndom. We assume that the scale parameter is unknown for both models. In Table 7 we present the maximum likelihood\nestimates, the bias-corrected estimates, the bias-reduced estimates, and the corresponding estimated standard errors are\ngiven in parentheses. We note that all the estimates present smaller standard errors under the Student t model than under\nthe normal model (Table 7).\nFor all parameters, the original MLEs are very close to the bias-corrected MLE and the bias-reduced MLE when the\nStudent t model is used. However, under the normal model, signiﬁcant differences in the estimates of α1 are noted. The\nestimates for α1 are 0.44 (MLE), 0.65 (bias-corrected MLE) and 1.03 (bias-reduced MLE).\nTable 7: Estimates and standard errors (given in parentheses); radioimmunoassay data.\nNormal distribution\nθ\nMLE\nBias-corrected MLE\nBias-reduced MLE\nα1\n0.44 (0.80)\n0.65 (0.99)\n1.03 (1.06)\nα2\n7.55 (0.95)\n7.34 (1.16)\n6.91 (1.25)\nα3\n0.13 (0.06)\n0.13 (0.06)\n0.13 (0.08)\nα4\n0.96 (0.24)\n0.93 (0.28)\n0.95 (0.34)\nσ2\n0.31 (0.12)\n0.40 (0.15)\n0.50 (0.19)\nStudent t distribution\nθ\nMLE\nBias-corrected MLE\nBias-reduced MLE\nα1\n0.90 (0.12)\n0.91 (0.13)\n0.90 (0.15)\nα2\n7.09 (0.17)\n7.08 (0.19)\n7.07 (0.22)\nα3\n0.09 (0.01)\n0.09 (0.01)\n0.09 (0.02)\nα4\n1.31 (0.08)\n1.31 (0.09)\n1.29 (0.10)\nσ2\n0.02 (0.01)\n0.02 (0.01)\n0.03 (0.01)\n6.2\nFluorescent lamp data\nRosillo and Chivelet (2009) present a dataset referred here as the ﬂuorescent lamp data. The authors analyze the lifetime\nof ﬂuorescent lamps in photovoltaic systems using an analytical model whose goal is to assist in improving ballast design\n15\nand extending the lifetime of ﬂuorescent lamps. Following Rosillo and Chivelet (2009) we shall consider the nonlinear\nregression model (9) with qi = 1, Zi = 0, Σi = σ2, θ =\n\u0000α⊤, σ2\u0001⊤=\n\u0000α0, α1, α2, α3, σ2\u0001⊤and\nµi(α) =\n1\n1 + α0 + α1xi1 + α2xi2 + α3x2\ni2\n,\ni = 1, . . . , 14,\nwhere the response variable is the observed lifetime/advertised lifetime (Y ), the covariates correspond to a measure of\ngas discharge (x1) and the observed voltage/ad- vertised voltage (measure of performance of lamp and ballast - x2) and\nthe errors are assumed to follow a normal distribution. Here we also assume a Student t distribution with ν = 4 degrees\nof freedom for the errors.\nIn Table 8 we present the maximum likelihood estimates, the bias-corrected estimates, the bias-reduced estimates,\nand the corresponding estimated standard errors. As in the previous application, the estimates present smaller standard\nerrors under the Student t model than under the normal model.\nThe original MLEs for α0 and α3 are bigger than the corresponding corrected and reduced versions by approximately\none unit (normal and Student t models). The largest differences are among the estimates of α2; for example, for the\nnormal model we have −56.33 (MLE), −54.45 (bias-corrected MLE) and −53.86 (bias-reduced MLE).\nWe now use the Akaike Information Criterion (AIC, Akaike, 1974), the Schwarz Bayesian criterion (BIC, Schwarz,\n1978) and the ﬁnite sample AIC (AICC, Hurvich and Tsai, 1989) to evaluate the quality of the normal and Student t\nﬁts. For the normal model we have AIC = −9.98, BIC = −6.79 and AICC = −2.48. For the t model we have\nAIC = −11.24, BIC = −8.04 and AICC = −3.74. Therefore, the t model presents the best ﬁt for this dataset, since\nthe values of the AIC, BIC and AICC are smaller.\nLet\nbD =\n14\nX\nj=1\n(bY −bY(j))⊤(bY −bY(j)),\nwhere bY and bY(j) are the vectors of predicted values computed from the model ﬁt for the whole sample and the sample\nwithout the jth observation, respectively. The quantity bD measures the total effect of deleting one observation in the\npredicted values. For a ﬁxed sample size, it tends to be high if a single observation can highly inﬂuence the prediction\nof new observations. We have bD = 0.119, 0.120, and 0.123 (normal model) and bD = 0.101, 0.100, and 0.095 (Student\nt model) when using the MLE, the bias-corrected estimate, and the bias-reduced estimate, respectively. Notice that bD\nis smaller for the Student t model regardless of the estimate used. This is evidence that the Student t model is more\nsuitable than the normal model for predicting lifetime of ﬂuorescent lamps in this study.\n6.3\nWHO MONICA data\nWe now turn to a dataset from the WHO MONICA Project that was considered in Kulathinal et al. (2002). This dataset\nwas ﬁrst analyzed under normal distributions for the marginals of the random errors (Kulathinal et al. 2002; Patriota\net al. 2009a). Thereafter, it was studied under a scale mixture of normal distributions for the marginals of the random\nerrors (Cao et al., 2012). The approach used in the present paper is different from the others because here we consider a\njoint elliptical distribution for the vector of random errors. The other authors assumed that the distributions of the errors\nwere independent, while we assume that they are uncorrelated but not independent. For our proposal, the errors will\nonly be independent under normality.\n16\nTable 8: Estimates and standard errors (given in parentheses); ﬂuorescent lamp data.\nNormal distribution\nθ\nMLE\nBias-corrected MLE\nBias-reduced MLE\nα0\n29.49\n(5.21)\n28.54\n(5.66)\n28.25\n(5.84)\nα1\n9.99\n(4.69)\n9.68\n(5.21)\n9.62\n(5.42)\nα2\n−56.33\n(10.10)\n−54.45\n(10.93)\n−53.86\n(11.26)\nα3\n26.53\n(4.89)\n25.61\n(5.28)\n25.31\n(5.43)\nσ2\n1.40 × 10−2\n(5.00 × 10−3)\n1.80 × 10−2\n(7.00 × 10−3)\n1.90 × 10−2 (7.00 × 10−3)\nStudent t distribution\nθ\nMLE\nBias-corrected MLE\nBias-reduced MLE\nα0\n30.66\n(4.64)\n29.94\n(5.05)\n29.85\n(5.20)\nα1\n8.48\n(4.00)\n8.24\n(4.42)\n8.46\n(4.57)\nα2\n−58.20\n(8.94)\n−56.79\n(9.71)\n−56.67\n(10.00)\nα3\n27.27\n(4.30)\n26.58\n(4.66)\n26.55\n(4.80)\nσ2\n7.30 × 10−3 (3.60 × 10−3)\n9.20 × 10−3 (4.60 × 10−3)\n9.80 × 10−3 (4.90 × 10−3)\nThe dataset considered here corresponds to the data collected for men (n = 38). As describe in Kulathinal et al.\n(2002), the data are trends of the annual change in the event rate (y) and trends of the risk scores (x). The risk score is\ndeﬁned as a linear combination of smoking status, systolic blood pressure, body mass index, and total cholesterol level.\nA follow-up study using proportional hazards models was employed to derive its coefﬁcients, and provides the observed\nrisk score and its estimated variance. Therefore, the observed response variable, X1, is the average annual change in\nevent rate (%) and the observed covariate, X2, is the observed risk score (%). We use the heteroscedastic model (10)\nwith v = m = 1 and zero covariance between the errors δx1i and δx2i.\nTable 9 gives the MLE and the bias-corrected/reduced estimates (standard errors are given in parentheses). We\nconsidered the full sample (n = 38) and randomly chosen sub-samples of n = 10, 20 and 30 observations.\nThe original MLEs for β0, β1 and µx2 are practically the same as their bias-corrected and bias-reduced versions for\nall sample sizes. The largest differences are among the estimates of Σq; for example, for n = 10 we have 6.17 (MLE),\n8.14 (bias-corrected MLE) and 8.81 (bias-reduced MLE). In general, as expected, larger sample sizes correspond to\nsmaller standard errors.\n7\nConcluding remarks\nWe studied bias correction and bias reduction for a multivariate elliptical model with a general parameterization\nthat uniﬁes several important models (e.g., linear and nonlinear regressions models, linear and nonlinear mixed models,\nerrors-in-variables models, among many others). We extend the work of Patriota and Lemonte (2009) to the elliptical\nclass of distributions deﬁned in Lemonte and Patriota (2011). We express the second order bias vector of the maximum\nlikelihood estimates as an weighted least-squares regression.\n17\nTable 9: Estimates and standard errors (given in parentheses); WHO MONICA data.\nn\nθ\nMLE\nBias-corrected MLE\nBias-reduced MLE\nβ0\n−2.58 (1.34)\n−2.58 (1.44)\n−2.45 (1.47)\nβ1\n0.05 (0.60)\n0.05 (0.63)\n0.07 (0.64)\n10\nµx2\n−1.54 (0.58)\n−1.54 (0.61)\n−1.53 (0.62)\nΣx2\n2.89 (1.50)\n3.22 (1.65)\n3.29 (1.69)\nΣq\n6.17 (3.99)\n8.14 (4.93)\n8.81 (5.25)\nβ0\n−2.68 (0.65)\n−2.69 (0.68)\n−2.69 (0.69)\nβ1\n0.48 (0.30)\n0.47 (0.31)\n0.43 (0.31)\n20\nµx2\n−1.29 (0.44)\n−1.29 (0.46)\n−1.29 (0.46)\nΣx2\n3.53 (1.25)\n3.73 (1.31)\n3.76 (1.32)\nΣq\n3.00 (1.66)\n3.59 (1.87)\n3.73 (1.92)\nβ0\n−2.22 (0.54)\n−2.22 (0.55)\n−2.20 (0.55)\nβ1\n0.43 (0.24)\n0.43 (0.25)\n0.42 (0.25)\n30\nµx2\n−0.77 (0.42)\n−0.77 (0.42)\n−0.77 (0.42)\nΣx2\n4.71 (1.34)\n4.88 (1.39)\n4.89 (1.39)\nΣq\n4.36 (1.86)\n4.89 (2.01)\n4.88 (2.01)\nβ0\n−2.08 (0.53)\n−2.08 (0.54)\n−2.08 (0.54)\nβ1\n0.47 (0.23)\n0.47 (0.24)\n0.46 (0.24)\n38\nµx2\n−1.09 (0.36)\n−1.09 (0.36)\n−1.09 (0.36)\nΣx2\n4.32 (1.10)\n4.44 (1.13)\n4.45 (1.13)\nΣq\n4.89 (1.78)\n5.34 (1.89)\n5.30 (1.88)\n18\nAs can be seen in our simulation results, corrected-bias estimators and reduced-bias estimators form a basis of\nasymptotic inferential procedures that have better performance than the corresponding procedures based on the original\nestimator. We further note that, in general, the bias-reduced estimates are less biased than the bias-corrected estimates.\nComputer packages that perform simple operations on matrices and vectors can be used to compute bias-corrected and\nbias-reduced estimates.\nAppendix\nLemma A.1. Let zi ∼Elqi(0, Σi, g), and ci and ψi(2,1) as previously deﬁned. Then,\nE\n\u0000vizi\n\u0001\n= 0,\nE\n\u0000v2\ni ziz⊤\ni\n\u0001\n= 4ψi(2,1)\nqi\nΣi,\nE\n\u0000v2\ni vec(ziz⊤\ni )z⊤\ni\n\u0001\n= 0,\nE\n\u0000v2\ni vec(ziz⊤\ni )vec(ziz⊤\ni )⊤\u0001\n= ci\n\u0000vec(Σi)vec(Σi)⊤+ 2Σi ⊗Σi\n\u0001\n,\nE\n\u0000v3\ni vec(ziz⊤\ni )vec(ziz⊤\ni )⊤\u0001\n= −c∗\ni\n\u0000vec(Σi)vec(Σi)⊤+ 2Σi ⊗Σi\n\u0001\n,\nE\n\u0000v3\ni z⊤\ni Ai(t)ziz⊤\ni Ai(s)ziz⊤\ni Ai(r)zi\n\u0001\n= −8eωi\n\u0000tr{Ai(t)Σi}tr{Ai(s)Σi}tr{Ai(r)Σi}\n+ 2tr{Ai(t)Σi}tr{Ai(s)ΣiAi(r)Σi}\n+ 2tr{Ai(s)Σi}tr{Ai(t)ΣiAi(r)Σi}\n+ 2tr{Ai(r)Σi}tr{Ai(t)ΣiAi(s)Σi})\n+ 8tr{Ai(t)ΣiAi(s)ΣiAi(r)Σi}\n\u0001\n,\nwhere c∗\ni = 8ψi(3,2)/{qi(qi + 2)}, ψi(3,2) = E(W 3\ng (ri)r2\ni ), eωi = ψi(3,3)/{qi(qi + 2)(qi + 4)} and ψi(3,3) =\nE(W 3\ng (ri)r3\ni ).\nProof: The proof can be obtained by adapting the results of Mitchell (1989) for a matrix version.\nFrom Lemma A.1, we can ﬁnd the cumulants of the log-likelihood derivatives required to compute the second-order\nbiases.\nProof of Theorem 3.1: Following Cordeiro and Klein (1994), we write (1) in matrix notation to obtain the second-order\nbias vector of bθ in the form\nBbθ(θ) = K(θ)−1Wvec(K(θ)−1),\n(15)\nwhere W = (W (1), . . . , W (p)) is a p × p2 partitioned matrix, each W (r), referring to the rth component of θ, being a\np × p matrix with typical (t, s)th element given by\nw(r)\nts = 1\n2κtsr + κts,r = κ(r)\nts −1\n2κtsr = 3\n4κ(r)\nts −1\n4(κt,s,r + κ(t)\nsr + κ(s)\nrt ).\n19\nBecause K(θ) is symmetric and the tth element of Wvec(K(θ)−1) is w(1)\nt1 κ1,1 + (w(1)\nt2 + w(2)\nt1 )κ1,2 + · · · + (w(s)\ntr +\nw(r)\nts )κs,r + · · · + (w(p−1)\ntp\n+ w(p)\nt(p−1))κp−1,p + w(p)\ntp κp,p, we may write\nw(r)\nts = 1\n2(w(s)\ntr + w(r)\nts ) = 1\n4(κ(r)\nts + κ(s)\ntr −κ(t)\nsr −κt,s,r).\n(16)\nComparing (15) and (8) we note that for the proof of this theorem it sufﬁces to show that F ⊤eHξ = Wvec((F ⊤eHF)−1),\ni.e.,\nW = F ⊤HMH(Φ1, . . . , Φp).\nNotice that\nκsr =\nn\nX\ni=1\n\u001aci\n2 tr{Ai(r)Ci(s)} −4ψi(2,1)\nqi\na⊤\ni(s)Σ−1\ni ai(r)\n−(ci −1)\n4\ntr{Ai(s)Σi}tr{Ai(r)Σi}\n\u001b\n.\n(17)\nThe quantities ψi(2,1) and ψi(2,2) do not depend on θ and hence, the derivative of (17) with respect to θt is\nκ(t)\nsr =\nn\nX\ni=1\n\u001aci\n2 tr{Ai(t)ΣiAi(s)Ci(r) + Ai(s)ΣiAi(t)Ci(r) + Ci(ts)Ai(r)\n+ Ci(tr)Ai(s)}\n\u001b\n−\nn\nX\ni=1\n\u001a4ψi(2,1)\nqi\n\u0000a⊤\ni(ts)Σ−1\ni ai(r) + a⊤\ni(s)Ai(t)ai(r)\n+ a⊤\ni(s)Σ−1\ni ai(tr)\n\u0001\u001b\n+\nn\nX\ni=1\n\u001a(ci −1)\n4\ntr{Ai(t)Ci(s) + Σ−1\ni Ci(ts)}tr{Ai(r)Σi}\n\u001b\n+\nn\nX\ni=1\n\u001a(ci −1)\n4\ntr{Ai(t)Ci(r) + Σ−1\ni\nCi(tr)}tr{Ai(s)Σi}\n\u001b\n.\nTherefore,\nκ(r)\nst + κ(s)\ntr −κ(t)\nsr =\nn\nX\ni=1\n\u001aci\n2 tr{Ai(r)ΣiAi(s)Ci(t) + Ai(s)ΣiAi(r)Ci(t)\n+ 2Ci(rs)Ai(t)}\n\u001b\n−\nn\nX\ni=1\n\u001a4ψi(2,1)\nqi\n\u00002a⊤\ni(t)Σ−1\ni ai(sr)\n+ a⊤\ni(t)Ai(s)ai(r) + a⊤\ni(s)Ai(r)ai(t) −a⊤\ni(s)Ai(t)ai(r)\n\u0001\u001b\n+\nn\nX\ni=1\n\u001a(ci −1)\n2\ntr{Ai(r)Ci(s) + Σ−1\ni Ci(rs)}tr{Ai(t)Σi}\n\u001b\n.\n20\nNow, the only quantity that remains to obtain is κt,s,r = E(UtUsUr). Noting that zi is independent of zj for i ̸= j,\nwe have\nκt,s,r = 1\n8\nn\nX\ni=1\nE\n\u001a\u0002\ntr{Ai(t)(Σi −viziz⊤\ni )}tr{Ai(s)(Σi −viziz⊤\ni )}\ntr{Ai(r)(Σi −viziz⊤\ni )}\n\u0003\n+ 4tr{Ai(t)(Σi −viziz⊤\ni )}(v2\ni a⊤\ni(r)Σ−1\ni\nziz⊤\ni Σ−1ai(s)) + 4tr{Ai(r)(Σi −viziz⊤\ni )}(v2\ni a⊤\ni(t)Σ−1\ni\nziz⊤\ni Σ−1\nai(s)) + 4tr{Ai(s)(Σi −viziz⊤\ni )}(v2\ni a⊤\ni(t)Σ−1\ni ziz⊤\ni Σ−1ai(r))\n\u001b\n.\nThen, by using Lemma A.1 and from (16), we have, after lengthy algebra, that\nW (r) =\nn\nX\ni=1\nF ⊤\ni HiMiHiΦi(r),\n(18)\nwhere\nΦi(r) = −1\n2\n\u0012\nH−1\ni\nM −1\ni\nBi(r)HiFi + ∂Fi\n∂θr\n\u0013\n,\nand\nBi(r) = −1\n2\n\u0012\nη1iCi(r)\n2η1iΣi ⊗a⊤\ni(r)\n2η2iΣi ⊗ai(r)\n2(ci −1)S1i(r)\n\u0013\n−1\n4\n\u0012η1iΣitr{Ci(r)Σ−1\ni }\n2η1iai(r)vec(Σi)⊤\n2η1ivec(Σi)a⊤\ni(r)\n2(ci + 8eωi)S2i(r)\n\u0013\n,\nwith\nη1i = c∗\ni + 4ψi(2,1)/qi, η2i = c∗\ni −4ψi(2,1)/qi,\nS1i(r) = vec(Σi)vec(Ci(r))⊤+ 1\n2vec(Σi)vec(Σi)⊤tr{Ci(r)Σ−1\ni } and\nS2i(r) = vec(Ci(r))vec(Σi)⊤+ vec(Σi)vec(Ci(r))⊤+ 4Σi ⊗Ci(r)\n+\n\u0002\nΣi ⊗Σi + 1\n2vec(Σi)vec(Σi)⊤\u0003\ntr{Ci(r)Σ−1\ni }.\nUsing (18) and (15) the theorem is proved.\nProof of Corollary 3.1: It follows from Theorem 3.1, eq. (8), when\nF = block–diag{Fθ1, Fθ2}, eH = block–diag{ eH1, eH2} and ξ = (ξ⊤\n1 , ξ⊤\n2 )⊤,\n21\nwhere Fθj =\nh\nF ⊤\nθj(1), . . . , F ⊤\nθj(n)\ni⊤\nand eHj = block-diag{ eHj(1), . . . , eHj(n)} for j = 1, 2, with Fθ1(i) = ∂µi/∂θ⊤\n1 ,\nFθ2(i) = ∂[vec(Σi)]/∂θ⊤\n2 , eH1(i) =\n4ψi(2,1)\nqi\nΣ−1\ni\nand eH2(i) = ci (2Σi ⊗Σi)−1 + (ci −1)vec(Σ−1\ni )vec(Σ−1\ni\n)⊤. Further-\nmore, ξ1 =\nh\nξ⊤\n1(1), . . . , ξ⊤\n1(n)\ni⊤\nand ξ2 =\nh\nξ⊤\n2(1), . . . , ξ⊤\n2(n)\ni⊤\nwith\nξ1(i) = −1\n2\n˙Fθ1(i) vec((F ⊤\nθ1 eH(1)Fθ1)−1),\nξ2(i) = 1\n4M ∗\ni P ∗\ni vec((F ⊤\nθ1 eH(1)Fθ1)−1) + 1\n8\n\u0010\nM ∗\ni Q∗\ni −4 ˙Fθ2(i)\n\u0011\nvec((F ⊤\nθ2 eH(2)Fθ2)−1).\nAlso,\n˙Fθ1(i)\n=\n[F 1\nθ1(i), . . . , F p1\nθ1(i)],\n˙Fθ2(i)\n=\n[F 1\nθ2(i), . . . , F p2\nθ2(i)],\nQ∗\ni\n=\n[Q∗\ni(1),\n. . . , Q∗\ni(p2)], P ∗\ni = [P ∗\ni(1), . . . , P ∗\ni(p1)], F r\nθ1(i) =\n∂Fθ1(i)\n∂θ1(r) , F s\nθ2(i) =\n∂Fθ2(i)\n∂θ2(s) , where θ1(r) and θ2(s) are the rth and sth\nelements of θ1 and θ2, respectively, r = 1, . . . , p1, s = 1, . . . , p2 and\nM ∗\ni = 1\nci\n\u0012\nIq2\ni −\nvec(Σi)vec(Σi)⊤\n2ci + vec(Σi)⊤vec(Σi)\n\u0013\n,\nQ∗\ni(s) =\n\u0012\n(ci −1)S1i(s) + 1\n2(ci + 8eωi)S2i(s)\n\u0013 \u0000Σ−1\ni\n⊗Σ−1\ni\n\u0001\nFθ2(i),\nP ∗\ni(r) =\n\u0010\n2η2i(Iqi ⊗ai(r)) + η1ivec(Σi)a⊤\ni(r)Σ−1\ni\n\u0011\nFθ1(i).\nAcknowledgement\nWe gratefully acknowledge the ﬁnancial the support from CNPq and FAPESP.\nReferences\n[1] Akaike, H. (1974). A new look at the statistical model identiﬁcation. IEEE Transactions on Automatic Control., 19\n716–723.\n[2] Bull, S.B., Mak, C. and Greenwood, C. (2002). A modiﬁed score function estimator for multinomial logistic regres-\nsion in small samples. Computational Statistical Data Analysis, 39 57–74.\n[3] Cao, C–Z, Lin, J–G and Zhu, X–X. (2012). On estimation of a heteroscedastic measurement error model under\nheavy-tailed distributions. Computational Statistics and Data Analysis, 56 438–448.\n[4] Cordeiro, G.M., Ferrari, S.L.P., Uribe-Opazo, M.A. and Vasconcellos, K.L.P. (2000). Corrected maximum-\nlikelihood estimation in a class of symmetric nonlinear regression models. Statistics and Probability Letters, 46\n317–328.\n[5] Cordeiro, G.M. and Klein, R. (1994). Bias correction in ARMA models. Statistics and Probability Letters, 19 169–\n176.\n22\n[6] Cordeiro, G.M. and McCullagh, P. (1991). Bias correction in generalized linear models. Journal of the Royal Statis-\ntical Society B, 53, 629–643.\n[7] Cox, D.R. and Hinkley, D.V. (1974). Theoretical Statistics. London: Chapman and Hall.\n[8] Cox, D.R. and Reid, N. (1987). Parameter orthogonality and approximate conditional inference (with discussion).\nJournal of the Royal Statistical Society B, 40, 1–39.\n[9] Cox, D.R. and Snell, E. (1968). A general deﬁnition of residuals (with discussion). Journal of the Royal Statistical\nSociety B, 30 248–275.\n[10] Cysneiros, F.J.A., Cordeiro, G.M. and Cysneiros, A.H.M.A. (2010). Corrected maximum likelihood estimators in\nheteroscedastic symmetric nonlinear models, Journal of Statistical Computation and Simulation, 80 451–461.\n[11] Doornik, J.A. (2013). Object-Oriented Matrix Programming using Ox. London: Timberlake Consultants Press\n(ISBN 978-0-9571708-1-0).\n[12] Fang, K.T., Kotz, S. and Ng, K.W. (1990). Symmetric Multivariate and Related Distributions. London: Chapman\nand Hall.\n[13] Firth, D. (1993). Bias reduction of maximum likelihood estimates. Biometrika, 80 27–38.\n[14] G´omez, E., G´omez-Villegas, M.A. and Mart´ın, J.M. (1998). A multivariate generalization of the power exponential\nfamily of distributions. Communications in Statistics. Part A: Theory and Methods, 27 589–600.\n[15] Hurvich, C.M. and Tsai, C.L. (1989). Regression and Time Series Model Selection in Small Samples. Biometrika,\n76 297–307.\n[16] Ihaka, R. and Gentleman, R. (1996). R: A language for data analysis and graphics. Journal of Computational\nGraphics and Statistics, 5 299–314.\n[17] Kosmidis I. (2014). Improved estimation in cumulative link models. Journal of the Royal Statistical Society, 76\n169–196.\n[18] Kosmidis I. and Firth, D. (2009). Bias reduction in exponential family nonlinear models. Biometrika, 96 793–804.\n[19] Kosmidis I. and Firth, D. (2011). Multinomial logit bias reduction via the Poisson log-linear model. Biometrika,\n98 755–759.\n[20] Kulathinal, S.B., Kuulasmaa, K. and Gasbarra, D. (2002). Estimation of an errors-in-variables regression model\nwhen the variances of the measurement error vary between the observations. Statistics in Medicine, 21 1089–1101.\n[21] Lange, K.L., Little, R.J.A. and Taylor, J.M.G. (1989). Robust statistical modeling using the t distribution. Journal\nof the American Statistical Association, 84 881–896.\n[22] Lawley, D.N. (1956). A general method for approximating to the distribution of likelihood ratio criteria. Biometrika,\n43 295–303.\n[23] Lemonte, A.J. (2011). Improved maximum-likelihood estimation in a regression model with general parametriza-\ntion. Journal of Statistical Computation and Simulation, 81 1027–1037.\n23\n[24] Lemonte, A.J. and Patriota, A.G. (2011). Multivariate elliptical models with general parameterization. Statistical\nMethodology, 8 389–400.\n[25] Lucas, A.(1997). Robustness of the Student t based M-estimator. Communications in Statistics, Theory and Meth-\nods, 26 1165–1182.\n[26] Magnus, J.R. and Neudecker, H. (2007). Matrix Differential Calculus with Applications in Statistics and Econo-\nmetrics. Chichester: Wiley, third edition.\n[27] Mehrabi, Y. and Matthews, J.N.S. (1995). Likelihood-based methods for bias reduction in limiting dilution assays.\nBiometrics, 51 1543–1549.\n[28] Mitchell, A.F.S. (1989). The information matrix, skewness tensor and α-connections for the general multivariate\nelliptical distribution. Annals of the Institute of Statistical Mathematics, 41 289–304.\n[29] Patriota, A.G. (2011). A note on inﬂuence in nonlinear mixed-effects elliptical models. Computational Statistics\nand Data Analysis, 51 218–225.\n[30] Patriota, A.G., Bolfarine, B. and de Castro, M. (2009a). A heteroscedastic structural errors-in-variables model with\nequation error. Statistical Methodology, 6 408–423.\n[31] Patriota, A.G. and Lemonte, A.J. (2009). Bias correction in a multivariate normal regression model with general\nparameterization. Statistics & Probability Letters, 79 1655–1662.\n[32] Patriota, A.G., Lemonte, A.J. and Bolfarine, H. (2009b). Improved maximum likelihood estimators in a het-\neroskedastic errors-in-variables model. Statistical Papers, 52 455–467.\n[33] Pettitt, A.N., Kelly, J.M. and Gao, J.T. (1998). Bias correction for censored data with exponential lifetimes. Statis-\ntica Sinica, 8 941–964.\n[34] Rosillo, F.G., Chivelet, N.M. (2009). Lifetime prediction of ﬂuorescent lamps used in photovoltaic systems. Light-\ning Research and Technology, 41 (2) 183–197.\n[35] Schwarz, G. (1978). Estimating the dimensional of a model. Annals of Statistics, 6 461–464.\n[36] Tiede, J.J. and Pagano, M. (1979). Application of robust calibration to radioimmunoassay. Biometrics, 35 567–574.\n[37] Vanegas, L.H. and Paula, G.A. (2014). Log–symmetric distributions:\nstatistical properties and parame-\nter estimation. Brazilian Journal of Probability and Statistics. Accepted for publication. Available online at\nhttp://www.imstat.org/bjps/papers/BJPS272.pdf; accessed on 2015-06-23.\n[38] Vanegas, L.H. and Paula, G.A. (2015). A semiparametric approach for joint modeling of median and skewness.\nTest, 24 110–135.\n[39] Vasconcellos, K.L.P. and Cordeiro, G.M. (2000). Bias corrected estimates in multivariate Student t regression\nmodels. Communications in Statistics, Theory and Methods, 29 797–822.\n24\n"}