{"text": "arXiv:1605.04055v1  [stat.ME]  13 May 2016\nBayesian D-optimal designs for error-in-variables models\nto the memory of Kathryn Chaloner\nMaria Konstantinou and Holger Dette\nRuhr-Universit¨at Bochum\nFakult¨at f¨ur Mathematik\n44780 Bochum, Germany\nAbstract\nBayesian optimality criteria provide a robust design strategy to parameter misspeci-\nﬁcation. We develop an approximate design theory for Bayesian D-optimality for non-\nlinear regression models with covariates subject to measurement errors. Both maximum\nlikelihood and least squares estimation are studied and explicit characterisations of the\nBayesian D-optimal saturated designs for the Michaelis-Menten, Emax and exponential\nregression models are provided. Several data examples are considered for the case of no\npreference for speciﬁc parameter values, where Bayesian D-optimal saturated designs are\ncalculated using the uniform prior and compared to several other designs, including the\ncorresponding locally D-optimal designs, which are often used in practice.\nKeywords: error-in-variables models, classical errors, Bayesian optimal designs, D-optimality\nAMS Subject Classiﬁcation: 62K05\n1\nIntroduction\nLocally optimal designs, as termed by Chernoﬀ[1953], depend on the model parameters when\nthe model generating the data is nonlinear. In many cases these parameters are unknown at\nthe design stage and therefore, a best guess of the parameter values is required for the locally\noptimal designs to be used in practice. This approach however, can result in ineﬃcient designs\n1\nif the parameters are misspeciﬁed. Hence there is the need to overcome this dependence and\nconstruct robust designs that estimate the model parameters with high precision and thus\nperform well even when there is imperfect knowledge of the true parameter values.\nIn many practical situations some information about the parameter values, such as a range of\nplausible values, can be provided by the experimenter. Based on such an uncertainty space a\nrobust design strategy is that of Bayesian optimal designs introduced by Pronzato and Walter\n[1985], Chaloner [1989] and Chaloner and Larntz [1989]. Bayesian optimality incorporates the\nparameter uncertainty in the formulation of the optimality criteria through a prior distribution\non the parameter space and the proposed criteria are based on classical optimality criteria (see,\nfor example, Chaloner [1993] and Chaloner and Verdinelli [1995] for more details). Therefore,\nmany of the well established results of classical design theory can be directly extended to the\nBayesian framework. The construction of Bayesian optimal designs for several regression models\nhas been studied by many authors such as Chaloner and Larntz [1992], Dette and Neugebauer\n[1997], Han and Chaloner [2003], Dette et al. [2007] and Burghaus and Dette [2014].\nIn this paper we investigate Bayesian optimal designs for a class of error-in-variables models,\nthat is, of regression models where one or more of the covariates involved cannot be observed\ndirectly. The relationship between the true (unobserved) and observed covariates is described\nby the error model and according to its structure a distinction is made between the classical\nand Berkson errors. For a detailed review see, for example, Fuller [1987] and Carroll et al.\n[1995]. Our focus is on classical errors which include the sampling and instrument recording\nerrors frequently arising in practice.\nDespite of their importance, the literature on optimal designs for error-in-variables models with\nclassical errors is rather scarce [see Keeler and Reilly [1992] and Dovi et al. [1993] for early\nreferences]. Recently, Konstantinou and Dette [2015] develop an approximate optimal design\ntheory for local optimality criteria in error-in-variables models with classical errors and provide\nanalytical results on locally D-optimal designs for some commonly used nonlinear models when\nthese are subject to the classical error structure. This paper extends their work and provides\nthe corresponding approximate design theory for Bayesian optimality. We thus obtain designs\nwhich are optimal for parameter estimation and robust over the speciﬁed parameter space.\nIn Section 2 we introduce the approximate design problem in the context of error-in-variables\nmodels subject to classical errors and present the limiting properties of the maximum likelihood\nand least squares estimators. The approximate design theory for Bayesian optimality is then\nprovided in Section 3 along with the general equivalence theorem and a suﬃcient condition\nfor Bayesian D-optimality for maximum likelihood and least squares estimation, respectively.\nIn Section 4 we provide analytical characterisations of Bayesian D-optimal saturated designs\nfor the Michaelis-Menten, Emax and exponential regression models when these are subject to\nclassical errors. Finally, in Section 5 we consider the case of a uniform prior on the parameter\nspace. Via several data examples, we establish the superiority of the resulting Bayesian D-\n2\noptimal designs by comparing them to the corresponding locally D-optimal designs, explicitly\ndeﬁned in Konstantinou and Dette [2015], as well as to other designs frequently used in practice.\n2\nApproximate designs and parameter estimation\nWe assume that the observations are generated by a nonlinear model and consider a repeated\nobservations set-up under which a total of ri (i = 1, . . . , n) measurements are taken at each\nof the ﬁxed experimental conditions x1, . . . , xn.\nWe further assume that one is unable to\nobserve the true covariate values xi’s, i = 1, . . . , n, directly due to measurement errors such as\nsampling and instrumental error. Therefore, a classical error model specifying the conditional\ndistribution of the observed given the true (unobserved) covariates is considered. Throughout\nthis paper we assume classical additive errors, that is,\nYij = m(xi, θ) + ηij,\ni = 1, . . . , n;\nj = 1, . . . , ri\nXij = xi + εij,\n(2.1)\nwhere θ = (θ0, . . . , θp)T is the vector of unknown model parameters, xi = (xi1, . . . , xiq)T ∈X\nis the vector of true covariates with X ⊂Rq denoting the design space and Xij denotes the\nobserved vector of the jth repeated measurement at the ith experimental condition. Further-\nmore, the vectors (ηij, εij)T of response errors ηij and covariate errors εij are assumed to be\nindependent and identically normally distributed with mean 0 and variance covariance ma-\ntrix Σηε being positive deﬁnite and the regression function m(x, θ) is continuous and twice\ndiﬀerentiable with respect to both x and θ.\nWe consider approximate designs in the sense of Kiefer [1974] which are deﬁned as probability\nmeasures on the design space X with ﬁnite support. Using the limiting relation\nlim\nri→∞\nri\nr = ωi > 0,\ni = 1, . . . , n,\nwhere r = Pn\ni=1 ri denotes the total sample size, an approximate design is of the form\nξ =\n\n\n\n\n\n\n\nx1 . . . xn\nω1 . . . ωn\n\n\n\n\n\n\n\n,\n0 < ωi ≤1,\nn\nX\ni=1\nωi = 1,\nwhere the xi’s and ωi’s are called support points and weights of the design, respectively. The\ngoal of the experiment is to estimate the parameters of the underlying model in (2.1) involving\nthe true covariates. In an error-in-variables models set-up however, the true covariate values are\nunobservable and thus unknown. Therefore, an approximate design provides the experimenter\nwith target values for the true covariates xi, i = 1, . . . , n which he would then try to achieve\nthrough the observed covariate values Xij, i = 1, . . . , n; j = 1, . . . , ri.\n3\nFollowing the methodology in Fuller [1987], Konstantinou and Dette [2015] derived the asymp-\ntotic properties of the maximum likelihood and least squares estimators for the parameter\nvector denoted by ˆθML and ˆθLS respectively. In particular, under assumptions of regularity,\n√r(ˆθML −θtrue)\nL−→N(0, M−1\nML(ξ, θ)),\nand\n√r(ˆθLS −θtrue)\nL−→N(0, M−1\nLS(ξ, θ)),\nwhere\nL−→denotes convergence in distribution and the information matrices MML(ξ, θ) and\nMLS(ξ, θ) are given by\nMML(ξ, θ) =\nZ\nX\n1\nσ1(x, θ)\n\u0010∂m(x, θ)\n∂θ\n\u0011\u0010∂m(x, θ)\n∂θ\n\u0011T\ndξ(x)\n(2.2)\nMLS(ξ, θ) = D0(ξ, θ)D−1\n1 (ξ, θ)D0(ξ, θ),\n(2.3)\nwith\nDk(ξ, θ) =\nZ\nX\n[σ1(x, θ)]k\nσ0(x, θ)\n\u0010∂m(x, θ)\n∂θ\n\u0011\u0010∂m(x, θ)\n∂θ\n\u0011T\ndξ(x),\nk = 0, 1,\n(2.4)\nσk(x, θ) =\n\u0012\n1,\n\u0010∂m(x, θ)\n∂x\n\u0011T\u0013\n(Σηε)k\n\u0012\n1,\n\u0010∂m(x, θ)\n∂x\n\u0011T\u0013T\n,\nk = 0, 1.\n(2.5)\n3\nBayesian D-optimal saturated designs\nA locally optimal design maximises an appropriate concave functional of the information matrix,\nhere MML(ξ, θ) or MLS(ξ, θ), called an optimality criterion. In general, locally optimal designs\ndepend on the unknown parameter vector θ which must be speciﬁed for their implementation.\nThe Bayesian approach on the other hand, takes into account any prior information available\nfor θ leading to more robust optimality criteria.\nWe consider the construction of Bayesian D-optimal designs introduced by Pronzato and Walter\n[1985] and Chaloner and Larntz [1989]. Let θ ∈Θ, where Θ ⊂Rp+1 and also let π denote a\nprior distribution on the parameter space Θ. A design ξ∗\nπ is called Bayesian D-optimal with\nrespect to the prior π for models of the form (2.1) if it maximises the function\nΦπ(ξ) =\nZ\nΘ\nlog |M(ξ, θ)| π(dθ),\n(3.1)\nwhere the information matrix M(ξ, θ) is that corresponding to maximum likelihood or least\nsquares estimation, given in equations (2.2) and (2.3) respectively, according to the preferable\nestimation method for the parameter vector.\nIn the case of maximum likelihood estimation the criterion (3.1) is concave with respect to the\ndesign ξ. Hence using Theorem 3.3 in Dette et al. [2007], the general equivalence theorem for\n4\ncharacterising and checking Bayesian D-optimality of a candidate design for models of the form\n(2.1) is given below.\nTheorem 3.1. A design ξ∗\nπ is Bayesian D-optimal with respect to the prior π for maximum\nlikelihood estimation in model (2.1) if and only if the inequality\nZ\nΘ\ndML(x, ξ∗\nπ, θ) π(dθ) :=\nZ\nΘ\n\u0010∂m(x, θ)\n∂θ\n\u0011T M−1\nML(ξ∗\nπ, θ)\nσ1(x, θ)\n\u0010∂m(x, θ)\n∂θ\n\u0011\nπ(dθ) ≤p + 1,\nholds for all x ∈X . Furthermore, the maximum is achieved at the support points of ξ∗\nπ.\nOn the other hand, when the vector of model parameters θ is estimated via least squares the\nmapping ξ →MLS(ξ, θ) and thus the optimality criterion (3.1) is not concave. However, the\nfollowing theorem provides a necessary condition for Bayesian D-optimality. That is, a design\nthat does not satisfy this condition cannot be Bayesian D-optimal.\nTheorem 3.2. If the design ξ∗\nπ is Bayesian D-optimal with respect to the prior π for least\nsquares estimation in model (2.1), then the inequality\nZ\nΘ\ndLS(x, ξ∗\nπ, θ) π(dθ) :=\nZ\nΘ\n2d0(x, ξ∗\nπ, θ) −σ1(x, θ)d1(x, ξ∗\nπ, θ) π(dθ) ≤p + 1,\nholds for all x ∈X , where\ndk(x, ξ∗\nπ, θ) =\n\u0010∂m(x, θ)\n∂θ\n\u0011T D−1\nk (ξ∗\nπ, θ)\nσ0(x, θ)\n\u0010∂m(x, θ)\n∂θ\n\u0011\nπ(dθ),\nk = 0, 1.\nFurthermore, the maximum is achieved at the support points of ξ∗\nπ.\nFor purposes of comparison with the corresponding locally D-optimal designs found in Konstantinou and Det\n[2015], in what follows we study saturated designs. These are designs that have the same num-\nber of support points as the dimension p + 1 of the parameter vector θ. Lemma 3.1 shows\nthat regardless of the estimation method the Bayesian D-optimal saturated design is equally\nweighted.\nLemma 3.1. The Bayesian D-optimal saturated design with respect to the prior π for maximum\nlikelihood or least squares estimation in model (2.1), puts equal weights at its support points.\nRemark 3.1. If we also take into account uncertainty on the response and covariate errors\nwhich are assumed to be (ηij, εij)T\niid\n∼N(0, Σηε) (i = 1, . . . , n; j = 1, . . . , ri), the Bayesian\nD-optimality criterion becomes\nΦπ1,π2(ξ) =\nZ\nΣ\nZ\nΘ\nlog |M(ξ, θ)| π1(dθ) π2(dΣηε),\n(3.2)\nwhere π1 is a prior distribution on the parameter space Θ and π2 is a prior distribution on\nthe space of positive deﬁnite covariance matrices Σ. Then for a Bayesian D-optimal design\nwith respect to the priors π1 and π2 maximising (3.2), Lemma 3.1 still holds. Furthermore, the\nstatements of Theorems 3.1 and 3.2 are also true, where the integration has to be performed\nalso with respect to the prior π2.\n5\n4\nApplication to speciﬁc nonlinear models\nIn this section we specify the underlying regression function m(xi, θ) and in particular, we\nconsider three nonlinear models widely used in applications for the modelling of the dose-\nresponse relationship. Namely, we consider we consider the Michaelis-Menten and Emax models\nspeciﬁed by\nm1(x, θ) =\nθ1x\n(θ2 + x),\n(x ∈[0, xu] ⊂R+\n0 ),\n(4.1)\nand\nm2(x, θ) = θ0 +\nθ1x\nθ2 + x,\n(x ∈[0, xu] ⊂R+\n0 ),\n(4.2)\nrespectively, and also the three-parameter exponential regression model given by\nm3(x, θ) = θ0 + θ1e−θ2x\n(x ∈[0, xu] ⊂R+\n0 ).\n(4.3)\nIn the Michaelis-Menten model the parameter θ1 > 0 is the maximum achievable response and\nθ2 > 0 is the dose x where the response is half-maximal. Similarly in the Emax model, θ1 and\nθ2 are the asymptotic maximum increase of the response and the dose producing half of the\nasymptotic maximum eﬀect respectively and θ0 ≥0 is the placebo eﬀect, that is, the response\nat dose x = 0. Finally, for the three-parameter exponential regression model the parameter\nθ1 > 0 is involved in the placebo eﬀect along with θ0 ≥0 and θ2 ∈R\\{0} describes the rate\nof the dose eﬀect. The construction of optimal designs in the case of no measurement error in\nthe covariates has been discussed by Dette et al. [2010], Rasch [1990] and Han and Chaloner\n[2003] for the Michaelis-Menten, the Emax and the exponential regression model, respectively,\namong others.\nFor the sake of simplicity we further assume that for these univariate models the response\nand covariate errors are uncorrelated. Therefore, the variance-covariance matrix of the vector\nmeasurement errors given in (2.1) and the σ-functions deﬁned in (2.5) become\nΣηε =\n\n\n\n\nσ2\nη\n0\n0 σ2\nε\n\n\n\n,\nσ0(x, θ) = 1 +\n\u0010∂m(x, θ)\n∂x\n\u00112\n,\nσ1(x, θ) = σ2\nη +\n\u0010∂m(x, θ)\n∂x\n\u00112\nσ2\nε.\nIn the following two theorems we derive the Bayesian D-optimal saturated designs for maximum\nlikelihood estimation in each of the aforementioned nonlinear models with measurement errors\nas in (2.1). Using these analytical characterisations the design problem is reduced to ﬁnding\nthe solution of an equation in one variable and therefore, the numerical eﬀort for design search\nreduces substantially.\nTheorem 4.1. The Bayesian D-optimal saturated design with respect to a prior π for maximum\nlikelihood estimation in the Michaelis-Menten model (4.1) with measurement errors as in (2.1)\n6\nis equally supported at points x∗\n1 and xu, whereas for the Emax model (4.2) with measurement\nerrors as in (2.1) it is equally supported at points 0, x∗\n1 and xu. The non-trivial support point\nx∗\n1 ∈(0, xu) is a solution of the equation\nZ\nΘ\n1\nx1\n−\n1\nxu −x1\n−\n2(θ2 + x1)3\n(θ2 + x1)4 + θ2\n1θ2\n2̺2\nεη\nπ(dθ) = 0,\n(4.4)\nin the interval (0, xu), where ̺2\nεη = σ2\nε/σ2\nη.\nTheorem 4.2. The Bayesian D-optimal saturated design with respect to a prior π for maximum\nlikelihood estimation in the exponential regression model (4.3) with measurement errors as in\n(2.1) is equally supported at points 0, x∗\n1 and xu. The non-trivial support point x∗\n1 ∈(0, xu) is\na solution of the equation\nZ\nΘ\n1 −eθ2xu + θ2xueθ2x1\nx1 −xu + xueθ2x1 −x1eθ2xu −\nθ2e2θ2x1\ne2θ2x1 + θ2\n1θ2\n2̺2εη\nπ(dθ) = 0,\n(4.5)\nin the interval (0, xu), where ̺2\nεη = σ2\nε/σ2\nη.\nThe corresponding analytical results for Bayesian D-optimal saturated designs for least squares\nestimation are given below. We note that in the case of Theorem 4.4 the two non-trivial support\npoints of the design can only be evaluated using numerical optimisation.\nTheorem 4.3. The Bayesian D-optimal saturated design with respect to a prior π for least\nsquares estimation in the Michaelis-Menten model (4.1) with measurement errors as in (2.1)\nputs equal masses at points x∗\n1 and xu, whereas for the Emax model (4.2) with measurement\nerrors as in (2.1) it puts equal masses at points 0, x∗\n1 and xu. The non-trivial support point\nx∗\n1 ∈(0, xu) is a solution of the equation\nZ\nΘ\n1\nx1\n−\n1\nxu −x1\n−\n2(θ2 + x1)3\n(θ2 + x1)4 + θ2\n1θ2\n2̺2εη\n+\n2θ2\n1θ2\n2\n(θ2 + x1)[(θ2 + x1)4 + θ2\n1θ2\n2] π(dθ) = 0,\n(4.6)\nin the interval (0, xu) and ̺2\nεη = σ2\nε/σ2\nη.\nTheorem 4.4. The Bayesian D-optimal saturated design with respect to a prior π for least\nsquares estimation in the exponential regression model (4.3) with measurement errors as in\n(2.1) is always supported at the larger end-point xu of the design space.\nRemark 4.1. With the assumption of uncorelated response and covariate errors, the prior π2\non the space of matrices Σ reduces to a prior on the space of the corresponding error variances\nσ2\nη and σ2\nε, which is a subset of R2. Using the Bayesian D-optimality criterion (3.2) instead\nof (3.1), does not aﬀect the characteristics of the Bayesian D-optimal saturated designs with\nrespect to π1 and π2 which remain the same as described in Theorems 4.1-4.4. In each case,\n7\nthe value of the non-trivial support point does change however, as it is a solution of a diﬀerent\nequation. For example, in the case of Theorem 4.1, the analogous of equation (4.4) is\nZ\nR+\nZ\nΘ\n1\nx1\n−\n1\nxu −x1\n−\n2(θ2 + x1)3\n(θ2 + x1)4 + θ2\n1θ2\n2̺2εη\nπ1(dθ) π2(d̺2\nεη) = 0,\nwhere here π2 is a prior on the ratio ̺2\nεη = σ2\nε/σ2\nη which is induced by the given prior on the\nspace of error variances.\n5\nData example\nThe theoretical results of the previous section are now illustrated via several data examples. In\nwhat follows, a uniform prior distribution is used on the parameter space corresponding to the\ncase of no preference for speciﬁc parameter values. Under this concept there is no need for the\nexperimenter to specify a prior, thereby avoiding a step that is often diﬃcult in practice. A\nnumber ν of equally spaced values are taken from each of the parameter’s uncertainty intervals\nand the resulting prior points on the entire parameter space are equally likely to be observed.\nWe note that when the “true” parameter values are not speciﬁed (Tables 1 and 4) the eﬃciency\nof a design ξ is calculated via\neﬀ(ξ) =\nexp{\n1\np+1Φπ(ξ)}\nexp{\n1\np+1Φπ(ξ∗\nBay)} = exp\nn\n1\np + 1[Φπ(ξ) −Φπ(ξ∗\nBay)]\no\n,\n(5.1)\nwhere ξ∗\nBay is the Bayesian D-optimal saturated design for the prior π and a speciﬁc error-ratio\nvalue ̺2\nεη. Finally, when nominal values for the parameters are considered for the calculations\n(Tables 2 and 3), we use the D-eﬃciency deﬁned for a design ξ as\neﬀD(ξ) =\n\u0012 det{M(ξ, θ)}\ndet{M(ξ∗\nθ, θ)}\n\u00131/p+1\n,\n(5.2)\nwhere p + 1 is the number of model parameters and ξ∗\nθ is the locally D-optimal design for\nerrors-in-variables models with classical errors using the parameter values vector θ, explicitly\ndeﬁned in Konstantinou and Dette [2015].\nWe begin with an investigation of how the Bayesian D-optimal saturated designs change in\nthe presence of error in the covariates. For this purpose we consider an example discussed\nin Mihara et al. [2000].\nThese authors model the velocity of a biochemical reaction (CSD-\nplus pyrovate) with respect to the concentration of a substrate (L-cysteine sulﬁnate) via the\nMichaelis-Menten model. The design space in this example is X = [0, 80] and the obtained\nparameter estimates are (θ1, θ2) = (16, 3.5). However, in their set-up Mihara et al. [2000] do\nnot take into account possible errors in the measurement of the substrate concentration. Such\n8\nerrors are the result of instrument recording errors which, as mentioned in the introduction,\ncorrespond to the classical error structure.\nTo study the case where a parameter space is provided by the experimenter, we use the estimates\nstated above as a starting point for the choice of an uncertainty space.\nIn particular, we\nconsider the parameter space Θ = [8, 24] × [1.75, 5.25] which corresponds to the ±50% region\naround the point of parameter estimates. Using Theorems 4.1 and 4.3 we ﬁnd the Bayesian\nD-optimal two-point designs for maximum likelihood and least squares estimation respectively\nin the Michaelis-Menten model (4.1) with classical errors as in (2.1). Table 1 presents the\nsupport points of these designs for various values of the error-variances ratio ̺2\nεη = σ2\nε/σ2\nη. For\nthese calculations two uniform priors are considered, using ν = 5 and ν = 11 equally-spaced\nvalues from each of the parameter space intervals [8, 24] and [1.75, 5.25]. Note that the point\n(θ1, θ2) = (16, 3.5) of the parameter estimates is included in the resulting prior points for both\npriors. We also calculate the eﬃciencies (5.1) of the Bayesian designs assuming no error in the\ncovariates, that is, ̺2\nεη = 0 which are also given in Table 1. Using a uniform prior with ν = 11\nthis design is equally supported at points 3.06 and 80 for maximum likelihood estimation and\nat points 5.82 and 80 when the parameters are estimated via least squares.\nAs for the case of locally D-optimal designs discussed in Konstantinou and Dette [2015], taking\nthe error in the covariate into account results in the non-trivial support point of the Bayesian\nD-optimal design to move further away from x = 0 compared to its value when ̺2\nεη is assumed\nto be zero. As the ̺2\nεη-value becomes larger, the value of the non-trivial support point increases\nfurther. The choice of estimation method also seems to have an eﬀect on the Bayesian D-optimal\ndesign with the non-trivial support point of the design for least squares estimation always being\nlarger. Furthermore, the Bayesian D-optimal design assuming no error in the covariate has\neﬃciency less that 90% for some error-variances ratio values ̺2\nεη > 0. Most importantly, even\nif the covariate error variance σ2\nε is small but equal to the response error variance σ2\nη (hence\n̺2\nεη = 1), the eﬃciency of the Bayesian design ignoring the covariate error is 82.44% if the\nparameters are estimated via maximum likelihood. Therefore, the usual strategy of ignoring\nthe covariate error if it is believed to be small can result in ineﬃcient designs. We ﬁnally note\nthat the Bayesian design using ν = 11 turned out to have eﬃciencies of approximately 100%\nwhen compared with the corresponding Bayesian design for ν = 101. Hence for the rest of this\nsection the uniform prior with ν = 11 is used.\nWe now assess the robustness of Bayesian D-optimal saturated designs against misspeciﬁcations\nof the model parameters. Konstantinou and Dette [2015] use data discussed in Frisillo and Stewart\n[1980] on how the wave velocity of ultrasonic signals relates to the percent gas-brine saturation.\nIn this example the use of error-in-variables models is justiﬁed by the possible false measure-\nment of the intensity of an X-ray beam, which is then used to determine the percentage of\ngas-brine saturation (see Frisillo and Stewart [1980] for more details). Konstantinou and Dette\n[2015] ﬁt the exponential regression model (4.3) to the data and obtain the parameter estimates\n9\nTable 1: Left part: Support points of the Bayesian D-optimal two-point designs using a uniform\nprior with ν = 5 or ν = 11 values for each parameter. Right part: Eﬃciencies (%) of the\nBayesian D-optimal two-point design (ν = 11) for ̺2\nεη = 0.\nSupport points\n̺2\nεη\nEstimation Method\nν = 5\nν = 11\nEﬃciencies (%)\n4/1\nMLE\n(8.02,80)\n(8.12,80)\n62.92\nLSE\n(9.14,80)\n(9.21,80)\n84.68\n2/1\nMLE\n(6.79,80)\n(6.86,80)\n72.96\nLSE\n(8.14,80)\n(8.19,80)\n91.48\n1/1\nMLE\n(5.77,80)\n(5.82,80)\n82.44\nLSE\n(7.36,80)\n(7.40,80)\n95.97\n1/2\nMLE\n(4.94,80)\n(4.99,80)\n90.11\nLSE\n(6.78,80)\n(6.82,80)\n98.38\n1/4\nMLE\n(4.30,80)\n(4.34,80)\n95.26\nLSE\n(6.37,80)\n(6.42,80)\n99.44\n(θ0, θ1, θ2) = (1210, 66.07, 0.0696). Then using these estimates and assuming that ̺2\nεη = 1, they\nﬁnd the locally D-optimal designs on the design space X = [0, 35] for model (4.3) with errors\nas in (2.1), which are given by\nξMLE\nloc\n=\n\n\n\n\n0\n17.23 35\n1/3\n1/3\n1/3\n\n\n\n,\nξLSE\nloc\n=\n\n\n\n\n1.26 21.54 35\n1/3\n1/3\n1/3\n\n\n\n,\n(5.3)\nfor maximum likelihood and least squares estimation respectively.\nFor the construction of the corresponding Bayesian D-optimal designs we consider the param-\neter space Θ = {1210} × [33, 100] × [0.01, 0.3]. The estimate for θ0 is used since this parameter\ndoes not aﬀect the design and the interval used for θ1 corresponds roughly to the ±50% interval\naround its estimate. The estimate for the parameter θ2 = 0.0696 suggests a very small dose ef-\nfect. Hence the corresponding uncertainty interval is chosen such that larger rates of dose eﬀect\n10\nare considered. Theorem 4.2 provides a complete analytical characterisation of the Bayesian\nD-optimal three-point design for maximum likelihood estimation. In the case of least squares\nestimation Theorem 4.4 only provides us with the larger support point and the weights of the\ndesign and thus the other two support points were found numerically using the Particle Swarm\nOptimisation (PSO) algorithm (see, for example, Clerc [2006]). Assuming that ̺2\nεη = 1, the\nBayesian D-optimal three-point designs for maximum likelihood and least squares estimation\nin model (4.3) with errors as in (2.1) are given by\nξMLE\nBay\n=\n\n\n\n\n0\n11.59 35\n1/3\n1/3\n1/3\n\n\n\n,\nξLSE\nBay =\n\n\n\n\n6.79 16.33 35\n1/3\n1/3\n1/3\n\n\n\n.\n(5.4)\nThe following two tables present the eﬃciencies of the locally and Bayesian D-optimal designs,\ngiven in (5.3) and (5.4) respectively, along with the eﬃciencies of the uniform design ξuni\nallocating equal weights at points 0, 17.5 and 35, for the four end-points of the parameter\nspace.\nWe thus examine the eﬃciencies (5.2) of these designs when the “true” parameter\nvalues are equal to either one of the extreme values of their corresponding uncertainty interval.\nTable 2 presents the eﬃciencies for the case of maximum likelihood estimation whereas the\ncorresponding results for least squares estimation are given in Table 3.\nTable 2: Eﬃciencies (%) of the locally and Bayesian D-optimal three-point designs for maxi-\nmum likelihood estimation assuming ̺2\nεη = 1 and of the uniform design on X = [0, 35].\nEﬃciencies (%)\n(θ1, θ2)\nξMLE\nloc\nξMLE\nBay\nξuni\n(33, 0.01)\n99.91\n94.25\n99.82\n(33, 0.3)\n31.57\n73.09\n30.20\n(100, 0.01)\n100\n93.09\n99.97\n(100, 0.3)\n49.30\n96.45\n47.23\nAverage\n70.20\n89.22\n69.31\nWe observe that for both estimation methods the eﬃciencies of the designs ﬂuctuate, with the\nBayesian D-optimal design always being more robust. Although in the case of least squares\nestimation the Bayesian design has eﬃciencies below 90%, it has the largest average eﬃciency.\n11\nTable 3: Eﬃciencies (%) of the locally and Bayesian D-optimal three-point designs for least\nsquares estimation assuming ̺2\nεη = 1 and of the uniform design on X = [0, 35].\nEﬃciencies (%)\n(θ1, θ2)\nξLSE\nloc\nξLSE\nBay\nξuni\n(33, 0.01)\n88.61\n59.16\n99.86\n(33, 0.3)\n15.17\n58.82\n24.40\n(100, 0.01)\n90.94\n61.03\n99.99\n(100, 0.3)\n15.39\n75.17\n24.27\nAverage\n52.53\n63.55\n62.13\nThis is due to the fact that the choice of a uniform prior for the construction of the Bayesian\nD-optimal designs results in the average, over the parameter space, of the values for the deter-\nminant of the information matrix to be maximised. Therefore, when there is no preference for\nspeciﬁc parameter values, the use of the Bayesian design is a consistently more eﬃcient choice\navoiding the risk of having an extremely ineﬃcient design if the parameters are misspeciﬁed.\nThroughout this paper the response and covariate errors are assumed to be known at least up\nto the value of the error-variances ratio ̺2\nεη. However, ̺2\nεη does aﬀect the optimal choice of the\nBayesian design (see Table 1). We thus conclude this section with a robustness assessment of the\nBayesian D-optimal designs with respect to misspeciﬁcation of the ̺2\nεη-value. In particular, we\nuse equation (5.1) to calculate the eﬃciencies of the Bayesian D-optimal designs for ̺2\nεη = 1,\ngiven in (5.4), and of the uniform design three-point design ξuni on X = [0, 35] when the\nBayesian D-optimal design ξ∗\nBay corresponds to various other ̺2\nεη-values. The results are given\nin Table 4\nIt is evident that under both estimation methods the Bayesian D-optimal design assuming equal\nresponse and covariate errors is extremely robust and eﬃcient against misspeciﬁcation of the\nerror-variances ratio value ̺2\nεη. On the contrary the “oﬀthe shelf” uniform design commonly\nused in practice has eﬃciencies well below 90%.\n12\nTable 4: Eﬃciencies (%) of the Bayesian D-optimal three-point designs assuming ̺2\nεη = 1 and\nof the uniform three-point designs on X = [0, 35].\nEﬃciencies\n̺2\nεη\nEstimation Method\nξBay\nξuni\n4/1\nMLE\n97.48\n91.51\nLSE\n97.66\n74.02\n2/1\nMLE\n99.32\n86.93\nLSE\n99.37\n75.13\n1/1\nMLE\n100\n81.77\nLSE\n100\n76.08\n1/2\nMLE\n99.30\n76.43\nLSE\n99.28\n76.99\n1/4\nMLE\n97.34\n71.35\nLSE\n96.95\n78.04\nAcknowledgements This work has been supported in part by the Collaborative Research\nCenter “Statistical modeling of nonlinear dynamic processes” (SFB 823, Teilprojekt C2) of the\nGerman Research Foundation (DFG).\nReferences\nI. Burghaus and H. Dette. Optimal designs for nonlinear regression models with respect to\nnon-informative priors. Journal of Statistical Planning and Inference, 154:12–25, 2014.\nR.J. Carroll, D. Ruppert, and L.A. Stefanski. Measurement Error in Nonlinear Models. Taylor\n& Francis, 1995.\nK. Chaloner. Bayesian design for estimating the turning point of a quadratic regression. Comm.\nStatist., Theory Methods, 18(4):1385–1400, 1989.\nK. Chaloner. A note on optimal bayesian design for nonlinear problems. Journal of Statistical\n13\nPlanning and Inference, 37(2):229 – 235, 1993.\nK. Chaloner and K. Larntz. Optimal bayesian design applied to logistic regression experiments.\nJournal of Statistical Planning and Inference, 21(2):191 – 208, 1989.\nK. Chaloner and K. Larntz. Bayesian design for accelerated life testing. Journal of Statistical\nPlanning and Inference, 33(2):245 – 259, 1992.\nK. Chaloner and I. Verdinelli. Bayesian experimental design: A review. Statistical Science, 10\n(3):273–304, 1995.\nH. Chernoﬀ. Locally optimal designs for estimating parameters. The Annals of Mathematical\nStatistics, 24(4):586–602, 1953.\nM. Clerc. Particle Swarm Optimization. Iste Publishing Company, London, 2006.\nH. Dette and H. M. Neugebauer. Bayesian d-optimal designs for exponential regression models.\nJournal of Statistical Planning and Inference, 60:331–349, 1997.\nH. Dette, L. M. Haines, and L. A. Imhof. Maximin and bayesian optimal designs for regression\nmodels. Statistica Sinica, 17:463–480, 2007.\nH. Dette, C. Kiss, M. Bevanda, and F. Bretz. Optimal designs for the EMAX, log-linear and\nexponential models. Biometrika, 97(2):513–518, 2010.\nV. G. Dovi, A. P. Reverberi, and L. Maga.\nOptimal design of sequential experiments for\nerror-in-variables models. Computers & Chemical Engineering, 17(1):111 – 115, 1993.\nA. L. Frisillo and T. J. Stewart. Eﬀect of partial gas/brine saturation on ultrasonic absorption\nin sandstone. Journal of Geophysical Research, 85(B10):5209–5211, 1980.\nW. A. Fuller. Measurement Error Models. Wiley, New York, 1987.\nC. Han and K. Chaloner. D-and c-optimal designs for exponential regression models used in\npharmacokinetics and viral dynamics. Journal of Statistical Planning and Inference, 115:\n585–601, 2003.\nS. Keeler and P. Reilly. The design of experiments when there are errors in all the variables.\nCanadian Journal of Chemical Engineering, 70:774–778, 1992.\nJ. Kiefer. General equivalence theory for optimum designs (approximate theory). The Annals\nof Statistics, 2(5):849–879, 1974.\nM. Konstantinou and H. Dette.\nLocally optimal designs for errors-in-variables models.\nBiometrika, 102(4):951–958, 2015.\nH. Mihara, T. Kurihara, T. Yoshimura, and N. Esaki. Kinetic and mutational studies of three\nNifS homologs from escherichia coli: Mechanistic diﬀerence between L-Cysteine Desulfurase\nand L-Selenocysteine Lyase Reactions. Journal of Biochemistry, 127(4):559–567, 2000.\nL. Pronzato and E. Walter. Robust experiment design via stochastic approximation. Mathe-\nmatical Biosciences, 75(1):103–120, 1985.\nD. Rasch. Optimum experimental design in nonlinear regression. Comm. Statist. Theory Meth-\nods, 19(12):4789–4806, 1990.\n14\nAppendix\nProof of of Theorem 3.2\nProof. Let ξ∗\nπ be a Bayesian D-optimal design with respect to the prior π for least squares\nestimation in any functional model of the form (2.1). For any other design ξ and a ∈[0, 1] also\nlet ξa = (1 −a)ξ∗\nπ + aξ. Then the Frechet derivative of the criterion function Φπ(ξ) at ξ∗\nπ in the\ndirection of ξ −ξ∗\nπ is\nd\ndaΦπ(ξa) |a=0 =\nZ\nΘ\nd\nda\n\u0000log |MLS(ξa, θ)|\n\u0001\n|a=0 π(dθ)\n=\nZ\nΘ\nd\nda\n\u00002 log |D0(ξa, θ)|\n\u0001\n|a=0 −d\nda\n\u0000log |D1(ξa, θ)|\n\u0001\n|a=0 π(dθ)\n=\nZ\nΘ\n2tr{D−1\n0 (ξ∗\nπ, θ)[D0(ξ, θ) −D0(ξ∗\nπ, θ)]} −tr{D−1\n1 (ξ∗\nπ, θ)[D1(ξ, θ) −D1(ξ∗\nπ, θ)]} π(dθ)\n=\nZ\nΘ\n2tr{D−1\n0 (ξ∗\nπ, θ)D0(ξ, θ)} −tr{D−1\n1 (ξ∗\nπ, θ)D1(ξ, θ)} π(dθ) −(p + 1).\nNow using Dirac measures δx with weight 1 at the support points x ∈X of the design ξ we\nhave that\ntr{D−1\nk (ξ∗\nπ, θ)Dk(δx, θ)} = tr\nn\nD−1\nk (ξ∗\nπ, θ)(σ1(x, θ))k\nσ0(x, θ)\n\u0010∂m(x, θ)\n∂θ\n\u0011\u0010∂m(x, θ)\n∂θ\n\u0011To\n=\n\u0010∂m(x, θ)\n∂θ\n\u0011T (σ1(x, θ))k\nσ0(x, θ) D−1\nk (ξ∗\nπ, θ)\n\u0010∂m(x, θ)\n∂θ\n\u0011\n= (σ1(x, θ))kdk(x, ξ∗\nπ, θ),\nk = 0, 1.\nSince ξ∗\nπ is Bayesian D-optimal with respect to the prior π, dΦπ(ξa)/da |a=0 is non-positive for\nall designs ξ, and the inequality\nR\nΘ dLS(x, ξ∗\nπ, θ) π(dθ) ≤p + 1 for all x ∈X follows.\nNow let us assume for the Bayesian D-optimal design ξ∗\nπ that maxx∈X\nR\nΘ dLS(x, ξ∗\nπ, θ) π(dθ) <\np + 1. This yields that\nZ\nX\nZ\nΘ\ndLS(x, ξ∗\nπ, θ) π(dθ) dξ∗\nπ(x) < (p + 1)\nZ\nX\ndξ∗\nπ(x) = p + 1.\nOn the other hand, it follows from the deﬁnition of the functions d0 and d1 and a straightforward\ncalculation that for any design ξ\nZ\nX\nZ\nΘ\nd0(x, ξ, θ) π(dθ) dξ(x) =\nZ\nX\nZ\nΘ\nσ1(x, ξ, θ)d1(x, ξ, θ) π(dθ) dξ(x) =\nZ\nΘ\np+1 π(dθ) = p+1,\nwhich yields\nR\nX\nR\nΘ dLS(x, ξ∗\nπ, θ) π(dθ) dξ∗\nπ(x) = p + 1 and contradicts our initial assumption.\nHence maxx∈X\nR\nΘ dLS(x, ξ∗\nπ, θ) π(dθ) = p + 1 and from\nR\nX\nR\nΘ dLS(x, ξ∗\nπ, θ) π(dθ) dξ∗\nπ(x) = p + 1\nit follows that this maximum is attained at each support point of the Bayesian D-optimal design\nξ∗\nπ.\n15\nProof of Lemma 3.1\nProof. Let ξ = {x0, . . . , xp; ω0, . . . , ωp} be any saturated design. Also let X be the (p + 1) ×\n(p + 1) matrix with ith row given by\n\u0010\n∂m(xi,θ)\n∂θ\n\u0011T\n, i = 0, . . . , p, W = diag(ω0, . . . , ωp) and\nLk = diag(σk(x0, θ), . . . , σk(xp, θ)) for k = 0, 1. Under this notation the determinants of the\ninformation matrices MML(ξ, θ) and MLS(ξ, θ), given in (2.2) and (2.3) respectively, become\ndet {MML(ξ, θ)} = [det X]2 [det L1]−1 [det W]\ndet {MLS(ξ, θ)} = det\n\b\nD0(ξ, θ)D−1\n1 (ξ, θ)D0(ξ, θ)\n\t\n= [det X]2 [det L0]−1 [det L1]−1 [det W] .\nHence the criterion (3.1) becomes\nZ\nΘ\nlog |W| + 2 log |X| −log |L1| π(dθ),\nand\nZ\nΘ\nlog |W| + 2 log |X| −log |L0| −log |L1| π(dθ),\nfor maximum likelihood and least squares estimation respectively.\nMaximising any of the\nabove expressions with respect to the weights gives ωi = 1/(p + 1), for all i = 0, . . . , p since\ndet W = ω0 ω1 . . . ωp, which proves the assertion.\nProof of Theorem 4.1\nProof. From Lemma 3.1 it follows that a Bayesian D-optimal saturated design on X = [0, xu]\nfor maximum likelihood estimation in the Michaelis-Menten model with measurement errors as\nin (2.1), puts equal weights at its support points points. For any design ξπ = {x1, x2; 0.5, 0.5}\n(0 < x1 < x2 ≤xu), the criterion deﬁned in (3.1) for the information matrix given in (2.2)\nbecomes\nΦπ(ξπ) =\nZ\nΘ\n2 log θ1 + 2 log x1 + 2 log x2 + 2 log(x2 −x1) −log 4\n−log(σ2\nη(θ2 + x1)4 + θ2\n1θ2\n2σ2\nε) −log(σ2\nη(θ2 + x2)4 + θ2\n1θ2\n2σ2\nε) π(dθ).\nIt is easy to check that for ﬁxed x1, this is increasing with x2 and therefore maximized for x∗\n2 =\nxu. The smaller support point of the optimal design is found by solving ∂Φπ(ξπ)/∂x1 |x2=xu= 0\nfor x1 ∈(0, xu). This is equivalent to solving\nZ\nΘ\n1\nx1\n−\n1\nxu −x1\n−\n2σ2\nη(θ2 + x1)3\nσ2\nη(θ2 + x1)4 + θ2\n1θ2\n2σ2\nε\nπ(dθ) = 0,\n(.5)\nfor x1 ∈(0, xu).\nSimilarly using Lemma 3.1, a Bayesian D-optimal saturated design on X = [0, xu] for maxi-\nmum likelihood estimation in the Emax model with measurement errors as in (2.1), is equally\n16\nweighted. Thus for the three-point design ξπ = {x0, x1, x2; 1/3, 1/3, 1/3} (0 < x0 < x1 < x2 ≤\nxu) we have that\nΦπ(ξπ) =\nZ\nΘ\n2 log θ1 + 4 log θ2 + 2 log(x0 −x1) + 2 log(x0 −x2) + 2 log(x1 −x2) −log 27\n−log(σ2\nη(θ2 + x0)4 + θ2\n1θ2\n2σ2\nε) −log(σ2\nη(θ2 + x1)4 + θ2\n1θ2\n2σ2\nε) −log(σ2\nη(θ2 + x2)4 + θ2\n1θ2\n2σ2\nε) π(dθ).\nThe criterion above is decreasing with x0 and increasing with x2 and therefore, it is maximised\nat x∗\n0 = 0 and x∗\n2 = xu. The equation ∂Φπ(ξπ)/∂x1 |x0=0;x2=xu= 0 gives again equation (.5).\nProof of Theorem 4.2\nProof. Following similar arguments as in the proof of Theorem 4.1, for an equally weighted\nthree-point design ξπ = {x0, x1, x2; 1/3, 1/3, 1/3} (0 ≤x0 < x1 < x2 ≤xu), the criterion\ndeﬁned in (3.1) using the information matrix given in (2.2) for the Emax model (4.3), becomes\nΦπ(ξπ) =\nZ\nΘ\n2 log θ1 + 2 log(eθ2x2(x0 −x1) + eθ2x0(x1 −x2) + eθ2x1(x2 −x0)) −log 27\n−log(σ2\nηe2θ2x0 + θ2\n1θ2\n2σ2\nε) −log(σ2\nηe2θ2x1 + θ2\n1θ2\n2σ2\nε) −log(σ2\nηe2θ2x2 + θ2\n1θ2\n2σ2\nε) π(dθ).\nIt is easy to check that eθ2x2(x0 −x1) + eθ2x0(x1 −x2) + eθ2x1(x2 −x0) is increasing with x0,\ndecreasing with x2 and negative for all x0 < x1 < x2. Therefore, the criterion is decreasing\nwith x0 and increasing with x2 and thus it is maximized at x∗\n0 = 0 and x∗\n2 = xu. The middle\nsupport point of the Bayesian D-optimal design is found by solving ∂Φπ(ξπ)/∂x1 |x0=0;x2=xu= 0\nfor x1 ∈(0, xu) which is equivalent to solving\nZ\nΘ\n1 −eθ2xu + θ2xueθ2x1\nx1 −xu + xueθ2x1 −x1eθ2xu −\nθ2e2θ2x1\ne2θ2x1 + θ2\n1θ2\n2̺2\nεη\nπ(dθ) = 0,\nfor x1 ∈(0, xu), where ̺2\nεη = σ2\nε/σ2\nη.\nProof of Theorem 4.3\nProof. From Lemma 3.1, it follows that a Bayesian D-optimal saturated design for least squares\nestimation assigns equal weights at its support points. For the Michaelis-Menten model with\nmeasurement errors as in (2.1) and a two-point equally weighted design ξπ = {x1, x2; 0.5, 0.5}\n(0 < x1 < x2 ≤xu), the criterion deﬁned in (3.1) for the information matrix given in (2.3)\nbecomes\nΦπ(ξπ) =\nZ\nΘ\n2 log θ1 + 2 log(x2 −x1) + 4 log(θ2 + x1) + 4 log(θ2 + x2) −log 4\n−log(σ2\nη(θ2 + x1)4 + θ2\n1θ2\n2σ2\nε) −log(σ2\nη(θ2 + x2)4 + θ2\n1θ2\n2σ2\nε)\n−log((θ2 + x1)4 + θ2\n1θ2\n2) −log((θ2 + x2)4 + θ2\n1θ2\n2) π(dθ).\n17\nFor ﬁxed x1, the above expression is increasing with x2 and therefore maximized at x∗\n2 = xu.\nThe smaller support point of the optimal design is found by solving ∂Φπ(ξπ)/∂x1 |x2=xu= 0 for\nx1 ∈(0, xu), which is equivalent to solving\nZ\nΘ\n1\nx1\n−\n1\nxu −x1\n−\n2(θ2 + x1)3\n(θ2 + x1)4 + θ2\n1θ2\n2̺2\nεη\n+\n2θ2\n1θ2\n2\n(θ2 + x1)[(θ2 + x1)4 + θ2\n1θ2\n2] π(dθ) = 0,\n(.6)\nfor x1 ∈(0, xu).\nIn the case of the Emax model with errors as in (2.1), the criterion for a three-point equally\nweighted design ξπ = {x0, x1, x2; 1/3, 1/3, 1/3} (0 ≤x0 < x1 < x2 ≤xu) becomes\nΦπ(ξπ) =\nZ\nΘ\n2 log θ1 + 4 log θ2 + 2 log(x2 −x1) + 2 log(x2 −x0) + 2 log(x1 −x0) + 4 log(θ2 + x0)\n+ 4 log(θ2 + x1) + 4 log(θ2 + x2) −log 4 −log(σ2\nη(θ2 + x0)4 + θ2\n1θ2\n2σ2\nε)\n−log(σ2\nη(θ2 + x1)4 + θ2\n1θ2\n2σ2\nε) −log(σ2\nη(θ2 + x2)4 + θ2\n1θ2\n2σ2\nε) −log((θ2 + x0)4 + θ2\n1θ2\n2)\n−log((θ2 + x1)4 + θ2\n1θ2\n2) −log((θ2 + x2)4 + θ2\n1θ2\n2) π(dθ).\nIt is easy to check, following similar arguments as before, that the above expression is decreasing\nwith x0, increasing with x2 and thus maximized at x∗\n0 = 0, x∗\n2 = xu and x∗\n1 is the solution of\nthe same equation as for the Michaelis-Menten model, that is, equation (.6).\nProof of Theorem 4.4\nProof. For the three-parameter exponential regression model with measurement errors as in\n(2.1) and a three-point equally weighted design ξπ = {x0, x1, x2; 1/3, 1/3, 1.3} (0 ≤x0 < x1 <\nx2 ≤xu), the criterion deﬁned in (3.1) for the information matrix given in (2.3) becomes\nΦπ(ξπ) =\nZ\nΘ\n2 log θ1 + 2 log(eθ2x2(x0 −x1) + eθ2x0(x1 −x2) + eθ2x1(x2 −x0)) −log 27\n−log(σ2\nηe2θ2x0 + θ2\n1θ2\n2σ2\nε) −log(σ2\nηe2θ2x1 + θ2\n1θ2\n2σ2\nε) −log(σ2\nηe2θ2x2 + θ2\n1θ2\n2σ2\nε)\n−log(1 + θ2\n1θ2\n2e−2θ2x0) −log(1 + θ2\n1θ2\n2e−2θ2x1) −log log(1 + θ2\n1θ2\n2e−2θ2x2) π(dθ).\nFollowing the proof of Theorem 4.2, the criterion is increasing with x2 and thus it is maximized\nat x∗\n2 = xu.\n18\n"}