{"text": "Dropout Training is Distributionally Robust Optimal\nDropout Training is Distributionally Robust Optimal\nJos´e Blanchet\njose.blanchet@stanford.edu\nDepartment of Management Science and Engineering\nStanford University\nStanford, CA 94305, USA\nYang Kang\nyangkang@stat.columbia.edu\nDepartment of Statistics\nColumbia University\nNew York, NY 10027, USA\nJos´e Luis Montiel Olea\nmontiel.olea@gmail.com\nDepartment of Economics\nColumbia University\nNew York, NY 10027, USA\nViet Anh Nguyen\nviet-anh.nguyen@stanford.edu\nDepartment of Management Science and Engineering\nStanford University\nStanford, CA 94305, USA\nXuhui Zhang\nxuhui.zhang@stanford.edu\nDepartment of Management Science and Engineering\nStanford University\nStanford, CA 94305, USA\nEditor:\nAbstract\nThis paper shows that dropout training in Generalized Linear Models is the minimax so-\nlution of a two-player, zero-sum game where an adversarial nature corrupts a statistician’s\ncovariates using a multiplicative nonparametric errors-in-variables model. In this game,\nnature’s least favorable distribution is dropout noise, where nature independently deletes\nentries of the covariate vector with some ﬁxed probability δ.\nThis result implies that\ndropout training indeed provides out-of-sample expected loss guarantees for distributions\nthat arise from multiplicative perturbations of in-sample data. In addition to the decision-\ntheoretic analysis, the paper makes two more contributions.\nFirst, there is a concrete\nrecommendation on how to select the tuning parameter δ to guarantee that, as the sample\nsize grows large, the in-sample loss after dropout training exceeds the true population loss\nwith some pre-speciﬁed probability.\nSecond, the paper provides a novel, parallelizable,\nUnbiased Multi-Level Monte Carlo algorithm to speed-up the implementation of dropout\ntraining. Our algorithm has a much smaller computational cost compared to the naive\nimplementation of dropout, provided the number of data points is much smaller than the\ndimension of the covariate vector.\nKeywords:\nGeneralized Linear Models, Distributionally Robust Optimization, Machine\nLearning, Minimax Theorem, Multi-Level Monte Carlo.\n1\narXiv:2009.06111v2  [stat.ML]  14 Apr 2021\nBlanchet et al.\n1. Introduction\nDropout training is an increasingly popular estimation method in machine learning.1 The\ngeneral idea consists in ignoring some dimensions of the covariate vector at random while\nestimating the parameters of a statistical model. A common motivation for dropout train-\ning is that the random feature selection implicitly performs model averaging, potentially\nimproving out-of-sample prediction error and thus mitigating overﬁtting. See Hinton et al.\n(2012) for a discussion about this point in the context of neural networks. See also Draper\n(1994) and Raftery et al. (1997) for classical results on the optimality of model averaging\nfor prediction purposes.\nOur main goal is to contribute to the growing literature explaining the success of dropout\ntraining in mitigating overﬁtting; e.g., Wager et al. (2013), Helmbold and Long (2015),\nWei et al. (2020). Our main result (Theorem 2) shows that dropping out input features\nwhen training Generalized Linear Models can be viewed as the minimax solution to an\nadversarial game known in the stochastic optimization literature (Shapiro et al. (2014)) as\na Distributionally Robust Optimization (DRO) problem.\nBroadly speaking, a DRO problem is a two-player, zero-sum game between a decision\nmaker (a statistician) and an adversary (nature).\nThe statistician wishes to choose an\naction to minimize a given expected loss (e.g., squared loss in a typical linear regression\nsetting or, more generally, the negative of the log-likelihood function), while nature intends\nthis loss to be maximal. We consider a framework in which nature is allowed to harm the\nstatistician by corrupting the available data using a multiplicative nonparametric errors-in-\nvariables model; as in the classical work of Hwang (1986). The statistician is aware of the\ndata corruption and knows the distribution used by nature, but does not have access to\nthe realizations of the corruption noise. Under mild assumptions, nature’s least favorable\ndistribution in this game is shown to be dropout noise, where nature independently deletes\nentries of the covariate vector with some ﬁxed probability δ. The Minimax Theorem (Mor-\ngenstern and von Neumann, 1953) is shown to also hold for this game: the minimax value\ncoincides with the maximin solution, and these coincide with the payoﬀs in the game’s Nash\nequilibrium. One direct consequence is that the statistician’s selected procedure in the face\nof multiplicative nonparametric noise maintains optimal performance even if the adversary\nis allowed to corrupt after the statistician uses the training data.\nOur main result (Theorem 2) shows that, by construction, dropout training indeed pro-\nvides out-of-sample performance guarantees for distributions that arise from multiplicative\nperturbations of in-sample data. More precisely, given any ﬁxed sample size, the out-of-\nsample expected loss is no larger than that obtained by dropout training in-sample, provided\n1. Section 7.12 of Goodfellow et al. (2016) provides a textbook treatment on dropout training. Bishop\n(1995) and Srivastava et al. (2014) are seminal references on this topic.\n2\nDropout Training is Distributionally Robust Optimal\nwe consider out-of-sample distributions obtained as multiplicative perturbations of the in-\nsample distribution. Therefore, our result formally qualiﬁes the ability of dropout training\nto enhance out-of-sample performance, which is one of the reasons often invoked to use the\ndropout method. Moreover, our results show that for any parameter value the loss used in\ndropout training is larger than the negative log-likelihood of Generalized Linear Models.\nWe make two additional contributions. First, we suggest a novel procedure to select\nthe dropout probability δ. To this end, we study how often the in-sample loss of dropout\ntraining exceeds the true (and unknown) population expected loss. When δ = 0, the Central\nLimit Theorem implies this event occurs with approximately .5 probability. When δ is ﬁxed,\nTheorem 2 implies this event occurs with probability 1. We show that picking δ to be of\nthe form c/√n (where n denotes the number of training examples) makes the in-sample\nloss of dropout training exceed the population loss with probability that depends on c.\nConsequently, by choosing a target probability, say 95%, it is possible to provide a concrete\nrecommendation for the selection of c, and therefore, of δ.\nSecond, we suggest a new stochastic optimization implementation of dropout training.\nA well-known drawback of dropout is its computational cost.\nAs we will explain, a d-\ndimensional covariate vector requires 2d evaluations of the loss in order to integrate out\nthe dropout noise for a particular data point.\nThe computational cost is alleviated by\nimplementing dropout training by using either Stochastic Gradient Descent (Robbins and\nMonro (1951)) or naive Monte-Carlo approximations to the expected loss, both of which\nrequire draws from the joint distribution of the data and dropout noise. Unfortunately,\nboth of these approximations introduce bias to the solution of dropout training. Also, none\nof these procedures can exploit the increasing availability of parallel computing in order to\nalleviate their computational burden. We borrow ideas from the Multi-level Monte Carlo\nliterature—in particular from the work of Blanchet et al. (2019a)—to suggest an unbiased (in\na sense we will make precise) dropout training routine that is easily parallelizable and that\nhas a much smaller computational cost compared to naive dropout training methods when\nthe number of features is large (Theorem 4). Our algorithm thus complements the recent\nliterature suggesting approaches to speed-up dropout training by either using a parallelized\nimplementation of Stochastic Gradient Descent (Zinkevich et al., 2010) or a fast dropout\ntraining based on Gaussian approximations (Wang and Manning, 2013).\nThe rest of the paper is organized as follows. Section 2 explains dropout training in the\ncontext of Generalized Linear Models. Section 3 presents a general description of the DRO\nframework used in this paper. Section 4 specializes the DRO problem by using the negative\nlog-likelihood of Generalized Linear Models to deﬁne a loss function for the statistician, and\nby allowing nature to harm the statistician via a multiplicative errors-in-variables model\nfor the covariates. This section also presents our main theorem. Section 5 presents our\n3\nBlanchet et al.\napproach to select the dropout probability, δ. Section 6 discusses diﬀerent computational\nmethods available for implementing dropout training (full integration, Stochastic Gradient\nDescent, Naive Monte Carlo integration) and presents our suggested Unbiased Multi-level\nMonte Carlo algorithm. Section 7 presents some simulations comparing our recommended\nselection of δ to cross-validation, as well as our preferred implementation of dropout training\nto Stochastic Gradient Descent. Finally, Section 8 discusses extensions of our results to a\nparticular class of feed-forward neural networks with a single hidden layer. We show that\ndropout training of the hidden units in the hidden layer is distributionally robust optimal.\nAll the proofs are collected in the Appendix.\n2. Dropout Training in Generalized Linear Models\nThis section describes dropout training in the context of Generalized Linear Models. As\nsome other recent papers in the literature, we view Generalized Linear Models as a conve-\nnient, transparent, and relevant framework to better understand the theoretical and algo-\nrithmic properties of dropout training.\n2.1 Generalized Linear Models (GLMs)\nA Generalized Linear Model—with parameters β and φ—is deﬁned by a conditional density\nfor the response variable Y ∈Y ⊆R given X ∈Rd\nf(Y |X, β, φ) ≡h(Y, φ) exp\n\u0010\u0010\nY β⊤X −Ψ(β⊤X)\n\u0011\n/a(φ)\n\u0011\n,\n(1)\nsee McCullagh and Nelder (1989, Equation 2.4). In our notation h(·, φ) is a real-valued\nfunction (integrable with respect to the true data distribution), parameterized by φ deﬁned\non the domain Y; a(·) is a positive function of φ; and Ψ(·) is the log-partition function,\nwhich we assume to be deﬁned on all the real line. It is well-known that in GLMs with\na scalar response variable the log-partition function is inﬁnitely diﬀerentiable and strictly\nconvex on its domain; see Proposition 3.1 in Wainwright and Jordan (2008).\nNormal, Logistic, and Poisson Regression have conditional densities of the form (1). For\nthe sake of exposition, we provide details below for linear and logistic regression.\nExample 1 (Linear regression with unknown variance) Consider the linear model Y =\nβ⊤X + ε, in which ε ∼N(0, σ2) with unknown variance σ2 ∈R++ and ε⊥X. The condi-\ntional distribution of Y given X satisﬁes (1) with φ = σ2, a(φ) = φ, Ψ(β⊤X) = (β⊤X)2/2\nand h(Y, φ) = (2πφ)−1\n2 exp(−Y 2/(2φ)).\n4\nDropout Training is Distributionally Robust Optimal\nExample 2 (Logistic regression) Consider Y |X ∼Bernoulli(1/(1 + exp(−β⊤X)) with\nY = {0, 1}.\nThe conditional probability mass function of Y given X satisﬁes (1) with\na(φ) = 1, Ψ(β⊤X) = log(1 + exp(β⊤X)) and h(Y, φ) = 1.\nGeneralized Linear Models are typically estimated via Maximum Likelihood using (1).\nGiven n i.i.d. data realizations or training examples (xi, yi), the Maximum Likelihood esti-\nmator (bβML, bφML) is deﬁned as any solution of the problem\nmin\nβ,φ\nn\nX\ni=1\n−ln f(yi|xi, β, φ).\n(2)\nMaximum Likelihood estimators in GLMs are known to be consistent and asymptotically\nnormal under mild regularity conditions on the joint distribution of (Xi, Yi) (Fahrmeir and\nKaufmann, 1985). We denote this distribution as P ⋆.\n2.2 Dropout Training\nAn alternative to standard Maximum Likelihood estimation in GLMs is dropout training.\nThe general idea consists in ignoring some randomly chosen dimensions of xi while training\na statistical model.\nFor a given covariate vector xi—and an user-selected constant, δ ∈[0, 1)—deﬁne the\nd-dimensional random vector\nξi = (ξi,1, . . . , ξi,d)⊤∈{0, 1/(1 −δ)}d,\nwhere each of the d entries of ξi is an independent draw from a scaled Bernoulli distribution\nwith parameter 1 −δ. This is, for j = 1, . . . , d:\nξi,j =\n\n\n\n0\nwith probability δ,\n(1 −δ)−1\nwith probability (1 −δ).\n(3)\nNote that when δ = 0, the distribution of ξi,j collapses to ξi,j = 1 with probability 1. Let\n⊙denote the binary operator deﬁning element-wise multiplication between two vectors of\nthe same dimension. Consider the covariate vector\nxi ⊙ξi ≡(xi,1ξi,1, . . . , xi,dξi,d)⊤.\n(4)\nSome entries of the new covariate vector are 0 (those for which ξi,j = 0) and the rest are\nequal to xi,j/(1 −δ).\n5\nBlanchet et al.\nIn a slight abuse of notation, let Eδ denote the distribution of the random vector ξi,\nwhose distribution is parameterized by δ. The estimators of (β, φ) obtained by dropout\ntraining correspond to any parameters (bβ(δ), bφ(δ)) that solve the problem\nmin\nβ,φ\n1\nn\nn\nX\ni=1\nEδ [−ln f(yi|xi ⊙ξi, β, φ)] .\n(5)\nOne possibility to solve (5) is to use Stochastic Gradient Descent (Robbins and Monro\n(1951)). This is tantamount to i) taking a draw of (xi, yi) according to its empirical distri-\nbution, ii) independently taking a draw of ξi using the distribution in (3) and iii) computing\nthe stochastic gradient descent update using\n∇ln f(yi|xi ⊙ξi, β, φ).\nWe provide further details about the Stochastic Gradient Descent implementation of dropout\ntraining in Section 6.\n2.3 Question of Interest\nAdding noise to the Maximum Likelihood objective in (2) seems, at ﬁrst glance, arbitrary.\nOur ﬁrst obvious observation is that dropout training estimators will generally not share\nthe same probability limit as the Maximum Likelihood estimators whenever δ ̸= 0. This\ncan be formalized under the following assumptions:\nAssumption 1 The log-partition function Ψ(·) has a bounded second derivative.\nAssumption 2 The second moment matrix EP ⋆[XX⊤] is ﬁnite, positive deﬁnite.\nProposition 1 (Consistency) Suppose that Assumptions 1 and 2 hold.\nThen for any\nsequence δn →δ ∈[0, 1) as n →∞, bβ(δn) converges in probability to\nβ⋆(δ) ≡arg min\nβ\nEP ⋆[Eδ [−ln f(Y |X ⊙ξ, β, φ)]] ,\n(6)\nwhere the minimizer in (6) is unique and does not depend on φ.\nProof See Appendix A.1.\nThe proof of this result consists of expressing dropout training as an extremum estimator\nand verifying standard conditions for consistency in Newey and McFadden (1994). The main\nmessage of the proposition above is that the parameter β⋆(0)—which gives the probability\n6\nDropout Training is Distributionally Robust Optimal\nlimit of the Maximum Likelihood estimator—generally diﬀers from β⋆(δ) when δ ̸= 0,\nwhich is the probability limit of the dropout estimator.2 To further illustrate this point,\nit is helpful to workout the details of the probability limit of the dropout estimator in the\nlinear regression model. Algebra shows that in this model\nβ⋆(δ) =\n\u0010\nEP ⋆[XX⊤] + (δ/1 −δ)diag(EP ⋆[XX⊤])\n\u0011−1\nEP ⋆[Y X],\nwhich can be interpreted as a population version of the Ridge estimator. This estimator\ndiﬀers from the best linear predictor of y using x as long as EP ⋆[Y X] ̸= 0 and δ ̸= 0. This\nestimator diﬀers from Ridge regression in that EP ⋆[XX⊤] replaces the identity matrix (and\nthis simple adjustment makes the estimator scale equivariant).\nDespite the lack of consistency, there is some literature that has provided empirical\nevidence that using intentionally corrupted features for training has the potential to improve\nthe performance of machine learning algorithms; see Maaten et al. (2013). Even if one is\nwilling to accept that corrupting features is desirable for estimation, the choice of dropout\nnoise in (3) remains quite arbitrary.\nThe main contribution of this paper is to provide a novel decision-theoretic interpreta-\ntion of dropout training (in the population and in the sample). We will argue there is a\nnatural two-player, zero-sum game between a decision maker (statistician) and an adversary\n(nature) in which dropout training emerges naturally as a minimax solution. In this game,\ndropout noise turns out to be nature’s least favorable distribution, and dropout training\nbecomes the statistician’s optimal action. The framework we use is known in the stochastic\noptimization literature as Distributionally Robust Optimization and we describe it very\ngenerally in the next section. We will therein also revisit the interpretation of β∗(δ) in the\nlinear regression model.\n3. Problem Setup\nConsider a general problem where there is a multivariate predictor X ∈Rd and a scalar\noutcome variable Y ∈R. A Distributionally Robust Optimization (DRO) problem is a\nsimultaneous two-player zero sum game between a decision maker (statistician) and an\n2. Relatedly, Farrell et al. (2020)—who study deep neural networks and their use in semiparametric\ninference—report that their numerical exploration of dropout increased bias and interval length compared\nto nonregularized models.\n7\nBlanchet et al.\nadversary (nature).3\nIn this section we describe the action space for each player, their\nstrategies, and the payoﬀfunction.\nActions and Payoff: The statistician’s action space consists of vectors θ ∈Θ. The\nranking of the statistician’s actions is contingent on the realization of (X, Y ), and this is\ncaptured by a real-valued loss function ℓ(X, Y, θ). We assume that the statistician is called\nto choose an action before observing the realization of (X, Y ). If the statistician knew the\ndistribution of (X, Y )—which we denote by Q—the statistician’s preferred choice of θ would\nbe the solution to\ninf\nθ∈Θ EQ [ℓ(X, Y, θ)] .\n(7)\nInstead of assuming that the distribution Q is exogenously determined, we think of\nthe distribution Q as being chosen by nature. Thus, nature’s action space consists of a\nset of probability distributions denoted as U. We refer to this set as the distributionally\nuncertainty set. If nature knew the action selected by the statistician, nature’s preferred\naction would be\nsup\nQ∈U\nEQ[ℓ(X, Y, θ)].\n(8)\nStrategies and Solution: The choice of θ and Q are assumed to happen simulta-\nneously. A statistician’s strategy for this game consists of a choice of θ. Likewise, nature’s\nstrategy for this game consists of a choice of Q.\nA Nash equilibrium for this game is a pair (θ⋆, Q⋆) such that: a) given Q⋆, the parameter\nθ⋆solves (7) and b) given θ⋆, the distribution Q⋆solves (8).\nThe minimax solution for this game is a pair (θ∗, Q∗) that solves\ninf\nθ∈Θ\nsup\nQ∈U\nEQ[ℓ(X, Y, θ)],\n(9a)\nwhile the maximin solution is based on the program\nsup\nQ∈U\ninf\nθ∈Θ\nEQ[ℓ(X, Y, θ)].\n(9b)\nIf Q⋆solves (9b), we say that Q⋆is nature’s least favorable distribution. The mathematical\nprogram in (9a) is typically referred to as a DRO problem.\n3. A seminal reference is the robust inventory control problem of Scarf (1958). Recent references describing\nthe use of distributionally robust stochastic programs (as those considered in this paper) are Delage and\nYe (2010) and Shapiro (2017). Christensen and Connault (2019) used distributionally robust optimization\nto characterize the sensitivity of counterfactual analysis with respect to distributional assumptions in a\nclass of structural econometric models.\n8\nDropout Training is Distributionally Robust Optimal\n4. Dropout Training is Distributionally Robust Optimal\nThe previous section provided a general description of a Distributionally Robust Optimiza-\ntion problem. We specialize the general framework of Section 3 by imposing two restric-\ntions. First, we use the negative log-likelihood of Generalized Linear Models (McCullagh\nand Nelder, 1989) as a loss function for the statistician. Second, we deﬁne nature’s uncer-\ntainty set (i.e., the possible data distributions that nature can take) using the multiplicative\nerrors-in-variables model of Hwang (1986).\n4.1 Statistician’s Payoﬀ\nWe deﬁne the loss function for the statistician to be the negative of the logarithm of the\nlikelihood in (1), that is,\nℓ(X, Y, θ) = −ln h(Y, φ) + (Ψ(β⊤X) −Y (β⊤X))/a(φ),\n(10)\nwhere θ ≡(β⊤, φ⊤)⊤∈Θ. Equation (10) deﬁnes the statistician’s objective and its set of\nactions.\n4.2 Nature’s Distributionally Uncertainty Set\nWe now deﬁne the possible distributions that nature can choose. We start out by letting Q0\ndenote some benchmark or reference distribution over (X, Y ). This distribution need not\ncorrespond to that induced by a Generalized Linear Model. In other words, our framework\nallows for the statistician’s model to be misspeciﬁed.\nNext, we deﬁne nature’s action space by considering perturbations of Q0. Although\nthere are diﬀerent ways of doing this—for example, by using either f-divergences (such as\nthe Kullback-Leibler as in Nguyen et al. (2020)) or the optimal transport distance (such as\nthe Wasserstein distance as in Blanchet et al. (2019b)) to deﬁne a neighborhood—we herein\nuse a nonparametric multiplicative errors-in-variables model as in Hwang (1986).\nThe idea is to allow nature to independently introduce measurement error to the covari-\nates using multiplicative noise. Multiplicative errors have found diﬀerent applications in\nempirical work across diﬀerent disciplines, from economics to epidemiology. For example,\nAlan et al. (2009) use it to account for measurement error in consumption data when esti-\nmating the elasticity of intertemporal substitution via Euler equations. Pierce et al. (1992)\nand Lyles and Kupper (1997) use it to relate health outcomes to the exposure of a chemical\ntoxicant that is observed with error. Moreover, due to privacy considerations, statistical\nagencies such as the U.S. Census Bureau sometimes mask data using multiplicative noise;\nsee the discussion in Kim and Winkler (2003) and Nayak et al. (2011). Examples of datasets\nthat contain variables masked with multiplicative noise include the Commodity Flow Survey\n9\nBlanchet et al.\nData (2017), the Survey of Business Owners (2012)—both from the U.S. Census Bureau—\nand the U.S. Energy Information Administration Residential Energy Consumption survey.\nLet ξ ≡(ξ1, . . . , ξd)⊤be deﬁned as a d-dimensional vector of random variables that are\nindependent of (X, Y ). We perturb the distribution Q0 by considering the transformation\n(X, Y ) 7→(X1ξ1, . . . , Xdξd, Y )⊤.\nAs a result, each covariate Xj is distorted in a multiplicative fashion by ξj.\nWe often\nabbreviate (X1ξ1, . . . , Xdξd)⊤by X ⊙ξ, where ⊙is the element-wise multiplication.\nWe restrict the distribution of ξ in the following way. First, for a parameter δ ∈[0, 1),\nwe deﬁne Qj(δ) to be the set of distributions for ξj that are supported on the interval\n[0, 1/(1 −δ)] and that have mean equal to 1. More speciﬁcally,\nQj(δ) ≡\n\b\nQj : Qj is a probability distribution on R, Qj([0, (1 −δ)−1]) = 1, EQj[ξj] = 1\n\t\n.\n(11)\nThis set of distributions prescribed using support and ﬁrst-order moment information is\npopular in the DRO literature thanks to its simplicity and tractability (Wiesemann et al.,\n2014). From the perspective of an errors-in-variables model, these distributions are also\nattractive because they preserve the expected value of the covariates, assuming that Xj\nand ξj are drawn independently.\nConsider now the joint random vector (X, Y, ξ) ∈Rd × R × Rd. For a constant δ ∈[0, 1)\nconsider the joint distributions over (X, Y, ξ) deﬁned by\nU(Q0, δ) = {Q0 ⊗Q1 ⊗. . . ⊗Qd : Qj ∈Qj(δ) ∀j = 1, . . . , d} ,\n(12)\nwhere ⊗is used to denote the product measure (meaning that the joint distribution is the\nproduct of the independent marginals Qj, j = 0, . . . , d). Thus, in the game we consider\nU(Q0, δ) is nature’s action space or nature’s distributionally uncertainty set.\nWe will make only one assumption about the reference distribution Q0 :\nAssumption 3 The distribution Q0 satisﬁes EQ[ℓ(X ⊙ξ, Y, θ)] < ∞for any Q ∈U(Q0, δ),\nany θ ∈Θ, and any scalar δ ∈[0, 1).\nThis assumption implies a minimal regularity condition to guarantee that the expected\nloss is well-deﬁned for both the statistician and nature. Assumption 3 is trivially satisﬁed\nwhen Q0 is the empirical distribution of the data, which is one of the main cases of interest\nin the paper.\n10\nDropout Training is Distributionally Robust Optimal\n4.3 Dropout Training is DRO\nWe now present the main result of this section.\nTheorem 2 Consider the two-player zero sum game where the statistician has the loss\nfunction in (10) and nature has the action space in (12) for some reference distribution\nQ0 and a scalar δ ∈[0, 1). If Assumption 3 is satisﬁed, then the minimax solution of the\ntwo-player zero sum game deﬁned by (10) and (12)\ninf\nθ∈Θ\nsup\nQ∈U(Q0,δ)\nEQ [ℓ(X ⊙ξ, Y, θ)]\n(13)\nis equivalent to\ninf\nθ∈Θ EQ⋆[ℓ(X ⊙ξ, Y, θ)],\n(14)\nwhere Q⋆= Q0 ⊗Q⋆\n1 ⊗. . . ⊗Q⋆\nd, and Q⋆\nj = (1 −δ)−1 × Bernoulli(1 −δ) is a scaled Bernoulli\ndistribution for any j = 1, . . . , d, i.e., under Q⋆\nj\nξj =\n\n\n\n0\nwith probability δ,\n(1 −δ)−1\nwith probability (1 −δ).\n(15)\nIn addition, let θ⋆∈Θ be a solution to (14). Then (θ⋆, Q⋆) constitutes a Nash equilibrium\nof the two-player zero sum game deﬁned by (10) and (12) and Q⋆is nature’s least favorable\ndistribution.\nProof See Appendix A.2.\nThe ﬁrst part of theorem characterizes the statistician’s best response to an adversarial\nnature that is allowed to corrupt the covariates using a multiplicative errors-in-variables\nmodel. From the statistician’s perspective, nature’s worst-case perturbation of Q0 is given\nby Q⋆in (15). Under this worst-case distribution, nature independently corrupts each of the\nentries of X = (X1, . . . , Xd)⊤, by either dropping the j-th component (if ξj = 0) or replacing\nit by Xj/(1 −δ). Dropout training—which here refers to estimating the parameter θ after\nadding dropout noise to X—thus becomes the statistician’s preferred way of estimating the\nparameter θ when facing an adversarial nature. This gives a decision-theoretic foundation\nfor the use of dropout training.\nNote that in order to recover the objective function introduced in (5) (the sample av-\nerage of the contaminated log-likelihood) it suﬃces to set the reference measure—Q0—as\nthe empirical distribution bPn of {(xi, yi)}n\ni=1, which satisﬁes Assumption 3. Likewise, The-\norem 2 allows to interpret the probability limit β⋆(δ) of the dropout estimator derived in\n11\nBlanchet et al.\nProposition 1 as a solution to a DRO problem. In particular\nβ⋆(δ) = arg min\nβ\nsup\nQ∈U(P ∗,δ)\nEQ [−ln f(Y |X ⊙ξ, β, φ)] ,\nprovided the data-generating distribution P ∗satisﬁes Assumption 3. In the speciﬁc case\nof the linear regression model, this means that we can interpret β⋆(δ) as giving us the\npopulation’s best linear predictor for y in terms of x, provided nature is allowed to perturb\nthe distribution of covariates using a multiplicative error-in-variables model.\nMore generally, because dropout noise is nature’s best response for every β, the dropout\nloss is an upper bound for the true loss:\nEQ⋆[−ln f(Y |X ⊙ξ, β⋆(δ), φ)] ≥EP ∗[−ln f(Y |X ⊙ξ, β⋆(0), φ)] .\nWe provide now some intuition about how dropout noise becomes nature’s worst-case distri-\nbution. Algebra shows that, in light of Assumption 3, the expected loss under an arbitrary\ndistribution Q is ﬁnite and can be written as\nEQ[ℓ(X ⊙ξ, Y, θ)] = −EQ0 [ln h(Y, φ)]\n+ EQ0\nh\nEQ1⊗...⊗Qd[(Ψ((β ⊙X)⊤ξ) −Y ((β ⊙X)⊤ξ))/a(φ)]\ni\n,\nwhere the ﬁrst expectation is taken with respect to the reference distribution, and the\nsecond one with respect to ξ. For ﬁxed values of (X, Y, θ) we can deﬁne\nA(X,Y,θ)((β ⊙X)⊤ξ) ≡(Ψ((β ⊙X)⊤ξ) −Y ((β ⊙X)⊤ξ))/a(φ).\nBecause Ψ(·) is a convex function deﬁned on all of the real line, the function A(X,Y,θ)(·)\ninherits these properties. We show in the appendix that for these type of functions\nsup\nn\nEQ1⊗...⊗Qd[A(X,Y,θ)((β ⊙X)⊤ξ)] : Qj ∈Qj(δ)\no\n= EQ⋆\n1⊗...⊗Q⋆\nd[A(X,Y,θ)((β ⊙X)⊤ξ)],\n(16)\nfor any θ, and this establishes the equivalence between (13) and (14). The proof of the\nequality above exploits convexity. In fact, to derive our result we ﬁrst characterize the worst-\ncase distribution for the expectation of a real-valued convex function (Lemma 5) and then\nwe generalize this result to functions that depend on ξ only through linear combinations,\nas A(X,Y,θ)(·) (Proposition 6).\nHow about the Nash Equilibrium of the two-player zero sum game deﬁned by (10) and\n(12)? The equality in (16) clearly shows that Q⋆is nature’s best response for any θ ∈Θ.\nIf there is a vector θ⋆that solves the dropout training problem in (14), then this vector is\n12\nDropout Training is Distributionally Robust Optimal\nthe statistician best’s response to nature’s choice of Q⋆. Consequently, (θ⋆, Q⋆) is a Nash\nequilibrium.\nFinally, we discuss the extent to which Q⋆can be referred to as nature’s least favorable\ndistribution, which has been deﬁned as nature’s solution to the maximin problem. It is well\nknown that the maximin value of a game is always smaller than its minimax value:4\nsup\nQ∈U(Q0,δ)\ninf\nθ∈Θ\nEQ[ℓ(X ⊙ξ, Y, θ)] ≤inf\nθ∈Θ\nsup\nQ∈U(Q0,δ)\nEQ[ℓ(X ⊙ξ, Y, θ)].\nWe have shown that the right-hand side of the display above equals (14). Therefore,\nif there is a θ⋆∈Θ that solves such program, then Q⋆achieves the upper bound to the\nmaximin value of the game. This makes dropout noise nature’s least favorable distribution.\nNow that we have established that dropout training gives the minimax solution of the\nDRO game, we discuss the implications of this result regarding the out-of-sample perfor-\nmance of dropout training. Suppose Q0 is the empirical measure bPn supported on n training\nsamples {(xi, yi)}n\ni=1. The in-sample loss of dropout training is\n1\nn\nn\nX\ni=1\nEQ⋆[ℓ(X ⊙ξ, Y, θ⋆)|X = xi, Y = yi].\n(17)\nA typical concern with estimation procedures is whether their performance in a speciﬁc\nsample translates to good performance out of sample. In our context, the out-of-sample\nperformance of dropout training can be thought of as the expected loss that would arise\nfor some other data distribution ˜Q0 over (X, Y ) at the parameter estimated via dropout\ntraining:\nE˜Q0[ℓ(X, Y, θ⋆)].\nThe minimaxity of dropout training shows that for any distribution ˜Q0 over (X, Y ) that\ncan be obtained from bPn by perturbing covariates with mean-one independent multiplicative\nerror ξj ∈[0, (1 −δ)−1] we have\nE˜Q0[ℓ(X, Y, θ⋆)] ≤1\nn\nn\nX\ni=1\nEQ⋆[ℓ(X ⊙ξ, Y, θ⋆)|X = xi, Y = yi].\n4. This follows from the fact that for any Q ∈U(Q0, δ) :\ninf\nθ∈Θ EQ[ℓ(X ⊙ξ, Y, θ)] ≤EQ[ℓ(X ⊙ξ, Y, θ)] ≤\nsup\nQ∈U(Q0,δ)\nEQ[ℓ(X ⊙ξ, Y, θ)].\nSee also the discussion of the minimax theorem in Ferguson (1967) p. 81.\n13\nBlanchet et al.\nThis means that the out-of-sample loss will be upper-bounded by the in-sample loss. Thus,\nour results give a concrete result about the class of distributions for which dropout training\nestimation “generalizes” well.\nFinally, we note that Theorem 2 was stated for a scalar δ that is homogeneous across\nthe multiplicative noise ξj. To model non-identical dropout noise, we can substitute the\nsets in (11) and (12) by Qj(δj) for a collection of parameters (δ1, . . . , δd) ∈[0, 1)d. In this\ncase, the results of Theorem 2 hold with Q⋆\nj = (1−δj)−1 ×Bernoulli(1−δj) for j = 1, . . . , d.\n5. Statistical Guidance on Choosing δ\nTheorem 2 in the previous section showed that dropout training is distributionally robust\noptimal and that nature’s least favorable distribution is dropout noise with probability\nδ ∈[0, 1). This section suggests a strategy to pick this parameter. Broadly speaking, our\napproach relies on a simple idea: we study how often the in-sample loss obtained from\ndropout training exceeds the population loss. If overﬁtting is successfully mitigated, this\nprobability ought to be large. We show that by appropriately tuning the parameter δ of\nthe dropout noise, it is possible to control the probability of such event as the sample size\ngrows large.\n5.1 Additional Notation\nThroughout this section, we use bφ to denote an arbitrary √n-consistent, asymptotically\nnormal estimator for the scale parameter φ. Such estimator can be obtained, for example,\nby using bφML in (2). We use φ⋆to denote the true, unknown scale parameter. Just as\nbefore, we let bβ(δ) denote the dropout estimator of the true β⋆under dropout probability\nδ.\nThe in-sample loss of dropout training—given a dropout probability of δ—evaluated at\nparameters β and φ is given by\nLn(β, φ, δ) ≡1\nn\nn\nX\ni=1\nEδ [−ln f(yi|xi ⊙ξi, β, φ)] .\n(18)\nThe goal of this section is to understand how likely is that the in-sample loss in (18)—when\nevaluated at the dropout estimator bβ(δ) and some estimator bφ—exceeds the true population\nloss. Thus, if we deﬁne the population loss as\nL(β⋆, φ⋆) ≡EP ⋆[−ln f(Y |X, β⋆, φ⋆)] ,\n(19)\n14\nDropout Training is Distributionally Robust Optimal\nwe are interested in understanding how often\nLn(bβ(δn), bφ, δn) ≥L(β⋆, φ⋆),\n(20)\nwhere the sequence δn is allowed to change with the sample size.\n5.2 Additional Assumptions\nIt is well-known that under mild regularity conditions on the true data generating process—\nand without the need of dropout training—the usual in-sample loss evaluated at the Maxi-\nmum Likelihood estimators, which we can denote as Ln(bβML, bφML, 0), provides a consistent\nestimator for the population loss. This remains true if the Maximum Likelihood estima-\ntor for φ is replaced by another √n-consistent estimator bφ. One suﬃcient condition that\nguarantees such behavior is the following high-level assumption:\nAssumption 4 The following central limit theorem result holds for some σ2\n√n\n\u0010\nLn(β⋆, bφ, 0) −L(β⋆, φ⋆)\n\u0011 d→N(0, σ2).\nIn particular, the identity\n√n\n\u0010\nLn(bβML, bφ, 0) −L(β⋆, φ⋆)\n\u0011\n=√n\n\u0010\nLn(bβML, bφ, 0) −Ln(β⋆, bφ, 0)\n\u0011\n+ √n\n\u0010\nLn(β⋆, bφ, 0) −L(β⋆, φ⋆)\n\u0011\n,\nand Assumptions 1, 2, 4 imply\n√n\n\u0010\nLn(bβML, bφ, 0) −L(β⋆, φ⋆)\n\u0011 d→N(0, σ2).\n(21)\nWe view the result in (21) concerning the in-sample loss of Maximum Likelihood estimators,\nwhich is quite standard, as unsatisfactory. Our main complaint is that the probability of\nthe event\nLn(bβML, bφ, 0) ≤L(β⋆, φ⋆)\napproaches 1/2 as the sample size grows large. Our interpretation is that the in-sample\nloss at the Maximum Likelihood estimator is deceivingly small, as the true population loss\nwill be above it 50% of the time if the sample size is large enough. We argue that this\nprobability can be made smaller by appropriately tuning dropout noise.\n15\nBlanchet et al.\n5.3 In-sample loss of dropout training\nTheorem 2 showed that dropout noise is nature’s choice to inﬂict the highest loss for the\nstatistician at any parameter values. Therefore, invoking Theorem 2 using the empirical\ndistribution as the reference distribution, the random variable\nµn(β, φ, δ) ≡Ln(β, φ, δ) −Ln(β, φ, 0)\n(22)\nis nonnegative for any δ ∈[0, 1).\nSince Proposition 1 has shown that bβ(δn)\np→β⋆for\nany sequence δn →0, intuition suggests that the in-sample loss of dropout training,\nLn(bβ(δn), bφ, δn), may provide a consistent estimate of the population loss that does not\nunderestimate this limit frequently.\nOur result is the following proposition:\nProposition 3 Suppose that Assumptions 1, 2, 4 hold. Then for any sequence δn = c/√n,\n√n\n\u0010\nLn(bβ(δn), bφ, δn) −L(β⋆, φ⋆)\n\u0011 d→N(µ∞(β⋆, φ⋆, c), σ2),\nwhere µ∞(β⋆, φ⋆, c) ≥0 is the probability limit of\n√nµn\n\u0010\nβ⋆, bφ, δn\n\u0011\n,\nand µn(·) is deﬁned as in (22).\nProof See Appendix A.3.\nThe main message of Proposition 3 is that the probability of the event (20) can be\napproximated, as the sample size goes large, by the probability—under a normal random\nvariable with positive mean—of the positive half of the real line. Some elementary algebra\ncan be used to illustrate the main argument behind the proof. Note that\n√n\n\u0010\nLn(bβ(δn), bφ, δn) −L(β⋆, φ⋆)\n\u0011\n= √n\n\u0010\nLn(bβ(δn), bφ, δn) −Ln(β⋆, bφ, δn)\n\u0011\n+ √nµn(β⋆, bφ, δn)\n+ √n\n\u0010\nLn(β⋆, bφ, 0) −L(β⋆, bφ)\n\u0011\n.\nWe start by showing that the ﬁrst term converges in probability to zero. To do this we\nshow that\n√n(bβ(c/√n) −β⋆)\n16\nDropout Training is Distributionally Robust Optimal\nis asymptotically normal and that the derivative of Ln(·) with respect to β (evaluated at\nβ⋆) converges in probability to zero.\nThe key step in the proof shows that the second term has a ﬁnite probability limit. In\nfact, we can characterize this limit explicitly and show that\n√nµn(β⋆, bφ, δn)\np→c · µ,\nwhere\nµ ≡\n\n\n\nX\nξ∈A\nEP ⋆[Ψ((X ⊙ξ)⊤β⋆)]\n\n−dEP ⋆[Ψ(X⊤β⋆)] + EP ⋆[Y X⊤]β⋆\n\n\n.\na(φ⋆),\nand A is the collection of all vectors in {0, 1}d for which there is only one zero. In Section\n7 we provide an expression for this term in the linear regression model.\nIt is important to mention that the DRO interpretation of dropout training can be\nleveraged to select the dropout parameter δ. For example, a possible approach consists\nin choosing δ so that true data generating process belongs to nature’s choice set with\nsome prespeciﬁed probability. This approach, which is often advocated in the literature\nin machine learning and robustness (Hansen and Sargent, 2008), often leads to a very\npessimistic selection of δ simply because this criterion is not informed at all by the loss\nfunction deﬁning the decision problem. Further, in our problem, it is not possible to apply\nthis approach given that the set of multiplicative perturbations of the empirical distribution\nwill, in general, not cover the true data generating process.\nAnother approach involves using generalization bounds leading to ﬁnite sample guaran-\ntees; see, for instance a summary of this discussion in Section 6.2 of Rahimian and Mehrotra\n(2019). This method, while appealing, often requires either distributions with compact sup-\nport or strong control on the tails of the underlying distributions. Also, often, the bounds\ndepend on constants that may be too pessimistic or diﬃcult to compute.\nFinally, there is a recent method introduced in Blanchet et al. (2019b) for the case\nin which nature’s choice set is deﬁned in terms of the Wasserstein’s distance around the\nempirical distribution.\nThe idea therein is that—for a ﬁxed δ—every distribution that\nbelongs to nature’s choice set corresponds to an optimal parameter choice for the statistician.\nThus, one can collect each and every of the statistician’s optimal choices associated to each\ndistribution in nature’s uncertainty set, and treat the resulting region as a conﬁdence set\nfor the true parameter. This conﬁdence set grows bigger (in the sense of nested conﬁdence\nregions) as δ increases. The goal is then to minimize δ subject to a desired level of coverage\nin the underlying parameter to estimate. This leads to a data-driven choice of δ that is\nexplicitly linked to the statistician’s decision problem. However, this approach is not feasible\n17\nBlanchet et al.\nin our problem because, once again, regardless of the value of δ, the parameter choices for\neach of the multiplicative perturbations of the empirical distribution will, in general, fail to\ncover the true parameter.\nHence, we advocate the strategy of choosing the parameter δ to control how often the\nin-sample loss obtained from dropout training exceeds the population loss. The proof of\nProposition 3 shows that µ∞(β⋆, φ⋆, c) is of the form c · µ, where µ depends on (β⋆, φ⋆).\nConsequently, as long as µ > 0, it is straightforward to pick c to guarantee a pre-speciﬁed\n“coverage” of the population loss: for any α ∈(0, 1), if we pick c to be\nz1−α · σ/µ,\nwhere z1−α is the 1-α quantile of a standard normal, then the probability of the event (20)\nasymptotically approaches 1 −α. Thus, overﬁtting can be successfully mitigated.\n6. An Algorithm for Dropout Training\nThe goal of this section is to suggest an algorithm for solving the dropout training problem\ninf\nθ∈Θ EQ⋆[ℓ(X ⊙ξ, Y, θ)],\nwhere Q⋆= bPn⊗Q⋆\n1⊗. . .⊗Q⋆\nd and Q⋆\nj, j = 1, . . . , d is the dropout noise distribution deﬁned\nin (15). Notice that we here consider the speciﬁc case in which Q0 is set to the empirical\nmeasure bPn supported on n training samples {(xi, yi)}n\ni=1. We will use θ⋆\nn to denote the\nsolution of the dropout training problem above. It will sometimes be convenient to rewrite\nthis dropout training problem as\nmin\nθ\n1\nn\nn\nX\ni=1\nEQ⋆[ℓ(X ⊙ξ, Y, θ) | X = xi, Y = yi],\n(23)\nwhich coincides with expression (5). Conditioning on the values of (xi, yi) makes it clear that\nthe expectation is computed over the d-dimensional vector ξ. We now brieﬂy describe three\ncommon approaches to implement dropout training and we discuss some of its limitations.\n6.1 Naive Dropout Training\nBecause Q⋆\nj places mass on only two points, namely 0 and (1 −δ)−1, the support of the\njoint distribution Q⋆\n1 ⊗. . . ⊗Q⋆\nd has cardinality 2d. Thus, a naive approach to solve the\ndropout training problem (23) is to expand the objective function as a sum with n · 2d\nterms, then to apply a tailored gradient descent algorithm to the resulting optimization\nproblem. Unfortunately, this approach is computationally demanding because the number\n18\nDropout Training is Distributionally Robust Optimal\nof individual terms in the objective function grows exponentially with the dimension d of\nthe features.\n6.2 Dropout Training via Stochastic Gradient Descent\nAnother method to solve the dropout training problem in (14) is by stochastic gradient\ndescent (henceforth, SGD). This gives us the commonly used dropout training algorithm.\nFor the sake of comparison, we provide concrete details about this algorithm below.\nGiven a current estimate bθ, we compute an unbiased estimate of the gradient to the\nobjective function of (14), and move in the direction of the negative gradient with a suitable\nstep size. Since Q⋆is discrete, the expectation under Q⋆can be written as a ﬁnite sum and\nby diﬀerentiating under the expectation, we have\n∇θEQ⋆[ℓ(X ⊙ξ, Y, bθ)] = EQ⋆\nh\n∇θℓ(X ⊙ξ, Y, bθ)\ni\n.\n(24)\nThe standard SGD algorithm uses a naive Monte Carlo estimator as an estimate of the\ngradient (24), that is, at iterate k ∈N with incumbent solution bθk,\n∇θEQ⋆[ℓ(X ⊙ξ, Y, bθk)] ≈∇θℓ(xk ⊙ξk, yk, bθk),\nwhere (xk, yk, ξk) is an independent draw from Q⋆.\nOne drawback of using SGD to solve (14) is that it is not easily parallelizable, and thus\nits implementation can be quite slow. Moreover, under strong convexity assumption of the\nloss function ℓ, SGD only exhibits linear convergence rate (Nemirovski et al., 2009, Section\n2.1). By contrast, the gradient descent (GD) enjoys exponential convergence rate (Boyd\nand Vandenberghe, 2004, Section 9.3.1).\n6.3 Naive Monte Carlo Approximation for Dropout Training\nConsider solving the dropout training problem in (23) using a naive Monte Carlo approxi-\nmation. Instead of using 2d terms to compute\nEQ⋆[ℓ(X ⊙ξ, Y, θ) | X = xi, Y = yi],\nwe approximate this expectation by taking a large number of K i.i.d. draws {ξk\ni }K\nk=1,\nξk\ni ∈Rd, according to the distribution Q∗\n1 ⊗. . . ⊗Q∗\nd. When d is large this approximation\nis computationally cheaper than the naive dropout training procedure described above,\nprovided that K ≪2d.\n19\nBlanchet et al.\nThus, the naive Monte Carlo approximation of the dropout training problem is\nmin\nθ∈Θ\n1\nn\nn\nX\ni=1\n\"\n1\nK\nK\nX\nk=1\nℓ(xi ⊙ξk\ni , yi, θ)\n#\n,\n(25)\nwhere the random vectors ξk\ni are sampled independently—over both k and i—using the\ndistribution Q⋆\n1 ⊗. . . ⊗Q⋆\nd.\nRelative to the solution of the dropout training problem—which we denoted as θ⋆\nn—the\nminimizer of (25) is consistent and asymptotically normal as K →∞. This follows by\nstandard arguments; for example, those in Shapiro et al. (2014, Section 5.1). There are,\nhowever, two problems that arise when using (25) as a surrogate for the dropout training\nproblem. First, the solution to (25) is a biased estimator for θ⋆\nn. This means that if we\naverage the solution of (25) over the K · n diﬀerent values of ξk\ni , the average solution need\nnot equal θ⋆\nn. Second, implementing (25) requires a choice of K and, to the best of our\nknowledge, there is no oﬀ-the-shelf procedure for picking this number.\n6.4 Unbiased Multi-level Monte Carlo Approximation for Dropout Training\nTo address these two issues, we apply the recent techniques suggested in Blanchet et al.\n(2019a) that we refer to as Unbiased Multi-level Monte Carlo Approximations. Multi-level\nMonte Carlo methods (Giles, 2008, 2015) refer to a set of techniques for approximating\nthe expectation of random variables. The adjective “multi-level” emphasizes the fact that\nrandom samples of diﬀerent levels of accuracy are used in the approximation. Before pre-\nsenting the detailed algorithm, we provide a heuristic description. To this end, let bθ⋆\nn(K)\ndenote the level K solution of the problem in (25); that is, the solution based on K draws.\nDeﬁne the random variable\n∆K ≡bθ⋆\nn(K) −bθ⋆\nn(K −1).\nand, for simplicity, assume bθ⋆\nn(0) is deﬁned to equal a vector of zeros.\nUnder suitable\nregularity conditions, there holds\n∞\nX\nK=1\nE[∆K] = lim\nK→∞E[bθ⋆\nn(K)] = θ⋆\nn.\nConsider now picking K∗at random from some discrete distribution supported on the\nnatural numbers. Let p(·) denote the probability mass function of such distribution and\nconsider a Monte Carlo approximation scheme in which—after drawing K∗—we sample\n20\nDropout Training is Distributionally Robust Optimal\nK∗· n diﬀerent random vectors ξk\ni ∈Rd according to Q⋆\n1 ⊗. . . ⊗Q⋆\nd. The estimator\nZ(K∗) ≡∆K∗\np(K∗)\nhas two sources of randomness. Firstly, the random choice of K∗and, secondly, the random\ndraws ξk\ni . Averaging over both yields\nE[Z(K∗)] =\n∞\nX\nK=1\nE[Z(K∗)|K∗= K] · p(K) =\n∞\nX\nK=1\n(E[∆K]/p(K)) · p(K) = θ⋆\nn.\nThus, by taking into account the randomness in the selection of K, we have managed to\nprovide a rule for deciding the number of draws (speciﬁcally, our recommendation is to\npick K∗at random) and at the same time we have removed the bias of naive Monte Carlo\napproximations.\nOne possible concern with our suggested implementation is that the expected computa-\ntional cost of Z(K∗) could be inﬁnitely large. Fortunately, this issue can be easily resolved\nby an appropriate choice of the distribution p(·). To see this, deﬁne the computational cost\nsimply as the number of random draws that are required to obtain Z(K∗). In the construc-\ntion we have described above, we need K∗· n draws for the construction of the estimator.\nThus, the average cost is\nE[K∗· n] = n\n∞\nX\nK=1\nK · p(K)\nwhich, under mild integrability conditions on p(·), will be ﬁnite.5\nWe now present the algorithm that will be used to solve the dropout training problem.\nTo ensure that the estimator Z(K∗) has a ﬁnite variance, instead of deﬁning ∆K as the\ndiﬀerence between the level K and K −1 solutions to problem (25) in the above heuristic\narguments, we use solutions to problem (25) with a sample of size 2K+1 and with its odd\nand even sub-samples of size 2K.\nAlgorithm for the Unbiased Multilevel Monte Carlo: We present a paral-\nlelized version of it using L processors, but the suggested algorithm works even when L = 1.\nParallel computing reduces the variance of the estimator, and our suggestion is to use as\nmany processors as available in one run.\nFix an integer m0 ∈N such that 2m0+1 ≪2d.\nFor each processor l = 1, . . . , L we\nconsider the following steps.\n5. For example, if p(·) is selected as a geometric distribution with parameter r, the expected computational\ncost will be n(1 −r)/r.\n21\nBlanchet et al.\ni) Take a random (integer) draw, m∗\nl , from a geometric distribution with parameter\nr > 1/2.6\nii) Given m∗\nl , take 2K∗\nl +1 i.i.d. draws from the d-dimensional vector ξi ∼Q⋆\n1 ⊗. . . ⊗Q⋆\nd,\nwhere\nK∗\nl ≡m0 + m∗\nl .\nRepeat this step independently for each i = 1, . . . , n.\niii) Solve problem (25) using the ﬁrst 2m0 i.i.d. draws of ξi for each i. Let θl,m0 denote a\nminimizer.\niv) Denote by bθ⋆\nn(2K∗\nl +1), bθO\nn (2K∗\nl ), and bθE\nn (2K∗\nl ) any solution to the following optimization\nproblems (all of which are based on sample average approximations as (25)):\nbθ⋆\nn(2K∗\nl +1) ∈arg min\nθ∈Θ\n1\nn\nn\nX\ni=1\n\n\n1\n2K∗\nl +1\n2K∗\nl +1\nX\nk=1\nℓ(xi ⊙ξk\ni , yi, θ)\n\n,\nbθO\nn (2K∗\nl ) ∈arg min\nθ∈Θ\n1\nn\nn\nX\ni=1\n\n1\n2K∗\nl\n2K∗\nl\nX\nk=1\nℓ(xi ⊙ξ2k−1\ni\n, yi, θ)\n\n,\nbθE\nn (2K∗\nl ) ∈arg min\nθ∈Θ\n1\nn\nn\nX\ni=1\n\n1\n2K∗\nl\n2K∗\nl\nX\nk=1\nℓ(xi ⊙ξ2k\ni , yi, θ)\n\n.\nIntuitively, bθO\nn and bθE\nn denote the solutions to problem (25) but using a sample of size\n2Kl with only odd and even indices, respectively.\nv) Deﬁne\n¯∆K∗\nl ≡bθ⋆\nn(2K∗\nl +1) −1\n2(bθO\nn (2K∗\nl ) + bθE\nn (2K∗\nl ))\nand let\nZ(K∗\nl ) =\n¯∆K∗\nl\nr(1 −r)K∗\nl −m0 + θl,m0.\n6. To see why we require that r > 1/2, notice if the computational cost of evaluating Z(K∗) (as in\nthe heuristic description above) increases exponentially in K and takes the form C · 2K, the expected\ncomputational cost will be\n∞\nX\nK=1\nCr(2(1 −r))K = Cr(1/2(1 −r)),\nprovided 2(1 −r) < 1, or equivalently, r > 1/2. As we show in the proof of Theorem 4, constraining the\nvariance requires then imposing r < 3/4. Ultimately, optimizing the product of computational cost and\nvariance leads to the optimal selection r = 1 −2−3/2.\n22\nDropout Training is Distributionally Robust Optimal\nOur recommended estimator is\n1\nL\nL\nX\nl=1\nZ(K∗\nl ).\nWe now show that the suggested algorithm gives an estimator with desirable properties.\nWe do so under the following regularity assumptions.\nAssumption 5 Suppose that the parameter space Θ is compact. Suppose in addition that\nthe optimal solution θ⋆\nn to the dropout training problem in (23) is (globally) unique.\nAssumption 6 Let bθ⋆\nn(K) denote the solution of the problem in (25) based on K draws.\nSuppose that as K →∞,\nE[∥K\n1\n2 (bθ⋆\nn(K) −θ⋆\nn)∥4\n2) = O(1),\nwhere the expectation is taken over the i.i.d dropout noise distribution used to generate ξk\ni .\nAssumption 7 Assume that for each (X, Y, ξ), ℓ(X ⊙ξ, Y, ·) is thrice continuously diﬀer-\nentiable over Θ and that\n∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)]\nis non-singular.\nTheorem 4 Under Assumption 5, E[Z(K∗\nl )] = θ⋆\nn. The number of random draws required\nto compute Z(K∗\nl ) is n·2K∗\nl +1 and thus the expected computational complexity for producing\nZ(K∗\nl ) equals\nn(2m0+1)r\n2r −1\n< n(2m0+1) ≪n2d.\nSuppose, in addition, that bθ⋆\nn(K) is almost surely in the interior of Θ for K large enough.\nIf Assumptions 6 and 7 hold, and r < 3/4. Then Var(Z(K∗\nl )) < ∞.\nProof See Appendix A.4.\nOur suggested algorithm has ﬁnite expected computational complexity that does not\ngrow exponentially with the dimension d, thus every time we need to obtain bθ⋆\nn(2K⋆\nl +1),\nwe can do so by applying a gradient descent algorithm. Combined with parallelization,\nthe Unbiased Multi-level Monte Carlo approach produces an unbiased estimator with a\nvariance that can be made arbitrarily small if L is large enough, provided that the regularity\nassumptions that give Var(Z(K∗\nl )) < ∞are satisﬁed.\n23\nBlanchet et al.\n7. Numerical Experiment\nWe conduct numerical experiments in this section to compare our preferred implementation\nof dropout training to Stochastic Gradient Descent, as well as our recommended selection\nof δ to cross-validation. The beneﬁts of our suggested Unbiased Multi-Level Monte Carlo\nalgorithm are analyzed using a high-dimensional regression, whereas our selection of δ is\nanalyzed using a low-dimensional regression model.\n7.1 Advantage of the Unbiased Multi-level Monte Carlo Estimator\nWe present a simple numerical experiment to illustrate the advantage of using the Unbiased\nMulti-level Monte Carlo estimator suggested in Section 6.4. We consider the linear regres-\nsion problem with known variance and we focus on solving the dropout training problem\nwith our recommended δ chosen according to Proposition 3.\nOur simulation setting considers a linear regression model with covariate vector having\ndimension d = 100 and sample size n = 50. We pick a known regression coeﬃcient β0 ∈Rd\nbeing a vector with all entries equal to 1. With ﬁxed coeﬃcients, we assume the covariate\nvector follows independent Gaussian, as well as for the regression noise. More speciﬁcally,\nwe can get our n = 50 observations (xi, yi) via\n• sampling xi ∼N(0, Id), i = 1, . . . , n,\n• sampling yi ∈R conditional on xi, where yi is given by the linear assumption and εi\nare i.i.d. random noise following N(0, 102), for i = 1, . . . , n.\nOur simulation setting considers ﬁrst a high-dimension setting (relative low ratio between\nsample size per dimension n/d = 0.5) with high noise to signal ratio (variability on residual\nnoise is high compared to the variability on xi).\nIf we set Q0 to be the empirical distribution of {(xi, yi)n\ni=1}, the dropout training problem\nin the linear regression model is\nmin\nβ∈Rd EQ⋆\n\u0014\u0010\nβ⊤(X ⊙ξ) −Y\n\u00112\u0015\n.\nCorollary 7 in Appendix A.5 shows that in the linear regression model the dropout training\nproblem can be written as\nmin\nβ∈Rd\n1\nn\n\u0014\n(Y −Xβ)⊤(Y −Xβ) +\nδ\n1 −δβ⊤Λβ\n\u0015\n,\nwhere Y = [y1, y2, . . . , yn]⊤, X = [x1, x2, . . . , xn]⊤and Λ is the diagonal matrix with its\ndiagonal elements given by the diagonals of X⊤X. Moreover, there is a closed-form solution\n24\nDropout Training is Distributionally Robust Optimal\nfor the dropout training problem and it is given by the ridge regression formula:\nβ⋆\nn =\n\u0012\nX⊤X +\nδ\n1 −δΛ\n\u0013−1\nX⊤Y.\nWe choose the dropout probability δ following Proposition 3. More speciﬁcally, Propo-\nsition 3 suggests the choice δ = c/√n where c = z1−α · σ/µ. For linear regression with\nknown variance, it is straightforward to compute\nµ =\n1\n2φ⋆\nd\nX\nj=1\nEP ⋆[X2\nj ](β⋆\nj )2,\nand\nσ2 = VarP ⋆\n\u00141\n2 log(2πφ⋆) + (Y −(β⋆)⊤X)2\n2φ⋆\n\u0015\n.\nChoosing α = 0.1 and note that β⋆= β0, φ⋆= 102, we have δ ≈0.26.\nSince neither our suggested Multi-level Monte Carlo algorithm nor standard SGD (as\ndeﬁned in Section 6.2) uses closed-form formulae for their implementation, we analyze the\nextent to which these procedures can approximate the parameter β⋆\nn. We provide more\ndetails of the algorithms as follows. The two algorithms we compare are:\n• Standard SGD algorithm with a learning rate 0.0001, and initialization at the origin.\nNote that however we take batched SGD instead of single-sample SGD introduced in\nSection 6.2.\n• Multi-level Monte Carlo algorithm with the geometric rate r = 0.6 and the burn-in\nperiod m0 = 5. Note that in each parallel running, we use gradient descent (GD) with\n0.01 learning rate and initialization at origin for steps iii) and iv) in Section 6.4.\nWe run our simulation on a cluster with two Intel(R) Xeon(R) CPU E5-2640 v4 @ 2.40GHz\nprocessors (with 10 cores each), and a total memory of 128 GB. We ﬁx 60 seconds as a\n“wall-clock time”, so that we terminate the two algorithms after 60 seconds.7\nWe run 1000 independent experiments.\nFor each run, we calculate and report the\naverage parameter estimation divergence to β⋆\nn and 1-standard deviation error bar for the\ndivergence. We consider diﬀerence number of parallelizations (i.e., L in Section 6.4) from\n400 to 2400. We cap the run at 2400 due to the saturation of divergence after ∼2000\nparallelizations.\n7. The parameters for the SGD algorithm are appropriately tuned to achieve good convergence within 60s\n(see Appendix A.6 for the tuning procedure). However, we do not claim that this choice of parameters\nis optimal.\n25\nBlanchet et al.\nFigure 1 shows the l2 divergence to the true β⋆\nn of the two algorithms for varying L,\nwhile Figure 2 and Figure 3 show l∞and l1 divergence, respectively. We observed that\nour unbiased estimator outperforms standard SGD algorithm once the number of parallel\niterations reaches above some moderate threshold (∼1000 here). We provide supporting\nevidence in Appendix A.6 to argue our choice of learning rate, initialization, and wall-clock\ntime, where our proposed algorithm is robust to any reasonable choices.\nFigure 1: l2 diﬀerence\nFigure 2: l∞diﬀerence\n7.2 Coverage of the True Loss of Dropout Training\nWe validate that our recommended selection of δ guarantees that the in-sample loss of\ndropout training is covering the true loss with arbitrary high probability as prescribed by\nProposition 3.\n26\nDropout Training is Distributionally Robust Optimal\nFigure 3: l1 diﬀerence\nWe use the same linear regression model with dimension d = 10 and training samples\nn ∈{103, 104}. We choose diﬀerent quantiles of the normal as in Proposition 3. We also\ninclude 10-fold cross validation and ordinary least squares for comparison. See Table 1,\nwhere we estimate the frequency of coverage over 1000 independent runnings. The main\nmessage is that our suggested choice of δ guarantees that the in-sample loss of dropout\ntraining exceeds the true, unknown, population loss with probability 1−α. Using standard\nOLS or choosing δ by cross-validation the in-sample loss is smaller than the population loss\nwith probability close to 1/2, which implies that these methods are unsatisfactory in terms\nof frequency of coverage.\nα = 0.2\nα = 0.1\nα = 0.05\n10-fold CV\nplain OLS\nn = 103\n0.77 ± 0.01\n0.88 ± 0.01\n0.94 ± 0.01\n0.52 ± 0.02\n0.40 ± 0.01\nn = 104\n0.79 ± 0.01\n0.90 ± 0.01\n0.94 ± 0.01\n0.49 ± 0.02\n0.47 ± 0.02\nTable 1: Frequency of in-sample loss covering the true population loss. Our recommended\nselection of δ = c/√n with c = z1−ασ/µ has a theoretical 1−α coverage probability.\n8. Extensions\nIn this section we discuss the extent to which the decision-theoretic support for dropout\ntraining carries over to Neural Networks. The main idea is that we use a GLM model where\nthe natural parameter is no longer a linear function of the covariates, but instead a neural\nnetwork.\n27\nBlanchet et al.\n8.1 One-hidden-layer Feed-Forward Neural Networks\nSuppose the scalar response variable Y is generated by the conditional density\nf(Y |X, θ, φ) ≡h(Y, φ) exp ((Y Ωθ(X)) −Ψ(Ωθ(X))) /a(φ)) ,\n(26)\nwhere Ωθ(X) is a neural network with parameters θ and X ∈Rd. This is a simple extension\nof the regression model that has been used recently to study deep neural networks; see\nSchmidt-Hieber (2020) in which the conditional density is Gaussian.\nIn this section, we will assume that Ωθ(X) is a neural network with a single hidden\nlayer, a diﬀerentiable activation (squashing) function, and linear ouput function. A function\nh : R →[0, 1] is a squashing function if it is non-decreasing and if\nlim\nr→∞h(r) = 1,\nlim\nr→−∞h(r) = 0.\nSee Deﬁnition 2.3 in Hornik et al. (1989).\nAlthough these types of networks—which will be formally described below—are restric-\ntive compared to the modern deep learning architectures, they can approximate any Borel\nmeasurable function from a ﬁnite-dimensional space to another, provided the hidden units\nin the hidden layer are large; see Hornik et al. (1989).\nConsider a neural network with K units in the hidden layer, each using input weights\nwk ∈Rd, k = 1, . . . , K. Denote the activation function in the hidden layer as h(·). Assume\nthe output function is linear with vector of weights β ∈RK. Thus, the network under\nconsideration is deﬁned by the function:\nΩθ(X) ≡β1h(w⊤\n1 X) + . . . + βKh(w⊤\nKX) = β⊤H(X),\nwhere H(X) = (h(w⊤\n1 X), . . . , h(w⊤\nKX))⊤. The neural network is parameterized by θ ≡\n(β⊤, w⊤\n1 , . . . , w⊤\nk )⊤. Under this model, the distribution of Y |X is a GLM model with co-\nvariates H(X).\n8.1.1 Statistician’s Objective Function\nWe will endow the statistician with the loss function given by the negative of the conditional\nlog-likelihood for the model in (26).\n8.1.2 Nature’s Uncertainty Set\nWe allow nature to introduce additional noise to the statistician’s model. We do this in\ntwo steps. First, we allow nature to distort the distribution of X using a multiplicative\nnoise denoted as ξ(1) ∈Rd. This is exactly analogous to what we did in the GLM model,\n28\nDropout Training is Distributionally Robust Optimal\nwhere nature was allowed to pick a distribution for the covariates of the form (X ⊙ξ(1)).\nUsing the jargon of neural networks, we allow nature to contaminate the input layer with\nindependent and multiplicative noise. Second, we also allow nature to contaminate each of\nthe hidden units with multiplicative noise ξ(2) ∈RK. That is, nature is also allowed to pick\na vector ξ(2) = (ξ(2)1, . . . , ξ(2)K)⊤, independently of ξ(1) ∈Rd, to distort the each of the\nK units in the hidden layer as\nH(X) ⊙ξ(2) ≡(h(w⊤\n1 X)ξ(2)1, . . . , h(w⊤\nKX)ξ(2)K)⊤.\nOur choice of a one-hidden neural network was simply for expositional simplicity, but\nthe analysis would be the same with a feed-forward neural network with L hidden layers.\n8.1.3 Minimax Solution\nThe minimax solution of the DRO game is given by\ninf\nθ sup\nQ\nEQ [−ln f(Y |H(X ⊙ξ1) ⊙ξ2, β, φ)] ,\n(27)\nwhere Q now refers to the joint distribution of (X, Y, ξ(1), ξ(2)) and f(Y |X, β, φ) is the GLM\ndensity deﬁned in (1). We continue working with the assumption that ξ ≡(ξ(1)⊤, ξ(2)⊤)⊤\nhas independent marginals and that it is independent of (X, Y ).\nWe would like to solve for the worst-case distributions of the random vectors ξ(1) and\nξ(2), assuming that both of these satisfy the restrictions analogous to (12). The solution\nfor the distribution of ξ(2) can be obtained as a corollary to Theorem 2, as it suﬃces to\ndeﬁne\n˜X ≡H(X ⊙ξ(1)),\nand view (27) as the DRO problem in a linear regression model, in which the data is\n( ˜X, Y ) and ξ(2) ∈RK is simply the multiplicative noise that transforms the covariates into\n( ˜X ⊙ξ(2)).\nThe worst-case choice of ξ(1), the multiplicative error for the inputs, is more diﬃcult\nto characterize and we were not able to ﬁnd general results for it. Below, we provide a\nheuristic argument suggesting that dropout noise might approximate the worst-case choice\nwhen the output layer is a Gaussian linear model. Let ξ(1)j denote the j-th coordinate of\nξ(1). Suppose that the distribution of this random variable places most of its mass on the\ninterval [1 −ϵ, 1 + ϵ].8 This allows us to ‘linearize’ the output of each of the hidden units\n8. This is compatible with dropout noise for which δ is very close to zero.\n29\nBlanchet et al.\naround the output corresponding to unperturbed inputs as\nh(w⊤\nk (X ⊙ξ(1)))\n=\nh(w⊤\nk (X ⊙(ξ(1) −1)) + w⊤\nk X)\n≈\nh(w⊤\nk X) +\n\u0010\n˙h(w⊤\nk X) · (wk ⊙X)⊤(ξ(1) −1)\n\u0011\n.\nIn the notation above, 1 denotes the d-dimensional vector of ones. For the sake of exposition,\nignore the approximation error in the linearization above. If we ﬁx (X, Y, ξ(2)), then the\nworst-case choice for the distribution of ξ(1), denoted by Q(1), maximizes\nEQ(1)\n\n\n\n\nK\nX\nk=1\nβk · ξ(2)k ·\n\nh(w⊤\nk X) +\n\n˙h(w⊤\nk X) ·\nd\nX\nj=1\nwk,j · Xj · (ξ(1)j −1)\n\n\n\n\n\n\n2\n\namong all distributions with independent marginals for which EQ(1)[ξ(1)j] = 1 for all j =\n1, . . . , d. Algebra shows that such maximization problem is equivalent to maximizing\nEQ(1)\n\n\n\n\nK\nX\nk=1\nβk · ξ(2)k · ˙h(w⊤\nk X) ·\n\n\nd\nX\nj=1\nwk,j · Xj · (ξ(1)j −1)\n\n\n\n\n2\n,\n(28)\nwhich in turn can be written as\nEQ(1)\n\u0014\u0010\na⊤(ξ(1) −1)\n\u00112\u0015\nfor an appropriate choice of a vector a ∈Rd that depends only on (β, ξ(2), h, ˙h, w, X).\nProposition 6 in Appendix A.2 shows that the solution to this problem is dropout noise.\n9. Concluding Remarks\nIn this paper we studied dropout training, an increasingly popular estimation method in\nmachine learning. Dropout training is a fundamental part of the modern machine learning\ntechniques for training very deep networks (Goodfellow et al., 2016).\nOur main result (Theorem 2) established a novel decision-theoretic foundation for the\nuse of dropout training. We showed that this method, when applied to Generalized Linear\nModels, can be viewed as the minimax solution to an adversarial two-player, zero-sum\ngame between a statistician and nature. The framework used in this paper is known in\nthe stochastic optimization literature (Shapiro et al., 2014) as a Distributionally Robust\nOptimization (DRO) problem.\nOur minimaxity result showed, by construction, that dropout training indeed provides\nout-of-sample performance guarantees for distributions that arise from multiplicative per-\n30\nDropout Training is Distributionally Robust Optimal\nturbations of the in-sample data. Our result thus justiﬁed explicitly the ability of dropout\ntraining to enhance the out-of-sample performance, which is one of the reasons often invoked\nto promote the dropout method.\nIn addition to our theoretical result, we also suggested a new strategy to select the\ndropout probability and a new stochastic optimization implementation of dropout training.\nFor the latter, we borrowed ideas from the Multi-level Monte Carlo literature—in particular\nfrom the work of (Blanchet et al., 2019a)—to suggest an unbiased dropout training routine\nthat is easily parallelizable and that has a smaller computational cost compared to naive\ndropout training methods when the number of features is large (Theorem 4). Crucially,\nwe showed that under some regularity conditions our estimator has ﬁnite variance (which\nmeans there are also theoretical, and not just practical, gains from parallelization).\nWe also discussed the extent to which our theoretical results extended to Neural Net-\nworks (in particular, to the universal approximators in (Hornik et al., 1989) consisting of a\nsingle-hidden layer and a squashing activation function). Our results showed that Theorem\n2 can be used to establish the optimality of dropout training to estimate the parameters of\nthe last hidden layer in general feed-forward neural networks, where the output layer takes\nthe form of a Generalized Linear Model. We hope that our analysis serves as a foundation\nto understand the beneﬁts of dropout training in Neural Networks.\nAcknowledgments\nWe would like to thank Matias Cattaneo, Max Farrell, Michael Leung, Ulrich M¨uller, Mark\nPeletier, Hashem Pesaran, Ashesh Rambachan, Roger Moon, Frank Schorfheide, Stefan\nWager, and participants at the Statistics Seminar series at Columbia University for helpful\ncomments and suggestions. Jos´e Blanchet acknowledges support from NSF grants 1915967,\n1820942, 1838576 and the Chinese Merchant Bank. Material in this paper is based upon\nwork supported by the Air Force Oﬃce of Scientiﬁc Research under award number FA9550-\n20-1-0397.\n31\nBlanchet et al.\nAppendix A.\nA.1 Proof of Proposition 1\nAlgebra shows that the dropout estimator of β maximizes\nQn(β) ≡1\nn\nn\nX\ni=1\nyi(β⊤xi) −Eδn[Ψ(β⊤(xi ⊙ξ))].\nIn a slight abuse of notation, let ξδ denote a realization of dropout noise parameterized by δ.\nThen it is possible to re-write the objective function as a weighted average of the functions\nQn,ξδn(β) ≡1\nn\nn\nX\ni=1\nyi(β⊤xi) −Ψ(β⊤(xi ⊙ξδn)).\nIt will be convenient then to deﬁne the limiting objective function to be\nQ(β) ≡EP ⋆[Y (β⊤X)] −EP ⋆[Eδ[Ψ(β⊤(X ⊙ξ))]],\nwhich, by Assumptions 1 and 2, is ﬁnite and strictly concave. The population objective\nfunction is then the average (over dropout noise) of\nQξδ(β) ≡EP ⋆[Y (β⊤X)] −EP ⋆[Ψ(β⊤(X ⊙ξδ))].\nIt is straightforward to show that β∗(δ) in (6) denote the unique maximizer of Q(β).\nProof The proof follows from standard arguments in the theory of extremum estimators.\nIn particular, it suﬃces to verify the conditions of Theorem 2.7 in Newey and McFadden\n(1994).\nCondition i) in Newey and McFadden (1994) requires Q(β) to be uniquely maximized\nat β∗(δ). This holds because Assumptions 1 and 2 imply that Q(β) is strictly concave.\nCondition ii) in Newey and McFadden (1994) requires β∗(δ) to be an element in the\ninterior of a strictly convex set, which holds because in the GLM models under consideration\nthe parameter space is Rd. Furthermore, Qn(β) is trivially concave by Assumption 1.\nCondition iii) requires Qn(β) to converge in probability to Q(β) for every β. For this\npurpose, it suﬃces to show that Qn,ξδn(β) converges in probability to Qξδ(β) for each ﬁxed\nβ, and for a sequence ξδn and ξδ that have zeros and non-zeros in exactly the same entries.\nAssumptions 1 and 2 imply EP ∗[Y (β⊤X)] < ∞for all β. Thus, using the Law of Large\n32\nDropout Training is Distributionally Robust Optimal\nNumbers for i.i.d sequences\n1\nn\nn\nX\ni=1\nYi(β⊤Xi)\np→EP ∗[Y (β⊤X)].\nFinally, Assumptions 1 and 2 imply that the triangular array\nZn,i = Ψ(β⊤(Xi ⊙ξδn)),\n1 ≤i ≤n,\nsatisﬁes the conditions for the Law of Large Numbers for triangular arrays (Theorem 2.2.11\nin Durrett (2019)), and consequently\n1\nn\nn\nX\ni=1\nΨ(β⊤(Xi ⊙ξδn))\np→EP ∗\nh\nΨ(β⊤(X ⊙ξδ))\ni\n.\nThis completes the proof.\nA.2 Proof of Theorem 2\nThe proof of Theorem 2 relies on the following two preparatory results.\nLemma 5 (Extremal expectation of a univariate convex function) For any −∞<\na < b < +∞, let ζ be a random variable in [a, b] with mean µ ∈[a, b]. For any function\nf : [a, b] →R convex and continuous, the distribution of ζ that maximizes E[f(ζ)] among\nall distributions over [a, b] with a given mean µ ∈[a, b] is a scaled and shifted Bernoulli\ndistribution, i.e.,\nζ =\n\n\n\na\nwith probability (b −µ)/(b −a),\nb\nwith probability (µ −a)/(b −a).\n(29)\nProof Let Q∗denote the probability measure induced by the random variable in (29). By\ndeﬁnition\nEQ∗[f(ζ)] = b −µ\nb −af(a) + µ −a\nb −a f(b).\nSuppose ﬁrst that µ = a.\nIn this case, Jensen’s inequality implies that for any other\nprobability measure Q over [a, b] with mean µ = a,\nEQ[f(ζ)] ≤f(EQ[ζ]) = f(a) = EQ∗[f(ζ)].\nAn analogous result holds if µ = b.\n33\nBlanchet et al.\nConsider then the case in which µ ∈(a, b). For an arbitrary probability measure Q over\n[a, b] with mean µ ∈(a, b), we have\nZ\n[a,b]\nf(ζ)dQ =\nZ\n[a,b]\nf\n\u0000ab −ζ\nb −a + bζ −a\nb −a\n\u0001\ndQ ≤\nZ\n[a,b]\n\u0000b −ζ\nb −af(a) + ζ −a\nb −a f(b)\n\u0001\ndQ,\nwhere the inequality follows from the convexity of f. By the linearity of the integral operator\nand the fact that\nR\n[a,b] ζdQ = µ, we ﬁnd\nZ\n[a,b]\nf(ζ)dQ ≤b −µ\nb −af(a) + µ −a\nb −a f(b).\nBecause the probability measure Q was chosen arbitrarily, this implies that the distribution\nof ζ in (29) maximizes the expectation of f(ζ).\nProposition 6 Fix a vector of tuning parameters δ ∈(0, 1)d. Let Qj(δj) be deﬁned as in\n(11). Suppose that A is a convex and continuous function on R. For any θ ∈Rd, we have\nsup\nn\nEQ1⊗...⊗Qd[A(θ⊤ξ)] : Qj ∈Qj(δj)\no\n= EQ⋆\n1⊗...⊗Q⋆\nd[A(θ⊤ξ)],\nwhere Q⋆\nj is a scaled Bernoulli distribution of the form Q⋆\nj = (1−δj)−1 ×Bernoulli((1−δj))\nfor each j = 1, . . . , d.\nProof First note that Q⋆\nj ∈Qj(δj) for each j, and thus Q⋆\n1 ⊗. . . ⊗Q⋆\nd is a feasible solution\nto the maximization problem.\nIt suﬃces to show that for any set of feasible measures\nQj ∈Qj(δj), j = 1, . . . , d, we have\nEQ1⊗...⊗Qd[A(θ⊤ξ)] ≤EQ⋆\n1⊗...⊗Q⋆\nd[A(θ⊤ξ)].\nTowards this end, pick any k ∈{1, . . . , d}. By Fubini’s theorem, we can write\nEQ1⊗...⊗Qd[A(θ⊤ξ)] = EQ1⊗...⊗Qk−1⊗Qk+1⊗...⊗QdEQk[A(θ⊤ξ)].\nFor any ﬁxed value (ξ1, . . . , ξk−1, ξk+1, . . . , ξd) the function ξk 7→A(P\nj̸=k θjξj + θkξk) is\nconvex in the variable ξk over the interval [0, (1 −δk)−1]. Thus by Lemma 5,\nEQk[A(\nX\nj̸=k\nθjξj +θkξk)] ≤EQ⋆\nk[A(\nX\nj̸=k\nθjξj +θkξk)]\nfor any ﬁxed (ξ1, . . . , ξk−1, ξk+1, . . . , ξd).\n34\nDropout Training is Distributionally Robust Optimal\nThus by the monotonicity of the expectation operator,\nEQ1⊗...⊗Qd[A(θ⊤ξ)] ≤EQ1⊗...⊗Qk−1⊗Qk+1⊗...⊗QdEQ⋆\nk[A(θ⊤ξ)] = EQ1⊗...⊗Qk−1⊗Q⋆\nk⊗Qk+1⊗...⊗Qd[A(θ⊤ξ)].\nBy cycling through all possible values of k ∈{1, . . . , d} we conclude that\nEQ1⊗...⊗Qd[A(θ⊤ξ)] ≤EQ⋆\n1⊗...⊗Q⋆\nd[A(θ⊤ξ)].\nTherefore, the postulated claim holds.\nWe are now ready to prove Theorem 2.\nProof Note that for Q ∈U(Q0, δ), Assumption 3 implies EQ[ℓ(X ⊙ξ, Y, θ)] is ﬁnite for any\nθ ∈Θ and any scalar δ ∈[0, 1). Therefore, from Fubini’s theorem and the deﬁnition of loss\nfunction:\nEQ[ℓ(X ⊙ξ, Y, θ)] = EQ0 [EQ1⊗...⊗Qd[ℓ(X ⊙ξ, Y, θ)]]\n= EQ0\nh\nEQ1⊗...⊗Qd[−ln h(Y, φ) + (Ψ(β⊤(X ⊙ξ)) −Y (β⊤(X ⊙ξ)))/a(φ)]\ni\n= −EQ0 [ln h(Y, φ)]\n+ EQ0\nh\nEQ1⊗...⊗Qd[(Ψ(β⊤(X ⊙ξ)) −Y (β⊤(X ⊙ξ)))/a(φ)]\ni\n.\nAlgebra shows that for any β, X and ξ:\nβ⊤(X ⊙ξ) = (β ⊙X)⊤ξ.\nThus, we can ﬁx the values of (X, Y, θ) and deﬁne the function\nA(X,Y,θ)((β ⊙X)⊤ξ) ≡(Ψ(β⊤(X ⊙ξ)) −Y β⊤(X ⊙ξ))/a(φ).\nNote that A(X,Y,θ) satisﬁes the condition of Proposition 6. Therefore\nsup\nn\nEQ1⊗...⊗Qd[A(X,Y,θ)((β ⊙X)⊤ξ)] : Qj ∈Qj(δj)\no\n= EQ⋆\n1⊗...⊗Q⋆\nd[A(X,Y,θ)((β ⊙X)⊤ξ)],\nfor any (X, Y, θ), which completes the proof.\n35\nBlanchet et al.\nA.3 Proof of Proposition 3\nProof We write √n(Ln(bβ(δn), bφ, δn) −L(β∗, φ∗)) as the sum of the following three terms\n√n\n\u0010\nLn(bβ(δn), bφ, δn) −Ln(β∗, bφ, δn)\n\u0011\n,\n(30a)\n√n\n\u0010\nLn(β∗, bφ, δn) −Ln(β∗, bφ, 0)\n\u0011\n,\n(30b)\n√n\n\u0010\nLn(β∗, bφ, 0) −L(β∗, φ∗, 0)\n\u0011\n.\n(30c)\nThe last term converges in distribution to a normal random variable, so we only need to\nanalyze (30a) and (30b).\nBy Assumptions 1 and 2 the term in (30a) admits an exact second-order Taylor expan-\nsion around β∗for every φ and δ. We argue that because of this, the term in question if\nop(1). First, using the same arguments as in Theorem 3.1 in Newey and McFadden (1994)\nwe can show that for any sequence δn = c/√n\n√n(bβ(δn) −β⋆) d→Σ(β∗)−1Nd(−c˜µ, a(φ∗)Σ(β∗)),\nwhere\nΣ(β) ≡EP ∗[¨Ψ(X⊤β)XX⊤],\nand\n˜µ ≡\n\nX\nξ∈A\nEP ⋆[ ˙Ψ((X ⊙ξ)⊤β⋆)(X ⊙ξ)]\n\n−(d −1)EP ⋆[Y X] + Σ(β∗)β∗.\nThe set A above is deﬁned as {ξ ∈{0, 1}d : exactly one entry of ξ is zero}. The argument\nis essentially the same as in every proof of asymptotic normality for extremum (or M-\nestimators), with the only diﬀerence being that, because of the dropout noise, the score\nterm is asymptotically normal with a nonzero mean. In fact,\n∇βLn(β, bφ, δn) ≡∇βLn(β, bφ, 0)+\n1\na(bφ)\n \n1\nn\nn\nX\ni=1\nEδn[(Xi ⊙ξ) ˙Ψ(β⊤(Xi ⊙ξ))] −Xi ˙Ψ(X⊤\ni β)\n!\n,\nwhere\n∇βLn(β, bφ, 0) ≡−\n1\na(bφ)\n1\nn\nn\nX\ni=1\nXi(Yi −˙Ψ(X⊤\ni β)).\nRecognizing the term ∇βLn(β, bφ, 0) as the negative of the score function in the GLM model\nand doing some algebra, it is possible to show that ∇βLn(β, bφ, δn) is op(1).\n36\nDropout Training is Distributionally Robust Optimal\nFor the term in (30b), note ﬁrst that it is nonnegative. Also: Ln(β∗, bφ, δn)−Ln(β∗, bφ, 0)\nequals\n1\na(bφ)\n \n1\n√n\nn\nX\ni=1\nEδn[Ψ((Xi ⊙ξ)⊤β∗)] −Ψ(X⊤\ni β∗)\n!\n.\nThe term in parenthesis has ﬁnite mean equal to\n∆n ≡EP ∗Eδn[Ψ((X ⊙ξ)⊤β∗)] −EP ∗[Ψ(X⊤β∗)].\n(31)\nIt can be shown—by verifying the conditions for the Law of Large Numbers for triangular\narrays (Theorem 2.2.11 in Durrett (2019))—that\n√n(Ln(β∗, δn) −Ln(β∗, 0) −a(bφ)−1∆n)\np→0.\nMoreover, Assumptions 1 and 2 imply\n√n∆n\np→∆,\nwhere\n∆≡c\n\nX\nξ∈A\nEP ⋆[Ψ((X ⊙ξ)⊤β⋆)] −dEP ⋆[Ψ(X⊤β⋆)] + EP ⋆[ ˙Ψ(X⊤β∗)X⊤β⋆]\n\n.\nThis gives the desired result.\nA.4 Proof of Theorem 4\nProof By deﬁnition\nZ(K∗\nl ) =\n¯∆K∗\nl\nr(1 −r)m∗\nl + θl,m0,\nwhere K∗\nl is a discrete random variable with probability mass function:\np(K∗\nl ) = r(1 −r)K∗\nl −m0,\nand supported on the integers larger than m0.\n37\nBlanchet et al.\nWe ﬁrst show that the estimator Z(K∗\nl ) is unbiased (as we average over both K∗\nl and\nξk\ni ). Algebra shows that\nE[Z(K∗\nl )]\n=\n∞\nX\nK=m0\nE[Z(K∗\nl )|K∗\nl = K]p(K)\n=\n∞\nX\nK=m0\nE\n\" ¯∆K∗\nl\np(K∗\nl ) + θl,m0\n\f\f\f\f\fK∗\nl = K\n#\np(K)\n=\n∞\nX\nK=m0\nE\n\" ¯∆K\np(K) + θl,m0\n\f\f\f\f\fK∗\nl = K\n#\np(K)\n=\n\n\n∞\nX\nK=m0\nE\n\u0014\nbθ⋆\nn(2K+1) −1\n2(bθO\nn (2K) + bθE\nn (2K))\n\u0015\n+ E[θl,m0]\n=\n−1\n2\n\u0010\nE[bθO\nn (2m0)] + E[bθE\nn (2m0)]\n\u0011\n+ E[θl,m0] + lim\nK→∞E[bθ⋆\nn(2K+1)].\nThe expectations in the last line are all ﬁnite because Θ is compact. In addition, since the\ndraws are i.i.d. and θl,m0 is the solution to the problem (25) when 2m0 draws are used we\nhave\n−1\n2\n\u0010\nE[bθO\nn (2m\n0 )] + E[bθE\nn (2m\n0 )]\n\u0011\n+ E[θl,m0] = 0.\nMoreover, the sequence of random variables\n{bθ⋆\nn(2K+1)}\nis uniformly integrable, because Θ is a compact subset of a ﬁnite-dimensional Euclidean\nspace. Finally, we know that\nbθ⋆\nn(2K+1)\np→θ⋆\nn\nas K →∞. The uniform integrability of the sequence of estimators then implies\nlim\nK→∞E[bθ⋆\nn(2K+1)] = E\n\u0014\nlim\nK→∞\nbθ⋆\nn(2K+1)\n\u0015\n= θ⋆\nn,\nsee Theorem 6.2 in DasGupta (2008). We conclude that\nE[Z(K∗\nl )] = lim\nK→∞E[bθ⋆\nn(2K+1)] = θ⋆\nn.\nNow we show that the expected computational cost of Z(K∗\nl ) is ﬁnite. In order to com-\npute Z(K) for a given K we need n·2K+1 random draws. Thus, the expected computational\n38\nDropout Training is Distributionally Robust Optimal\ncost of Z(K∗\nl ) is\n∞\nX\nK=m0\nn2K+1r(1 −r)K−m0\n=\nn · (2m0+1) · r\n∞\nX\nK=m0\n2K−m0(1 −r)K−m0\n=\nn · (2m0+1) · r\n∞\nX\nK=m0\n(2(1 −r))K−m0.\nThe term above converges to\nn · (2m0+1) · r\n1 −2(1 −r) = n · (2m0+1) · r\n2r −1\nprovided that 2(1 −r) < 1, which holds because we have chosen r > 1/2.\nFor the proof on ﬁnite variance, we intend to show that\nE\nh\n¯∆⊤\nK ¯∆K\ni\n= O(2−2K)\n(32)\nas K →∞. Equation (32) guarantees that every processor generates an estimator Z(K∗\nl )\nwith ﬁnite variance. Since K∗\nl is a discrete random variable with probability mass function\np(K∗\nl ) = r(1 −r)K∗−m0,\nand\nE[Z(K∗\nl )⊤Z(K∗\nl )]\n=\n∞\nX\nK=m0\nE\nh\nZ(K∗\nl )⊤Z(K∗\nl )|K∗\nl = K\ni\np(K)\n=\n∞\nX\nK=m0\nE\n\"\u0012 ¯∆K\np(K) + θl,m0\n\u0013⊤\u0012 ¯∆K\np(K) + θl,m0\n\u0013#\np(K)\n≤\n2\n\n\n∞\nX\nK=m0\nE\n\u0014 ¯∆⊤\nK ¯∆K\np(K)2\n\u0015\np(K) +\n∞\nX\nK=m0\nE\nh\nθ⊤\nl,m0θl,m0\ni\np(K)\n\n\n≤\nC\n\n\n∞\nX\nK=m0\n2−2K\np(K) + sup\nθ∈Θ\n∥θ∥2\n2p(K)\n\n\n≤\nC\n\n\n∞\nX\nK=m0\n1\n22m022(K−m0)p(K) + sup\nθ∈Θ\n∥θ∥2\n2p(K)\n\n\n≤\nC1\n\n\n∞\nX\nK=m0\n1\nr4m0\n1\n(4(1 −r))K−m0\n\n+ C2.\n39\nBlanchet et al.\nThe geometric sum in the last expression is ﬁnite because we have assumed that r < 3\n4.\nTo show (32), we do a Taylor expansion of the ﬁrst-order conditions of the problem (25)\naround θ⋆\nn. The Karush-Kuhn-Tucker optimality condition for the level 2K solution bθ⋆\nn(2K)\nof the problem in (25) implies\n0 =\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θℓ(xi ⊙ξk\ni , yi, bθ⋆\nn(2K))\n\n.\nIt follows by the Taylor expansion and Assumption 4 that\n0\n=\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θℓ(xi ⊙ξk\ni , yi, θ⋆\nn)\n\n+\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θθℓ(xi ⊙ξk\ni , yi, θ⋆\nn)\n\n\n\u0010\nbθ⋆\nn(2K) −θ⋆\nn\n\u0011\n+RK,θ\n=\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θℓ(xi ⊙ξk\ni , yi, θ⋆\nn)\n\n+\nn\nX\ni=1\n∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi]]\n\u0010\nbθ⋆\nn(2K) −θ⋆\nn\n\u0011\n+RK + RK,θ,\n(33)\nwhere\nRK ≡\n\n\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θθℓ(xi ⊙ξk\ni , yi, θ⋆\nn) −∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi]\n\n\n\n\n\u0010\nbθ⋆\nn(2K) −θ⋆\nn\n\u0011\nand\n∥RK,θ∥2 ≤\nn\nX\ni=1\nsup\nθ∈Θ,ξ\n∥∇θθθℓ(xi ⊙ξ, yi, θ)∥2\n\r\r\rbθ⋆\nn(2K) −θ⋆\nn\n\r\r\r\n2\n2 ≤C3\n\r\r\rbθ⋆\nn(2K) −θ⋆\nn\n\r\r\r\n2\n2\nby Assumption 4. Thus by Assumption 3, we have\nE[R⊤\nK,θRK,θ] = O(2−2K)\nas K →∞. Moreover, by the multivariate version of Theorem 2 in Bahr (1965) which\nfollows from the Cram´er-Wold theorem, we have that\nE\n\n\n\r\r\r\r\r\r\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θθℓ(xi ⊙ξk\ni , yi, θ⋆\nn) −∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi]\n\n\n\r\r\r\r\r\r\n4\n2\n\n\nis O(2−2K).\n40\nDropout Training is Distributionally Robust Optimal\nWe can express R⊤\nKRK as ∥RK∥2. The Cauchy-Schwarz inequality implies\nE[R⊤\nKRK]\n≤E\n\n\n\r\r\r\r\r\r\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θθℓ(xi ⊙ξk\ni , yi, θ⋆\nn) −∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi]\n\n\n\r\r\r\r\r\r\n2\n2\n·\n\r\r\rbθ⋆\nn(2K) −θ⋆\nn\n\r\r\r\n2\n2\n\u0015\n.\nBy H¨older’s inequality we have\nE[R⊤\nKRK]\n≤E\n\n\n\r\r\r\r\r\r\nn\nX\ni=1\n\n1\n2K\n2K\nX\nk=1\n∇θθℓ(xi ⊙ξk\ni , yi, θ⋆\nn) −∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi]\n\n\n\r\r\r\r\r\r\n4\n2\n\n\n1\n2\n×\nE\n\u0014\r\r\rbθ⋆\nn(2K) −θ⋆\nn\n\r\r\r\n4\n2\n\u0015 1\n2\n≤O(2−2K).\nFinally, consider the solutions bθ⋆\nn(2K⋆\nl +1), bθO\nn (2K⋆\nl ), bθE\nn (2K⋆\nl ) conditional on K⋆\nl = K. De-\nnote the remainder terms in (33) corresponding to the level 2K+1 solution bθ⋆\nn(2K+1) as\nR⋆\nK+1, R⋆\nK+1,θ. Similarly, denote the remainder terms in (33) corresponding to the level 2K\nsolution bθO\nn (2K) (and, respectively, bθE\nn (2K)) as RO\nK, RO\nK,θ ( RE\nK, RE\nK,θ). By the construction\nof bθO\nn (2K), bθE\nn (2K) using odd and even indices, we have, from (33)\n−\nn\nX\ni=1\n∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi]\n\u0012\nbθ⋆\nn(2K+1) −1\n2(bθO\nn (2K) + bθE\nn (2K))\n\u0013\n=R⋆\nK+1 −1\n2(RO\nK + RE\nK) + R⋆\nK+1,θ −1\n2(RO\nK,θ + RE\nK,θ).\nBy Assumption 4,\nn\nX\ni=1\n∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)|X = xi, Y = yi] = n · ∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)]\n41\nBlanchet et al.\nis invertible. Thus, we have shown that\n¯∆K ≡bθ⋆\nn(2K+1) −1\n2(bθO\nn (2K) + bθE\nn (2K))\n= (n · ∇θθEQ⋆[ℓ(X ⊙ξ, Y, θ⋆\nn)])−1\n\u0012\nR⋆\nK+1 −1\n2(RO\nK + RE\nK) + R⋆\nK+1,θ −1\n2(RO\nK,θ + RE\nK,θ)\n\u0013\n.\nSince each of the terms on the right-hand side have been shown to be O(2−2K), we conclude\nthat E[ ¯∆⊤\nK ¯∆K] = O(2−2K).\nA.5 Dropout Training in Linear Regression\nCorollary 7 (Linear regression with φ = 1) For linear regression with ℓ(x, y, β) = (β⊤x−\ny)2, we have\nmin\nβ∈Rd\nmax\nQ∈U(bPn,δ)\nEQ\nh\u0000β⊤(X ⊙ξ) −Y\n\u00012i\n= min\nβ∈Rd EQ⋆\nh\u0000β⊤(X ⊙ξ) −Y\n\u00012i\n,\nwhere Q⋆= bPn ⊗Q⋆\n1 ⊗. . . ⊗Q⋆\nd and Q⋆\nj = (1 −δ)−1 × Bernoulli(1 −δ) for each j = 1, . . . , d.\nMoreover,\nmin\nβ∈Rd EQ⋆\nh\u0000β⊤(X ⊙ξ) −Y\n\u00012i\n= min\nβ∈Rd\n1\nn\n\u0014\n(Y −Xβ)⊤(Y −Xβ) +\nδ\n1 −δβ⊤Λβ\n\u0015\n,\n(34)\nwhich implies that the dropout training estimator equals\nbβ(δ) =\n\u0012\nX⊤X +\nδ\n1 −δdiag(X⊤X)\n\u0013−1\nX⊤Y.\nFinally, if EP ⋆[XX⊤] is a diagonal matrix with strictly positive entries then\nbβ(δ)\np→(1 −δ)EP ∗[XX⊤]−1E[XY ].\nProof\nThe ﬁrst part of the corollary follows directly from (13) and (14) in our main\ntheorem. The second part of the corollary follows from Proposition 1. According to this\nproposition, the limit of bβ(δ) is\nβ∗(δ) =\n\u0010\nEP ∗[XX⊤] + (δ/1 −δ)diag(EP ∗[XX⊤])\n\u0011−1\nEP ∗[Y X].\nThus, if EP ∗[XX⊤] is a diagonal matrix, we obtained the desired limit.\n42\nDropout Training is Distributionally Robust Optimal\nA.6 Additional Numerical Results\nHere we try to provide some justiﬁcations for our choice of parameter.\nLearning Rate: We ﬁrst ﬁx an all zeros initialization scheme, and vary the learning\nrate. We summarize the average parameter divergence and 1-standard deviation error for\n20 repetitions of the SGD algorithm in Table 2. We can observe the learning rate 0.0001\nshows a clear advantage.\nInitialization: Next we ﬁx the learning rate to be 0.0001, and consider diﬀerent initial-\nization schemes. We note that the mean value (resp., absolute value) of elements in β⋆is\n0.3947 (resp., 0.6977). Table 3 shows the average parameter divergence and the 1-standard\ndeviation from 20 repetitions of the SGD algorithm. We see that the initialization at origin\nis a fair choice.\nLearning rate\n0.001\n0.0001\n0.00001\n∥bβSGD −β⋆∥∞\n0.0827 ± 0.0133\n0.0301 ± 0.0025\n0.6702 ± 0.1082\nTable 2: Comparison for diﬀerent learning rates, with ﬁxed zero initializations.\nInitializations\nall zeros\nall 0.2’s\nall 1’s\n∥bβSGD −β⋆∥∞\n0.0301 ± 0.0025\n0.0317 ± 0.0047\n0.0614 ± 0.0196\nInitializations\ni.i.d N(0, 1)\ni.i.d N(0, 10)\ni.i.d N(0, 102)\n∥bβSGD −β⋆∥∞\n0.0376 ± 0.0067\n0.1006 ± 0.0469\n0.3208 ± 0.1432\nTable 3: Comparison for diﬀerent initialization schemes with ﬁxed learning rate 0.0001.\nWall-Clock Time: We then document the numerical results for 120s/180s wall-clock\ntime, see Figures 4 - 6 for the case of 120s and Figures 7 - 9 for the case of 180s. We see\nthat the proposed unbiased approach outperforms the standard SGD when the number of\nparallel iterations reaches above some threshold.\n43\nBlanchet et al.\nFigure 4: l2 diﬀerence for 120s wall-clock time\nFigure 5: l∞diﬀerence for 120s wall-clock time\nFigure 6: l1 diﬀerence for 120s wall-clock time\n44\nDropout Training is Distributionally Robust Optimal\nFigure 7: l2 diﬀerence for 180s wall-clock time\nFigure 8: l∞diﬀerence for 180s wall-clock time\nFigure 9: l1 diﬀerence for 180s wall-clock time\n45\nBlanchet et al.\nReferences\nSule Alan, Orazio Attanasio, and Martin Browning. Estimating Euler equations with noisy\ndata: two exact GMM estimators. Journal of Applied Econometrics, 24(2):309–324, 2009.\nBengt Von Bahr. On the convergence of moments in the central limit theorem. Annals of\nMathematical Statistics, 36(3):808–818, 06 1965.\nChris M Bishop.\nTraining with noise is equivalent to Tikhonov regularization.\nNeural\nComputation, 7(1):108–116, 1995.\nJose Blanchet, Peter Glynn, and Yanan Pei. Unbiased multilevel Monte Carlo: Stochastic\noptimization, steady-state simulation, quantiles, and other applications. arXiv preprint\narXiv:1904.09929, 2019a.\nJose Blanchet, Yang Kang, and Karthyek Murthy. Robust Wasserstein proﬁle inference and\napplications to machine learning. Journal of Applied Probability, 56:830–857, 2019b.\nStephen Boyd and Lieven Vandenberghe.\nConvex Optimization.\nCambridge University\nPress, 2004.\nTimothy Christensen and Benjamin Connault. Counterfactual sensitivity and robustness.\narXiv preprint arXiv:1904.00989, 2019.\nA. DasGupta. Asymptotic Theory of Statistics and Probability. Springer Verlag, 2008.\nErick Delage and Yinyu Ye. Distributionally robust optimization under moment uncertainty\nwith application to data-driven problems. Operations Research, 58(3):595–612, 2010.\nDavid Draper. Assessment and propagation of model uncertainty. Journal of the Royal\nStatistical Society, Series B, 56, 1994.\nRick Durrett. Probability: Theory and Examples. Cambridge University Press, 2019.\nLudwig Fahrmeir and Heinz Kaufmann.\nConsistency and asymptotic normality of the\nmaximum likelihood estimator in generalized linear models. The Annals of Statistics,\npages 342–368, 1985.\nMax H Farrell, Tengyuan Liang, and Sanjog Misra. Deep neural networks for estimation\nand inference. Forthcoming at Econometrica, 2020.\nT.S. Ferguson. Mathematical Statistics: A Decision Theoretic Approach, volume 7. Aca-\ndemic Press New York, 1967.\n46\nDropout Training is Distributionally Robust Optimal\nMichael B Giles.\nMultilevel Monte Carlo path simulation.\nOperations Research, 56(3):\n607–617, 2008.\nMichael B Giles. Multilevel Monte Carlo methods. Acta Numerica, 24:259, 2015.\nIan Goodfellow, Yoshua Bengio, and Aaron Courville. Deep Learning. MIT Press, 2016.\nLars Peter Hansen and Thomas J. Sargent. Robustness. Princeton University Press, 2008.\nDavid P Helmbold and Philip M Long. On the inductive bias of dropout. The Journal of\nMachine Learning Research, 16(1):3403–3454, 2015.\nGeoﬀrey E Hinton, Nitish Srivastava, Alex Krizhevsky, Ilya Sutskever, and Ruslan R\nSalakhutdinov. Improving neural networks by preventing co-adaptation of feature de-\ntectors. arXiv preprint arXiv:1207.0580, 2012.\nKurt Hornik, Maxwell Stinchcombe, and Halbert White. Multilayer feedforward networks\nare universal approximators. Neural Networks, 2(5):359–366, 1989.\nJiunn T Hwang. Multiplicative errors-in-variables models with applications to recent data\nreleased by the us department of energy. Journal of the American Statistical Association,\n81(395):680–688, 1986.\nJ Kim and W Winkler. Multiplicative noise for masking continuous data. Statistics, 1:9,\n2003.\nRobert H Lyles and Lawrence L Kupper. A detailed evaluation of adjustment methods for\nmultiplicative measurement error in linear regression with applications in occupational\nepidemiology. Biometrics, pages 1008–1025, 1997.\nLaurens Maaten, Minmin Chen, Stephen Tyree, and Kilian Weinberger.\nLearning with\nmarginalized corrupted features. In International Conference on Machine Learning, pages\n410–418, 2013.\nPeter McCullagh and J.A. Nelder. Generalized Linear Models. Chapman & Hall, 1989.\nOskar Morgenstern and John von Neumann. Theory of Games and Economic Behavior.\nPrinceton University Press, 1953.\nTapan K Nayak, Bimal Sinha, and Laura Zayatz. Statistical properties of multiplicative\nnoise masking for conﬁdentiality protection. Journal of Oﬃcial Statistics, 27(3):527, 2011.\nA. Nemirovski, A. Juditsky, G. Lan, and A. Shapiro. Robust stochastic approximation\napproach to stochastic programming. SIAM Journal on Optimization, 19(4):1574–1609,\n2009.\n47\nBlanchet et al.\nWhitney K Newey and Daniel McFadden. Large sample estimation and hypothesis testing.\nHandbook of Econometrics, 4:2111–2245, 1994.\nViet Anh Nguyen, Xuhui Zhang, Jose Blanchet, and Angelos Georghiou. Distributionally\nrobust parametric maximum likelihood estimation. In Advances in Neural Information\nProcessing Systems 33, 2020.\nDonald A Pierce, Daniel O Stram, Michael Vaeth, and Daniel W Schafer. The errors-in-\nvariables problem: considerations provided by radiation dose-response analyses of the\na-bomb survivor data. Journal of the American Statistical Association, 87(418):351–359,\n1992.\nAdrian E Raftery, David Madigan, and Jennifer A Hoeting.\nBayesian model averaging\nfor linear regression models. Journal of the American Statistical Association, 92(437):\n179–191, 1997.\nHamed Rahimian and Sanjay Mehrotra. Distributionally robust optimization: A review.\narXiv preprint arXiv:1908.05659, 2019.\nHerbert Robbins and Sutton Monro. A stochastic approximation method. The Annals of\nMathematical Statistics, pages 400–407, 1951.\nH. Scarf. A min-max solution of an inventory problem. Studies in the Mathematical Theory\nof Inventory and Production, 10:201–209, 1958.\nJohannes Schmidt-Hieber. Nonparametric regression using deep neural networks with ReLU\nactivation function. The Annals of Statistics, 48(4):1875 – 1897, 2020.\nAlexander Shapiro.\nDistributionally robust stochastic programming.\nSIAM Journal on\nOptimization, 27(4):2258–2275, 2017.\nAlexander Shapiro, Darinka Dentcheva, and Andrzej Ruszczy´nski. Lectures on Stochastic\nProgramming: Modeling and Theory. SIAM, 2014.\nNitish Srivastava, Geoﬀrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhut-\ndinov. Dropout: a simple way to prevent neural networks from overﬁtting. The Journal\nof Machine Learning Research, 15(1):1929–1958, 2014.\nStefan Wager, Sida Wang, and Percy S Liang. Dropout training as adaptive regularization.\nIn Advances in Neural Information Processing Systems 26, pages 351–359. 2013.\nMartin J Wainwright and Michael Irwin Jordan. Graphical Models, Exponential Families,\nand Variational Inference. Now Publishers Inc, 2008.\n48\nDropout Training is Distributionally Robust Optimal\nSida Wang and Christopher Manning. Fast dropout training. In Proceedings of the 30th\nInternational Conference on Machine Learning, pages 118–126, 2013.\nColin Wei, Sham Kakade, and Tengyu Ma. The implicit and explicit regularization eﬀects\nof dropout. In Proceedings of the International Conference of Machine Learning, 2020.\nWolfram Wiesemann, Daniel Kuhn, and Melvyn Sim. Distributionally robust convex opti-\nmization. Operations Research, 62(6):1358–1376, 2014.\nMartin Zinkevich, Markus Weimer, Lihong Li, and Alex J Smola. Parallelized stochastic\ngradient descent. In Advances in Neural Information Processing Systems, pages 2595–\n2603, 2010.\n49\n"}