{"text": "arXiv:2301.04439v1  [econ.EM]  11 Jan 2023\nUniform Inference in Linear\nError-in-Variables Models:\nDivide-and-Conquer\nTom Boot∗\nArt¯uras Juodis†\nJanuary 12, 2023\nAbstract\nIt is customary to estimate error-in-variables models using higher-\norder moments of observables. This moments-based estimator is con-\nsistent only when the coeﬃcient of the latent regressor is assumed to\nbe non-zero. We develop a new estimator based on the divide-and-\nconquer principle that is consistent for any value of the coeﬃcient of\nthe latent regressor. In an application on the relation between invest-\nment, (mismeasured) Tobin’s q and cash ﬂow, we ﬁnd time periods\nin which the eﬀect of Tobin’s q is not statistically diﬀerent from zero.\nThe implausibly large higher-order moment estimates in these periods\ndisappear when using the proposed estimator.\nJEL codes: C21, C23, E22, G31.\nKeywords: error-in-variables, divide-and-conquer, uniform inference.\nWord count: 7349.\n∗Corresponding author. University of Groningen, t.boot@rug.nl\n†University of Amsterdam and Tinbergen Institute, a.juodis@uva.nl.\n1\n1\nIntroduction\nTo account for measurement error in independent variables, higher-order\nmoment estimators have been used to analyse the relation between R&D\nexpenditures and patent applications (Lewbel, 1997), to test the q-theory of\ninvestment in ﬁnance (Erickson and Whited, 2000), and to investigate ﬁrm\nsaving behaviour (Riddick and Whited, 2009). Underlying these estimators\nare two crucial assumptions: ﬁrst, there needs to be suﬃcient skewness in the\nlatent regressor. Second, the coeﬃcient β0 that relates the latent regressor\nto the observed outcome cannot equal zero. In this paper we focus on the\nsituation where this second assumption potentially fails. In particular, we\nconsider the standard third-order moment estimator that can be attributed to\nGeary (1942). When β0 = 0, this estimator converges to a ratio of correlated\n(mean zero) normal random variables.\nAs a solution to this problem, we propose an estimator based on a divide-\nand-conquer strategy: the data is split into equal sized blocks. In each block,\nwe calculate the denominator and numerator of the estimator (by Geary,\n1942) on non-overlapping subsets of the data. This breaks the dependency\nbetween the numerator and denominator, and ensures that the estimator\nis median unbiased regardless of the value of β0. Subsequently taking the\nmedian over the estimators from the diﬀerent blocks yields a consistent and\nasymptotically normal estimator irrespective of the value of β0. However,\nthe rate of convergence of the proposed estimator depends on the number of\nblocks when β0 = 0 and increases to the standard rate when β0 ̸= 0.\nTo test the proposed estimator in practice, we revisit an empirical test of\ncorporate ﬁnance’s q-theory. This theory states that investment ﬂuctuations\nare driven by the marginal q: the market value of capital relative to the\nshadow value of capital.1 Empirically, q-theory appeared discredited with for\nexample Blundell et al. (1992) ﬁnding a signiﬁcant role for internals funds\nafter controlling for q.\nHowever, Erickson and Whited (2000) show that\nthese ﬁndings can be explained by the substantial measurement error in\nTobin’s q measure of marginal q. This measurement error drives down the\n1An overview of the history of q-theory can be found in Erickson and Whited (2000)\n2\nestimated coeﬃcient on q, while increasing the coeﬃcient of controls such as\ninternal funds. Accounting for measurement error via the use of higher-order\nmoment estimators showed that q-theory is not at odds with the data, see\nalso Erickson and Whited (2012) and Andrei et al. (2019).\nWe ﬁrst consider the simulation set-up of Erickson et al. (2014), which\nis geared to the environment in which q-theory can be tested. We ﬁnd that\nthe divide-and-conquer estimator performs well regardless of the value of β0,\nunlike the third-order moment estimator that is ill-deﬁned when β0 = 0.\nWe then analyse the data on ﬁrm investment, Tobin’s q and cash ﬂow\nfrom Erickson et al. (2014). When using the full sample of available data,\nranging from 1970 to 2011, the divide-and-conquer estimates are in line with\nthose in Erickson et al. (2014). In particular, we do not ﬁnd evidence for the\neﬀect of cash ﬂow on ﬁrm investment. Motivated by the notion of Erickson\net al. (2014) that there exists variation over time in the estimates, we then re-\nestimate the coeﬃcients using an expanding window of data starting with the\ndata in 1970-1980 and ending with the full sample 1970-2011. We indeed ﬁnd\nsubstantial changes in the estimated relation between investment, Tobin’s q\nand cash ﬂow over time. In particular, we ﬁnd rather extreme point estimates\nand conﬁdence intervals in time periods before the mid-1980s. These occur\nprecisely in time periods in which the divide-and-conquer estimator is not\nsigniﬁcantly diﬀerent from zero. The divide-and-conquer estimates for the\neﬀect of Tobin’s q is found to be rather stable over time.\nThe paper relates to three diﬀerent strands of the literature. First, the\nerror-in-variables model has been thoroughly studied in econometrics and\nstatistics. Estimation based on third-order moments as the one we employ\ncan be subscribed Geary (1942). Identiﬁcation in the error-in-variables model\nis considered by (among others) Reiersøl (1950); Kapteyn and Wansbeek\n(1983); Bekker (1986). Pal (1980) extends this estimator for the single re-\ngressor case based on higher-order cumulants, while Dagenais and Dagenais\n(1997), Cragg (1997) and Lewbel (1997) consider other functions of mismea-\nsured regressors. An overview of the literature can be found in Wansbeek\nand Meijer (2000) and more recently Schennach (2016).\nA general framework for higher-order moment estimators in models with\n3\nmultiple mismeasured and perfectly measured regressors is proposed in Er-\nickson and Whited (2002). Instead of the moments, it is somewhat simpler to\nrely on higher-order cumulants as in Erickson et al. (2014) as the estimators\nare available in closed-form. Nonparametric identiﬁcation and semiparamet-\nric estimation are considered in Schennach and Hu (2013).\nThe second strand of literature concerns divide-and-conquer estimators.\nThese estimators are developed for settings where a massive data set cannot\nbe loaded into memory, see for instance Shi et al. (2018). The idea is to\nconstruct a sequence of estimators on independent subsets of the data, and\nthen aggregate the estimators into a single estimator.\nThis is sometimes\nalso referred to as distributed inference. The common aggregation method\nis to take the mean. Applied to monotone regression, Banerjee et al. (2019)\ndocument a supereﬃciency property of this method. Distributed quantile\nregression is studied by Chen et al. (2019) and Volgushev et al. (2019).\nFinally, rather than taking the mean of the subsample estimators, we rely\non the median. This is shared with median-of-means (MoM) estimators that\nare used to robustify machine learning algorithms in the presence of heavy-\ntailed data. MoM estimators were originally proposed by Nemirovskij and\nYudin (1983), Jerrum et al. (1986), and Alon et al. (1999). In recent years,\nvarious authors show that these estimators attain optimal rates of conver-\ngence under weak assumptions on the data (Hsu and Sabato, 2014, Lugosi\nand Mendelson, 2019, and Lecu´e and Lerasle, 2020). However, theoretical\nresults are only available under the assumption that the random variables\nhave ﬁnite second moment. The estimator we propose is closer to a median-\nof-ratios-of-means estimators, which in the worst case scenario does not have\nany ﬁnite moments.\nThe paper proceeds as follows. In Section 2 we describe the model, the\nproposed estimator and its implementation. In Section 3 we describe asymp-\ntotic results for the divide-and-conquer estimator. The simulation study and\nempirical application are presented in Section 4. Section 5 concludes. Proofs\nare deferred to Appendix A.\n4\n2\nModel, Estimators and Inference\n2.1\nA Simple Error-in-Variables Model\nAs a basis of our analysis we consider the following simpliﬁed error-in-variables\nmodel for one variable\nyi = ξiβ0 + εi,\nxi = ξi + ui,\n(1)\nfor i = 1, . . . , n. Here the observed variables are (yi, xi), while the remaining\nvariables are latent. The main parameter of interest is β0, the causal eﬀect of\nmarginal change in ξi on yi. As ξi is not observed, one could naively consider\nestimating β by running the OLS regression of yi on xi:\nˆβOLS =\n1\nn\nPn\ni=1 xiyi\n1\nn\nPn\ni=1 x2\ni\n.\n(2)\nThis estimator, however, generally is inconsistent as in the limit n →∞:\nˆβOLS\np\n−→β0\nσ(2)\nξ\nσ(2)\nu + σ(2)\nξ\n,\n(3)\nprovided that all stochastic quantities are mutually independent. Here we\ndenote E[ξ2\ni ] = σ2\nξ, E[ξ3\ni ] = σ(3)\nξ , E[ξ4\ni ] = σ(4)\nξ\nand similarly for εi and ui we\nhave E[ε2\ni ] = σ2\nε, E[ε3\ni ] = σ(3)\nε , E[ε4\ni ] = σ(4)\nε , E[u2\ni ] = σ(2)\nu .\nAs the OLS estimator is generally inconsistent, in what follows we limit\nour attention to a class of method-of-moments estimators that use the infor-\nmation from the higher order moments of the data. The parameter β0 can\nthen be estimated with the estimator attributed to Geary (1942).\nIn what follows, we assume that all random variables are mutually inde-\npendent.\nAssumption 1. (εi, ui, ξi) are mutually independent random variables with\nexpectation zero.\n5\nA direct implication of Assumption 1 is that in population\nE[xiy2\ni ] = σ(3)\nξ β2\n0,\nE[x2\ni yi] = σ(3)\nξ β0.\n(4)\nThis implies the following moment condition,\nE[gi(β)] = E[xiy2\ni −x2\ni yiβ] = 0,\n(5)\nfor β = β0. Associated with the above population orthogonality conditions\nis the following estimator, attributed to Geary (1942),\nˆβ3M =\n1\nn\nPn\ni=1 xiy2\ni\n1\nn\nPn\ni=1 x2\ni yi\n.\n(6)\nAs it is evident from (4), the identifying power of this estimator is sensitive\nto the exact values of β0 and/or σ(3)\nξ . In particular, if β0 = 0 and/or σ(3)\nξ\n= 0,\nthe probability limit of the estimator is ill-deﬁned.\nThis is also evident from the expression for the asymptotic variance given\nby\nV(ˆβ3M; β) =\nE[gi(β0)2]\nE [∂gi(β)/∂β|β=β0]2 = E[x2\ni y2\ni (yi −xiβ0)2]\nE[x2\ni yi]2\n= σ(4)\nξ σ2\nεβ2\n0 + σ2\nξσ(4)\nε\n+ 2σ(3)\nξ σ(3)\nε β0 + σ2\nuσ2\nεσ2\nξβ2\n0 + σ2\nuσ(4)\nε\n[σ(3)\nξ ]2β2\n0\n.\n(7)\nClearly, when β0 = 0 or σ(3)\nξ\n= 0, the variance is ill-deﬁned.\n2.2\nThe Divide-and-Conquer Approach\nIn what follows, we describe the main intuition behind the procedure put\nforward in this paper. Notice that when β0 = 0, the estimator (6) is the\nratio of two correlated sums that both have expectation zero. Borrowing on\nthe idea of the Split Sample IV estimator of Angrist and Krueger (1995), we\ncan easily break the dependence between the limiting value of the numera-\ntor and the denominator by evaluating the denominator and numerator on\n6\nindependent samples. As a result, the resulting estimator will be centered at\nthe true value β0 = 0. However, the estimator will still remain non-normal\nin the limit for β0 = 0, and normal for β0 ̸= 0, invalidating any standard\ninference approaches.\nThe above problem, however, can be solved. Deﬁne two subsets Rj,1 ⊂\n{1, . . . , n} and Rj,2 ⊂{1, . . . , n} such that Rj,1 ∩Rj,2 = ∅, denote |Rj,1| =\n|Rj,2| = b/2. The index j will be used to index diﬀerent choices of the subsets.\nConsider now the estimator,\nˆβj,b =\nP\ni∈Rj,1 xiy2\ni\nP\ni∈Rj,2 x2\ni yi\n.\n(8)\nWhen β0 = 0, (8) is the ratio of two independent sums that both have\nexpectation zero. Intuitively, we would expect that as b →∞, ˆβj converges\nweakly to a Cauchy-type random variable with the CDF Fc(x). Let Fj,b(x)\nbe the corresponding CDF of ˆβj,b, then in Appendix A, we show that indeed\nsup\nx∈R\n|Fj,b(x) −Fc(x)| ≤M/\n√\nb,\n(9)\nfor some constant M > 0 when β0 = 0. Note that as Cauchy-type random\nvariables are symmetric, their median is 0, which happens to be exactly the\nvalue β0 = 0 we are after.\nIn cases when the underlying data is a pure cross-section, this facilitates\nthe following strategy to recover the median (thus also β0) of the limiting\nrandom variable with the CDF Fc(x). Randomly partition the n observations\ninto B blocks, so that the number of observations within each block equals\nb = n/B. Within each block, split the sample to form (8), assuming that b/2\nis an integer. This yields a sequence of independent estimators {ˆβDC\nj,b }B\nj=1.\nOur estimator ˆβDC\nb\nfor β is the median of this sequence.\nThe algorithm for the Divide-and-conquer estimator is as follows.\nStep 1. Set B such that n/(2B) is an integer.\nStep 2. Partition the data into B adjacent blocks.\n7\nStep 3. Split each block further into two equal sized blocks Rj,1 and\nRj,2.\nStep 4. For j = 1, . . . , B, estimate\nˆβDC\nj,b =\nP\ni∈Rj,1 xiy2\ni\nP\ni∈Rj,2 x2\ni yi\n.\n(10)\nStep 5. Estimate β by\nˆβDC\nb\n= median(ˆβDC\n1,b , . . . , ˆβDC\nB,b ).\n(11)\nWe prove below that for any ﬁxed β0 (including β0 = 0), ˆβDC\nb\nis asymp-\ntotically normal. The convergence rate, however, depends on whether β0 = 0\nor β0 ̸= 0. In the ﬁrst case, the convergence rate is B1/2, so it is determined\nonly by the number of blocks B. In the latter case, we end up with the\nstandard (pooled) convergence rate of\n√\nB · b = √n. Hence, the fact that we\nuse the median to estimate β is free of any asymptotic costs, as long as the\nconvergence rate of the estimator is concerned.\n2.3\nSelecting the Number of Blocks\nThe choice of the number of subsample estimators B is important.\nThe\ntheoretical results indicate the B/b should go to zero for consistency of the\nestimator. If B is too large relative to b, ﬁnite sample bias in the subsample\nestimators does not wash out over the diﬀerent blocks. Our simulation results\nshow that we should choose the value of B relatively small. There, we have\na total of 60,000 observations and set B = 20, so that B/b = 0.0066 and\nB = 40 so that B/b = 0.0267. For the latter, we ﬁnd an increase in bias\nin the coeﬃcients and conﬁdence intervals that undercover for regressions\nthat include ﬁxed eﬀects. When we increase the cross-section dimension to\nn = 6, 000 in Tables 4 and 5, so that for B = 40 we get B/b = 0.0133\nand coverage approaches the nominal rate. Optimal selection of the value\nof B is an important topic for further research. We suggest that empirical\n8\nresearchers report their estimates for a range of diﬀerent values of B as a\nrobustness check of their results.\n2.4\nInference\nAs the asymptotic variance of the estimator depends on the unknown pa-\nrameter β0, we construct conﬁdence intervals from a nonparametric boot-\nstrap procedure.\nFirst, we draw B samples ˜ej,b with replacement from\n{±e1,b, . . . , ±eB,b} where ej,b = ˆβDC\nj,b −ˆβDC\nb\n. Note that in view of the asymp-\ntotic distribution, we enforce symmetry by including each ej,b both with a\nplus and a minus sign. We then calculate ˜βDC\ni\n= median(˜βDC\n1,b , . . . , ˜βDC\nB,b ),\nwhere ˜βDC\nj,b = ˆβDC\nb\n+ ˜ej,b and i = 1, . . . , Bn. The α/2 and 1 −α/2 quantiles\n(qDC\nα/2, qDC\n1−α/2) of the empirical distribution of ˜βDC\ni\n−ˆβDC\nb\nare then used to\nconstruct a conﬁdence interval as (ˆβDC\nb\n+ qDC\nα/2, ˆβDC\nb\n+ qDC\n1−α/2).\n2.5\nExtensions\nTwo extensions to the above methodology are needed to implement the\ndivide-and-conquer estimator in our empirical setting. The ﬁrst is the addi-\ntion of perfectly measured control variables to the model. The second is to\nconsider a panel data setting.\nFirst, the model (1) can be expanded by including a set of perfectly\nmeasured controls, so that the model is of the form\nyi = ξiβ0 + z′\niγ + εi.\n(12)\nIn this case, deﬁne\n˙xi = xi −z′\ni\n\nX\ni∈Rj,1\nziz′\ni\n\n\n−1\nX\ni∈Rj,1\nzixi,\n(13)\nand similarly for ˙yi. Denote by ¨xi and ¨yi the corresponding estimators on\n9\nthe set Rj,2. We then adapt (10) in the divide-and-conquer algorithm to\nˆβDC\nj,b =\nP\ni∈Rj,1 ˙xi ˙y2\ni\nP\ni∈Rj,2 ¨x2\ni ¨yi\n.\n(14)\nThis retains the independence between the subsample estimators. Note that\nfor inference on γ we can adapt the procedure from Section 2.4 and construct\nconﬁdence intervals from the quantiles of ˜γDC\nj,b = (Pn\ni=1 ziz′\ni)−1 Pn\ni=1 zi(yi −\nxi ˜βDC\nj,b ).\nAs a second extension, we consider a linear panel data model that will be\nused in our empirical application,\nyit = xitβ0 + αi + λt + εit.\n(15)\nIn this case, we construct subsample estimators on cross-sections of the data.\nTo account for individual ﬁxed eﬀects, we perform a within transformation\non the data. Moreover, to account for time ﬁxed eﬀects in the model, we\ndemean the data within blocks. Perfectly measured controls are handled in\nthe same way as above.\nThe algorithm for the Panel Divide-and-conquer estimator is as fol-\nlows.\nStep 1. Set B such that N/(2B) is an integer.\nStep 2. If ﬁxed eﬀects αi are included in the model, then transform yit\nand xit as\neyit = yit −T −1\nT\nX\nt=1\nyit,\nexit = xit −T −1\nT\nX\nt=1\nxit.\n(16)\nStep 3. Partition the cross-section at time t into B blocks;\nStep 4. Split each block further into two equal sized blocks Rj,1 and\nRj,2\nStep 5. For j = 1, . . . , B, if time eﬀects λt are included in the model,\nthen\n10\nFor i ∈Rj,1,\nbyit = eyit −(2B/N) P\ni∈Rj,1 eyit,\nbxit = exit −(2B/N) P\ni∈Rj,1 exit.\nFor i ∈Rj,2,\nbyit = eyit −(2B/N) P\ni∈Rj,2 eyit,\nbxit = exit −(2B/N) P\ni∈Rj,2 exit.\nOtherwise set byit = eyit and bxit = exit.\nStep 6. Estimate\nˆβDC\njt,b =\nP\ni∈Rj,1 bxitby2\nit\nP\ni∈Rj,2 bx2\nitbyit\n.\n(17)\nStep 7. Estimate β by\nˆβDC\nb\n= median(ˆβDC\n11,b, . . . , ˆβDC\nBT,b).\n(18)\n3\nTheoretical Results\nWe start by making the following assumption on the moments of (ξi, ui, εi)\nthat facilitate a Berry-Esseen inequality in the proof of the main theorem.\nWe limit our attention to the basic estimator we suggest in Section 2.2. In\nthe following, denote by Φ(x) and φ(x) the CDF/PDF of a standard normal\nr.v. and by Fc(x)/fc(x) the CDF/PDF of a Cauchy r.v.\nAssumption 2. E[|ξi|6] < ∞, E[|ui|6] < ∞, E[|εi|6] < ∞.\nWe impose the following assumption on the number of blocks B, which\nis chosen as a function of the sample size within each block b.\nAssumption 3. B(b)/b →0.\nNote that when β0 = 0, the estimator can be decomposed as\nˆβj,b =\nP\ni∈Rj,1 xiε2\ni\nP\ni∈Rj,2 x2\ni εi\n= vj,b\nwj,b\n,\n(19)\nwhere |Rj,1| = |Rj,2| = b/2 and j = 1, . . . , B.\nDenote σ2\nv = E[v2\nj,b] and\nσ2\nw = E[w2\nj,b]. When β0 ̸= 0, deﬁne wi = xiε2\ni + 2β0(ξ2\ni + ξiui)εi and σ2\nβ =\n(β0σ(3)\nξ )−2E [w2\ni ].\nThis brings us to our main result.\n11\nTheorem 1. Suppose Assumptions 1 to 3 hold. Let\nˆβDC\nb\n= median({ˆβj,b}B\nj=1).\n(a) When β0 = 0,\n√\nB\n\u0012σw\nσv\nˆβDC\nb\n\u0013\n−→d N\n\u0012\n0,\n1\n4fc(0)2\n\u0013\n.\n(20)\n(b) When β0 ̸= 0,\n√n\n ˆβDC\nb\n−β0\nσβ\n!\n−→d N\n\u0012\n0,\n1\n4φ(0)2\n\u0013\n.\n(21)\nWe see that regardless of the value of β0, the estimator is asymptotically\nnormal. The asymptotic distribution, on the other hand, is generally discon-\ntinuous at β0. In particular, for β0 = 0, the convergence rate is\n√\nB. Since\nAssumption 3 requires that B/b = B2/n →0, the maximal convergence rate\nis below n1/4. When β0 ̸= 0, we recover the standard √n convergence rate.\nWe also see that the asymptotic variance depends on the, evidently un-\nknown, value of β0.\nInference therefore proceeds via the non-parametric\nbootstrap discussed in the previous section that accommodates cases (a) and\n(b) simultaneously.\n4\nNumerical Results\n4.1\nMonte Carlo Study\nIn this section we consider the simulation set-up from Erickson et al. (2014).\nTheir setup is calibrated in order to reﬂect several characteristics of the data\nused in their analysis. In particular, we consider a simple linear panel data\nmodel of the form,\nyit = zitγ + ξitβ + uit,\nxit = ξit + eit.\n(22)\n12\nHere i = 1, . . . , n with n = 3, 000 and t = 1, . . . , T with T = 20.\nThe\nerrors uit and eit are i.i.d. Gamma random variables standardized using the\npopulation mean and standard deviation. The scale parameter is set to 1\nand the shape parameter is set to 0.32 for uit and 0.09 for eit.\nThe perfectly measured controls and the mismeasured regressor are gen-\nerated using an autoregressive processes of order 1 - AR(1), as follows\nξit = δξ + φξξi,t−1 + vξ\nit,\nzit = δz + φzzi,t−1 + vz\nit.\n(23)\nHere we set φξ = 0.78 and φz = 0.48. The intercepts are set to match the ﬁrst\nmoment of Tobin’s q and cash ﬂow in the data as δξ = 0.570 and δz = 0.094.\nThe errors (vξ\nit, vz\nit) are again independent Gamma random variables. The\nscale parameter is set to 1, the shape parameter for vξ\nit equal to 0.007 and\nfor vz\nit equal to 2.08. We follow the standard practise in the literature and\ninitialize the processes for ξit and zit in the recent past by setting ξi,−10 =\nzi,−10 = 0 for all i. We then generate T +10 time series observations for both\nprocesses and drop the ﬁrst 10 periods.\nAfter having generated zit and ξit, we transform these to ensure that the\ncovariance matrix calculated using all available data is equal to the covariance\nmatrix of xit and zit in the data, with the variance of Tobin’s q multiplied by\nτ 2 = 0.45 and the covariances multiplied by\n√\nτ 2. Numerically, the covariance\nmatrix is\nC =\n \n16.130\n0.489\n0.258\n!\n.\n(24)\nFinally, we generate the observed variables as follows\nxit = ξit +\nq\nτ −2(1 −τ 2)C1,1eit\nyit = µy + ξitβ + zitγ +\nq\nσ2\ny −var(ξitβ + zitγ)uit.\n(25)\nHere µy and σ2\ny are set to match the population mean and variance of\nthe investment variable in the data. We consider two choices for β. In the\nﬁrst β = 0.025 as in Erickson et al. (2014), while in the second β = 0. The\n13\ncoeﬃcient for control variable zit is ﬁxed to γ = 0.05.\nWe estimate the parameters in (25) using OLS (OLS), the third-order\nmoment estimator (3M) and the divide-and-conquer estimator (DC). For the\ndivide-and-conquer estimator, we vary the number of blocks per time period\nfrom 1 to 2, so we take the median over B ·T = 20 and B ·T = 40 subsample\nestimators. In each time period, the partition of the ﬁrms is random.\nBootstrap conﬁdence intervals are constructed as outlined in Section 2.4\nwith Bn = 399. For the third-order moment estimator, conﬁdence intervals\nare calculated as in Erickson and Whited (2002).\n[Table 1 near here.]\nTable 1 shows the mean and standard deviations of the estimates for the\nq-coeﬃcient β and the cash ﬂow coeﬃcient α. When β0 = 0.025, we see that\nthe OLS estimates for β and α are badly biased due to the measurement error\nin the process. The third-order moment estimators as well as the divide-and-\nconquer methods show no to very little bias. The standard errors of the\ndivide-and-conquer estimators are larger relative to the third-order moment\nestimator.\nWhen β0 = 0, we see that the third-order moment estimator is badly\ndeﬁned, with the standard error going up substantially.\nThe divide-and-\nconquer estimators on the other hand perform well, with standard deviations\nnearly identical to those when β0 = 0.025.\n[Table 2 near here.]\nTable 2 shows the coverage rates for the various methods. As expected,\nthe bias in the OLS estimator when β0 ̸= 0 results in conﬁdence intervals that\ndo not include the true parameter. The conﬁdence intervals corresponding\nto the 3M estimator are somewhat conservative, especially when we include\nﬁxed eﬀects. For the DC estimator, we ﬁnd overall close to nominal coverage\nexcept when β0 = 0.025 and we include ﬁxed eﬀects. Table 5 shows that\nincreasing the sample size to n = 6, 000 largely resolves this issue.\n14\n4.2\nEmpirical Results\nWe consider an application from the corporate ﬁnance literature that seeks\nto determine the relation between actual investment and unobserved invest-\nment opportunities in capital as in Fazzari et al. (1988). The investment\nopportunities are proxied by Tobin’s q, which contains considerable mea-\nsurement error. The third-order moment estimator (6) and generalizations\nthereof have been applied to account for this measurement error in Erickson\nand Whited (2000), Erickson and Whited (2012) and Erickson et al. (2014).\nWhile identiﬁcation problems due to lack of skewness were investigated in\nErickson and Whited (2012), problems that arise because β0 is (close to)\nzero, have not been addressed.\nWe use the data of Erickson et al. (2014) to estimate the linear panel\ndata model\nyit = z′\nitγ + xitβ + εit,\n(26)\nwhere i = 1, . . . , n indexes the ﬁrm, and t = 1, . . . , T the year. The data\nranges from 1970 to 2011. After removing ﬁrms for which only one year is\navailable, the sample consists of 121,733 ﬁrm-year observations. The outcome\nvariable yit is investment as constructed by Erickson et al. (2014).\nThe\nperfectly measured control variables zit include an intercept and a measure\nof cash ﬂow, xit denotes Tobin’s q.\nWe estimate the eﬀect of Tobin’s q on investment in (26) by (1) OLS, (2)\nthe third-order moment estimator (6) and (3) the divide-and-conquer algo-\nrithm. We calculate conﬁdence intervals for (6) as described in Erickson and\nWhited (2002). For the divide-and-conquer method, we apply the bootstrap\nprocedure from Section 2.4.\nFor the divide-and-conquer estimator, for every year we divide the data\ninto 2 blocks, which for the full sample corresponds to 80 blocks. We also\nreport results for 1 block per year. Since for each block we split the data\ninto two halves to calculate the numerator and denominator of the subsample\nestimators, in each year we discard a randomly selected subset of ﬁrms so\nthat the number of ﬁrms is a multiple of 2 (for DC with 1 block per year) or\na multiple of 4 (for DC with 2 blocks per year).\n15\n[Table 3 near here.]\nWe ﬁrst report the full sample pooled estimators and standard errors in\nTable 3. For the OLS estimators, we see the signiﬁcant eﬀect of cash ﬂow\non investment.\nThis questions q-theory, which states that in a regression\nof investment on q, control variables must be insigniﬁcant. Indeed, we see\nthat this theory can be aligned with empirical evidences by the third-order\nmoment estimators. These conclusions are upheld by the divide-and-conquer\nmethods: Tobin’s q has a signiﬁcant positive eﬀect on investment, while\ncash ﬂow does not. The exception is formed by the results from divide-and-\nconquer with both ﬁrm and year eﬀects. In this case, the conﬁdence intervals\nfor the Tobin’s q include zero.\nSecondly, Erickson et al. (2014) document that the coeﬃcient estimates\nmay be varying over time. We therefore apply the same estimation method\non subsamples of the data. The ﬁrst subsample is 1970-1980, which we then\nexpand by one year at a time until we reach the full-sample estimates in\n2011. For this exercise, we limit our attention to the model with ﬁrm ﬁxed\neﬀects. We report results for the divide-and-conquer estimator with 2 blocks\nper year. Results for 1 block per year are reported in Figures 3 and 4.\n[Figure 1 near here.]\nFigure 1 shows the estimates for Tobin’s q alongside the 95% conﬁdence\nintervals. Interestingly, in the ﬁrst half of the time period, we ﬁnd that both\nthe third-order moment estimator and the DC estimator include zero in the\nconﬁdence interval. This is paired with the observation that the third-order\nmoment estimator takes a value for Tobin’s q which is an order of magnitude\nlarger than the full-sample estimator.\n[Figure 2 near here.]\nFigure 2 shows the estimated cash ﬂow coeﬃcient. While the conﬁdence\nintervals for the third-order moment estimator include zero for all time peri-\nods, the divide-and-conquer estimator shows some mild evidence for a cash\nﬂow eﬀect, especially in the early years of the sample. This aligns with the\n16\nﬁndings by Andrei et al. (2019) who ﬁnd that q-theory has become increas-\ningly eﬃcient in explaining investment patterns.\n5\nConcluding Remarks\nEstimators based on higher-order moments of the data can eliminate the\neﬀect of measurement error.\nHowever, if the coeﬃcient β0 of the latent\nregressor is zero, the estimators converge weakly to a ratio of correlated mean\nzero normal random variable. As a result, standard inference procedures are\nnot applicable in this case.\nAs a solution to this problem we suggest the divide-and-conquer estima-\ntor that estimates the parameter of interest using the median of subsample\nestimators. We show this estimator is consistent and suggest a bootstrap\nbased inference procedure that is applicable irrespective of the coeﬃcient β0.\nThe estimator and inference procedure are intuitive and easy to implement\nby practitioners. Monte Carlo results indicate that this bootstrap procedure\nwell approximates the ﬁnite sample distribution of the estimator.\nFinally, we analyse the data on ﬁrm investment, Tobin’s q and cash ﬂow\nfrom Erickson et al. (2014) and do not ﬁnd signiﬁcant evidence for the ef-\nfect of cash ﬂow in ﬁrm investment. Interestingly enough, we ﬁnd substantial\nchanges in the estimated relation between investment, Tobin’s q and cash ﬂow\nover time. In particular, we ﬁnd rather extreme point estimates and conﬁ-\ndence intervals in time periods before the mid-1980s for the third-moment\nestimator of Erickson et al. (2014). These occur precisely in time periods\nin which the divide-and-conquer estimator is not signiﬁcantly diﬀerent from\nzero. On the other hand, the divide-and-conquer estimates for the eﬀect of\nTobin’s q is found to be rather stable over time. These observations conﬁrm\nthe empirical relevance of our proposed statistical procedure.\nAcknowledgements\nWe thank Gerard van den Berg, Simon Broda, Noud\nvan Giersbergen, Toru Kitagawa, Frank Kleibergen, Ruud Koning, Tom\nWansbeek, and seminar participants at the Tinbergen Institute Amsterdam\nand the University of Groningen, for helpful comments.\nWe thank Toni\n17\nWhited for sharing the data. Financial support from the Netherlands Organi-\nzation for Scientiﬁc Research (NWO) under research grant number 201E.011\n(TB) and 451 −17 −002 (AJ) is gratefully acknowledged.\nDisclosure statement\nThe authors report there are no competing inter-\nests to declare.\nData availability statement\nThe authors conﬁrm that the code and data\nsupporting the ﬁndings of this study are available within the supplementary\nmaterials.\nReferences\nAlon, N., Matias, Y., and Szegedy, M. (1999).\nThe space complexity of\napproximating the frequency moments. Journal of Computer and System\nSciences, 58(1):137–147.\nAndrei, D., Mann, W., and Moyen, N. (2019). Why did the q theory of\ninvestment start working?\nJournal of Financial Economics, 133(2):251–\n272.\nAngrist, J. D. and Krueger, A. B. (1995). Split-sample instrumental variables\nestimates of the return to schooling. Journal of Business and Economic\nStatistics, 13(2):225–235.\nBanerjee, M., Durot, C., and Sen, B. (2019). Divide and conquer in nonstan-\ndard problems and the super-eﬃciency phenomenon. Annals of Statistics,\n47(2):720–757.\nBekker, P. A. (1986).\nComment on identiﬁcation in the linear errors in\nvariables model. Econometrica, 54(1):215–217.\nBlundell, R., Bond, S., Devereux, M., and Schiantarelli, F. (1992). Invest-\nment and Tobin’s q: Evidence from company panel data. Journal of Econo-\nmetrics, 51(1-2):233–257.\nChen, X., Liu, W., and Zhang, Y. (2019). Quantile regression under memory\nconstraint. Annals of Statistics, 47(6):3244–3273.\n18\nCragg, J. G. (1997). Using higher moments to estimate the simple errors-in-\nvariables model. RAND Journal of Economics, 28(0):S71–S91.\nDagenais, M. G. and Dagenais, D. L. (1997). Higher moment estimators for\nlinear regression models with errors in the variables. Journal of Econo-\nmetrics, 76(1-2):193–221.\nErickson, T., Jiang, C. H., and Whited, T. M. (2014). Minimum distance es-\ntimation of the errors-in-variables model using linear cumulant equations.\nJournal of Econometrics, 183(2):211–221.\nErickson, T. and Whited, T. M. (2000). Measurement error and the relation-\nship between investment and q. Journal of Political Economy, 108(5):1027–\n1057.\nErickson, T. and Whited, T. M. (2002). Two-step GMM estimation of the\nerrors-in-variables model using high-order moments. Econometric Theory,\n18(3):776–799.\nErickson, T. and Whited, T. M. (2012).\nTreating measurement error in\nTobin’s q. Review of Financial Studies, 25(4):1286–1329.\nFazzari, S. M., Hubbard, R. G., Petersen, B. C., et al. (1988). Financing\nconstraints and corporate investment. Brookings Papers on Economic Ac-\ntivity, 19(1):141–206.\nGeary, R. C. (1942). Inherent relations between random variables. In Proceed-\nings of the Royal Irish Academy. Section A: Mathematical and Physical\nSciences, volume 47, pages 63–76.\nHsu, D. and Sabato, S. (2014). Heavy-tailed regression with a generalized\nmedian-of-means. In Proceedings of the 31st International Conference on\nMachine Learning, volume 32, pages 37–45.\nJerrum, M. R., Valiant, L. G., and Vazirani, V. V. (1986). Random gener-\nation of combinatorial structures from a uniform distribution. Theoretical\nComputer Science, 43:169–188.\nKapteyn, A. and Wansbeek, T. (1983). Identiﬁcation in the linear errors in\nvariables model. Econometrica, 51(6):1847–1849.\nLecu´e, G. and Lerasle, M. (2020). Robust machine learning by median-of-\nmeans: theory and practice. Annals of Statistics, 48(2):906–931.\nLewbel, A. (1997). Constructing instruments for regressions with measure-\n19\nment error when no additional data are available, with an application to\npatents and randd. Econometrica, 65(5):1201–1213.\nLugosi, G. and Mendelson, S. (2019). Risk minimization by median-of-means\ntournaments. Journal of the European Mathematical Society, 22(3):925–\n965.\nNemirovskij, A. S. and Yudin, D. B. (1983). Problem complexity and method\neﬃciency in optimization. New York: Wiley-Interscience.\nPal, M. (1980). Consistent moment estimators of regression coeﬃcients in the\npresence of errors in variables. Journal of Econometrics, 14(3):349–364.\nReiersøl, O. (1950). Identiﬁability of a linear relation between variables which\nare subject to error. Econometrica, 18(4):375–389.\nRiddick, L. A. and Whited, T. M. (2009). The corporate propensity to save.\nJournal of Finance, 64(4):1729–1766.\nSchennach, S. M. (2016). Recent advances in the measurement error litera-\nture. Annual Review of Economics, 8:341–377.\nSchennach, S. M. and Hu, Y. (2013).\nNonparametric identiﬁcation and\nsemiparametric estimation of classical measurement error models with-\nout side information.\nJournal of the American Statistical Association,\n108(501):177–186.\nShi, C., Lu, W., and Song, R. (2018). A massive data framework for m-\nestimators with cubic-rate. Journal of the American Statistical Associa-\ntion, 113(524):1698–1709.\nVolgushev, S., Chao, S.-K., and Cheng, G. (2019). Distributed inference for\nquantile regression processes. Annals of Statistics, 47(3):1634–1662.\nWansbeek, T. J. and Meijer, E. (2000). Measurement error and latent vari-\nables in econometrics, volume 37. Amsterdam: Elsevier.\n20\nAppendix A\nProofs\nA.1\nThe Case when β0 = 0\nDenote the subsample estimator\nˆβDC\nj,b =\nP\ni∈Rj,1 xiε2\ni\nP\ni∈Rj,2 x2\ni εi\n= vj,b\nwj,b\n,\n(A.1)\nwhere |Rj,1| = |Rj,2| = b/2 and j = 1, . . . , B. Let σ2\nv = E[v2\nj,b] and σ2\nw =\nE[w2\nj,b] and denote η = σw/σv. Denote ˆF(x) =\n1\nB\nPB\nj=1 1[η · ˆβDC\nj,b\n≤x] and\nF(x) = P\n\u0010\nη · ˆβDC\nj,b ≤x\n\u0011\n. Denote by Fc(x) and fc(x) the CDF and PDF of a\nCauchy random variable.\nA.1.1\nSubsample Estimator Distribution\nLemma 1. If β0 = 0, we have that\nsup\nx∈R\n|F(x) −Fc(x)| = O(b−1/2).\n(A.2)\nProof : We have that\nF(x) = P\n\u0010\nη · ˆβDC\nj,b ≤x\n\u0011\n= P (vj,b/σv ≤x · wj,b/σw, wj,b > 0)\n+ P (vj,b/σv ≥x · wj,b/σw, wj,b < 0) .\n(A.3)\nFor k = 1, 2, deﬁne Vj,b = b−1/2vj,b/σv and Wj,b = b−1/2wj,b/σw Under As-\nsumption 2, by a standard Berry-Esseen bound, supx∈R |P(Vj,b ≤x) −Φ(x)| =\nO(b−1/2) and supx∈R |P(Wj,b ≤x) −Φ(x)| = O(b−1/2). Then also,\nF(x) =\nZ ∞\n0\nfWj,b(y)\nZ xy\n−∞\nfVj,b(z)dzdy +\nZ 0\n−∞\nfWj,b(y)\nZ ∞\nxy\nfVj,b(z)dzdy\n=\nZ ∞\n0\nφ(y)Φ(xy)dy +\nZ 0\n−∞\nφ(y)(1 −Φ(xy))dy + O(b−1/2),\n(A.4)\nand the result holds uniformly over x. Here, for simplicity, we assume that the\n21\nunderlying variables Vj,b hand Wj,b have a continuous distribution. We make\nthis assumption only for the sake of exposition as the main result evidently\nfollows even without the continuity.\nNote that for any two independent standard normal random variables,\nlikewise\nP (Z1/Z2 ≤x) =\nZ ∞\n0\nφ(y)Φ(xy)dy +\nZ 0\n−∞\nφ(y)(1 −Φ(xy))dy.\n(A.5)\nand the result follows.\n■\nA.1.2\nProof for Theorem 1 - Part (a)\nSuppose for simplicity that B is odd. Denote by TB = PB\nj=1 I[η · ˆβDC\nj,b\n>\nt/\n√\nB]. Since ˆβDC\nb\n= median(ˆβDC\n1,b , . . . , ˆβDC\nB,b ), we have that\nP(η · ˆβDC\nb\n≤t/\n√\nB) = P(TB ≤(B −1)/2).\n(A.6)\nBecause the estimators ˆβDC\nj,b are calculated on independent samples, we have\nthat TB ∼Bin(B, pB(t)) with pB(t) = 1 −F(t/\n√\nB) = 1 −Fc(t/\n√\nB) +\nO(1/\n√\nb) by Lemma 1. Now, the r.h.s. of (A.6) equals\nP\n \nTB −BpB(t)\np\nBpB(t)(1 −pB(t))\n≤(B −1)/2 −BpB(t)\np\nBpB(t)(1 −pB(t))\n!\n= P\n\n\nB(b)\nX\nj=1\nYj,b ≤xB(t)\n\n.\n(A.7)\n22\nWe have that\nxB(t) = (B −1)/2 −BpB(t)\np\nBpB(t)(1 −pB(t))\n=\n√\nB(1 −pB(t) −1/2) + O(1/\n√\nB)\np\npB(t)(1 −pB(t))\n=\n√\nB\n\u0010\nFc(t/\n√\nB) −Fc(0)\n\u0011\n+ O(\np\nB/b) + O(1/\n√\nB)\nq\n(1 −Fc(t/\n√\nB))Fc(t/\n√\nB) + O(1/\n√\nb)\n= t\nFc(t/\n√\nB) −Fc(0)\n(t/\n√\nB)\nq\n1/4 + O(1/\n√\nB) + O(1/\n√\nb)\n+ o(1)\n= 2fc(0)t + o(1).\n(A.8)\nWe apply a standard CLT for triangular arrays to PB(b)\nj=1 Yj,b to ﬁnd that\n2ηfc(0) ·\n√\nB(ˆβDC\nb\n−0) −→d N(0, 1).\n(A.9)\nA.2\nThe Case when β0 ̸= 0\nWe ﬁrst deﬁne the following: ˆF(x) =\n1\nB\nPB\nj=1 1[\n√\nb(ˆβDC\nj,b −β0)/σβ ≤x] and\nF(x) = P\n\u0010√\nb(ˆβDC\nj,b −β0)/σβ ≤x\n\u0011\n. We write out ˆβDC\nj,b as\nˆβDC\nj,b =\nP\ni∈Rj,1 (ξ3\ni β2\n0 + xiε2\ni + 2β0(ξ2\ni + ξiui)εi)\nP\ni∈Rj,2 (ξ3\ni β0 + x2\ni εi + β0(u2\ni + 2uiξi)ξi)\n= β +\n1\nb\nP\ni∈Rj,1 (xiε2\ni + 2β0(ξ2\ni + ξiui)εi)\nβσ(3)\nξ\n+ Op(b−1).\n(A.10)\nDeﬁne wi = xiε2\ni + 2β0(ξ2\ni + ξiui)εi and σ2\nβ = (β0σ(3)\nξ )−2E [w2\ni ], then\nP\n \n√\nb(ˆβDC\nj,b −β0)\nσβ\n≤x\n!\n= P\n 1\n√\nb\nP\ni∈Rj,1 wi\nE[w2\ni ]1/2\n≤x\n!\n+ O(b−1).\n(A.11)\n23\nUsing again a Berry-Esseen bound facilitated by Assumption 2, we get\nsup\nx∈R\n|F(x) −Φ(x)| = O(1/\n√\nb).\n(A.12)\nA.2.1\nProof for Theorem 1 - Part (b)\nThe proof is similar to that of Theorem 1. Suppose again that B is odd.\nDenote by TB = PB\nj=1 I[\n√\nb(ˆβDC\nj,b −β)/σβ > t/\n√\nB], then\nP\n\u0010√\nb(ˆβDC −β)/σβ ≤t/\n√\nB\n\u0011\n= P(TB ≤(B −1)/2).\n(A.13)\nNow TB ∼Bin(B, pB) with pB = 1 −F(t/\n√\nB) = 1 −Φ(t/\n√\nB) + O(1/\n√\nb).\nProceeding as in the proof for Theorem 1, the r.h.s. of (A.13) equals\nP\n \nTB −BpB\np\nBpB(1 −pB)\n≤(B −1)/2 −BpB\np\nBpB(1 −pB)\n!\n= P\n\n\nB(b)\nX\ni=1\nYi,b ≤xB\n\n.\n(A.14)\nHere\nxB = (B −1)/2 −BpB\np\nBpB(1 −pB)\n=\n√\nB(1 −pB −1/2) + O(1/\n√\nB)\np\npB(1 −pB)\n=\n√\nB\n\u0010\nΦ(t/\n√\nB) −Φ(0)\n\u0011\n+ O(\np\nB/b) + O(1/\n√\nB)\nq\n(1 −Φ(t/\n√\nB))Φ(t/\n√\nB) + O(1/\n√\nb)\n= t\nΦ(t/\n√\nB) −Φ(0)\n(t/\n√\nB)\nq\n1/4 + O(1/\n√\nB) + O(1/\n√\nb)\n+ o(1)\n= 2tφ(0) + o(1).\n(A.15)\nWe now ﬁnd that\n2σβφ(0) ·\n√\nB · b(ˆβDC −β0) −→d N(0, 1).\n(A.16)\n24\n[Table 4 near here.]\n[Table 5 near here.]\n[Figure 3 near here.]\n[Figure 4 near here.]\n25\nTable 1\nSimulation: bias and standard deviation.\nβ0 = 0, α0 = 0.05\n(1)\n(2)\n(3)\n(4)\nOLS\nbβ\n0.000\n(0.000)\n0.000 (0.000) 0.000 (0.000) 0.000 (0.000)\nbα\n0.050\n(0.002)\n0.050 (0.002) 0.050 (0.002) 0.050 (0.002)\n3M\nbβ\n0.036\n(7.513)\n0.039 (2.774) 0.007 (1.418) 0.031 (4.966)\nbα -0.017 (14.081) -0.012 (4.483) 0.038 (2.717) 0.004\n(7.43)\nDC(20)\nbβ\n0.001\n(0.008)\n0.001 (0.008) 0.001 (0.007) 0.001 (0.008)\nbα\n0.048\n(0.015)\n0.049 (0.013) 0.048 (0.014) 0.049 (0.013)\nDC(40)\nbβ\n0.001\n(0.005)\n0.001 (0.005) 0.001 (0.005) 0.001 (0.005)\nbα\n0.047\n(0.010)\n0.048 (0.009) 0.047 (0.010) 0.048 (0.008)\nβ0 = 0.025, α0 = 0.05\n(1)\n(2)\n(3)\n(4)\nOLS\nbβ\n0.011\n(0.000)\n0.009 (0.000) 0.011 (0.000) 0.009 (0.000)\nbα\n0.077\n(0.001)\n0.075 (0.001) 0.077 (0.001) 0.075 (0.001)\n3M\nbβ\n0.025\n(0.000)\n0.025 (0.001) 0.025 (0.000) 0.025 (0.001)\nbα\n0.050\n(0.002)\n0.050 (0.002) 0.050 (0.002) 0.050 (0.002)\nDC(20)\nbβ\n0.026\n(0.007)\n0.024\n(0.01) 0.026 (0.007) 0.025\n(0.01)\nbα\n0.048\n(0.014)\n0.051 (0.015) 0.048 (0.014) 0.050 (0.015)\nDC(40)\nbβ\n0.026\n(0.007)\n0.018 (0.007) 0.026 (0.007) 0.019 (0.008)\nbα\n0.049\n(0.013)\n0.061 (0.011) 0.049 (0.013) 0.059 (0.012)\nFE\nNo\nYes\nNo\nYes\nTE\nNo\nNo\nYes\nYes\nNote: mean and standard deviation of the estimates for β and α over 20, 000\ndraws of the error-in-variables model yit = ξitβ + zitα + ui, xit = ξit + vit\nwith n = 3, 000 and T = 20. Estimation by least squares (OLS), the third-\norder moment estimator by Geary (1942) (3M), and the divide-and-conquer\nestimator with B blocks (DCB). The standard deviation of the estimates is\nlisted in brackets. Model (1) includes an intercept, model (2) ﬁxed eﬀects,\nmodel (3) time eﬀects, and model (4) two-way ﬁxed eﬀects. For DC, in the\npresence of ﬁxed eﬀects, we do a within transformation on the complete\ndata set. For time eﬀects, we demean within blocks.\n26\nTable 2\nSimulation: coverage.\nβ0 = 0, α0 = 0.05\nβ0 = 0.025, α0 = 0.05\nOLS\nβ\n95.2\n94.5\n95.1\n94.5\n0.0\n0.0\n0.0\n0.0\nα\n95.1\n94.4\n95.1\n94.3\n0.0\n0.0\n0.0\n0.0\n3M\nβ\n96.6\n98.2\n96.6\n98.2\n94.7\n95.5\n94.8\n95.5\nα\n96.5\n98.3\n96.5\n98.2\n95.0\n94.7\n95.0\n94.7\nDC(20)\nβ\n96.6\n97.0\n96.7\n96.9\n94.1\n92.3\n93.9\n92.7\nα\n96.7\n96.7\n96.5\n96.7\n93.9\n92.2\n93.7\n92.7\nDC(40)\nβ\n95.7\n96.3\n95.5\n96.3\n94.3\n75.5\n94.2\n79.8\nα\n95.4\n96.1\n95.4\n95.9\n94.0\n75.3\n94.1\n79.8\nFE\nNo\nYes\nNo\nYes\nNo\nYes\nNo\nYes\nTE\nNo\nNo\nYes\nYes\nNo\nNo\nYes\nYes\nNote: reported is the coverage rate (×100) for the model and methods\nas describe below Table 1. Nominal coverage rate is 0.95. Conﬁdence\nintervals for the 3M estimator are calculated as in Erickson and Whited\n(2002). Conﬁdence intervals for the DC estimator are obtained by a\nbootstrap procedure. To obtain a bootstrap draw, we draw samples\ne∗\ni,b with i = 1, . . . , B with replacement from {±e1,b, . . . , ±eB,b} where\nei,b = ˆβi,b−ˆβDC\nb\nand calculate the median of {e∗\n1,b+ ˆβDC\nb\n, . . . , e∗\nB,b+ ˆβDC\nb\n}.\nWe repeat this procedure 399 times and form a conﬁdence interval by\ntaking the 5 and 95 percentiles.\n27\nTable 3\nApplication: full sample estimates.\n(1)\n(2)\n(3)\n(4)\nOLS\n0.008\n0.009\n0.009\n0.009\n(0.008, 0.008)\n(0.009, 0.009)\n(0.009, 0.009)\n(0.008, 0.009)\n3M\n0.024\n0.041\n0.024\n0.037\n(0.022, 0.025)\n(0.034, 0.048)\n(0.023, 0.026)\n(0.031, 0.042)\nDC(2)\n0.023\n0.031\n0.035\n0.020\n(0.013, 0.034)\n(0.015, 0.048)\n(0.023, 0.048)\n(-0.005, 0.045)\nDC(1)\n0.035\n0.035\n0.040\n0.030\n(0.023, 0.047)\n(0.015, 0.056)\n(0.030, 0.050)\n(-0.002, 0.062)\nOLS\n0.059\n0.095\n0.052\n0.091\n(0.056, 0.061)\n(0.093, 0.098)\n(0.05, 0.054)\n(0.089, 0.094)\n3M\n0.011\n-0.025\n0.003\n-0.013\n(0.004, 0.018)\n(-0.051, 0.002)\n(-0.004, 0.010)\n(-0.035, 0.009)\nDC(2)\n0.012\n0.014\n-0.033\n0.049\n(-0.019, 0.043) (-0.048, 0.084)\n(-0.075, 0.008)\n(-0.033, 0.123)\nDC(1)\n-0.024\n-0.003\n-0.049\n0.010\n(-0.059, 0.011)\n(-0.08, 0.074)\n(-0.081, -0.015) (-0.112, 0.136)\nFE\nNo\nYes\nNo\nYes\nTE\nNo\nNo\nYes\nYes\nNote: Top panel: estimates for the eﬀect of Tobin’s q on investment.\nBottom panel: estimates for the eﬀect of cash ﬂow on investment. 95%\nconﬁdence intervals in brackets. DC(B) indicates the divide-and-conquer\nestimator with B blocks per year.\n28\n‘\nTable 4\nSimulation: bias and standard deviation (n = 6, 000).\nβ0 = 0, α0 = 0.05\n(1)\n(2)\n(3)\n(4)\nOLS\nbβ\n0.000\n(0.000)\n0.000\n(0.000) 0.000 (0.000) 0.000 (0.000)\nbα\n0.050\n(0.001)\n0.050\n(0.001) 0.050 (0.001) 0.050 (0.001)\n3M\nbβ\n0.084\n(8.099) -0.782 (110.119) 0.016 (1.342) 0.011 (2.157)\nbα -0.106 (14.978)\n1.204 (162.353) 0.020 (2.538) 0.033 (3.251)\nDC(20)\nbβ\n0.001\n(0.008)\n0.000\n(0.009) 0.001 (0.007) 0.001 (0.008)\nbα\n0.049\n(0.015)\n0.049\n(0.013) 0.049 (0.014) 0.049 (0.012)\nDC(40)\nbβ\n0.001\n(0.005)\n0.001\n(0.005) 0.001 (0.005) 0.001 (0.005)\nbα\n0.048\n(0.010)\n0.049\n(0.009) 0.048 (0.010) 0.049 (0.008)\nβ0 = 0.025, α0 = 0.05\n(1)\n(2)\n(3)\n(4)\nOLS\nbβ\n0.011\n(0.000)\n0.009\n(0.000) 0.011 (0.000) 0.009 (0.000)\nbα\n0.077\n(0.001)\n0.075\n(0.001) 0.077 (0.001) 0.075 (0.001)\n3M\nbβ\n0.025\n(0.000)\n0.025\n(0.000) 0.025 (0.000) 0.025 (0.000)\nbα\n0.050\n(0.001)\n0.050\n(0.001) 0.050 (0.001) 0.050 (0.001)\nDC(20)\nbβ\n0.026\n(0.005)\n0.026\n(0.007) 0.026 (0.005) 0.026 (0.007)\nbα\n0.049\n(0.010)\n0.049\n(0.011) 0.049 (0.010) 0.049 (0.011)\nDC(40)\nbβ\n0.025\n(0.005)\n0.024\n(0.007) 0.025 (0.005) 0.024 (0.007)\nbα\n0.049\n(0.010)\n0.052\n(0.010) 0.049 (0.009) 0.051 (0.010)\nFE\nNo\nYes\nNo\nYes\nTE\nNo\nNo\nYes\nYes\nNote: mean and standard deviation of the estimates for β and α when the\ncross-sectional dimension is n = 6, 000. For details, see the note following\nTable 1.\n29\nTable 5\nSimulation: coverage (n = 6, 000).\nβ0 = 0, α0 = 0.05\nβ0 = 0.025, α0 = 0.05\nOLS\nβ\n95.1\n94.3\n95.0\n94.3\n0.0\n0.0\n0.0\n0.0\nα\n95.0\n94.5\n95.0\n94.5\n0.0\n0.0\n0.0\n0.0\n3M\nβ\n97.0\n98.4\n97.0\n98.4\n95.0\n95.5\n95.0\n95.5\nα\n96.9\n98.4\n96.9\n98.3\n94.8\n94.5\n94.8\n94.5\nDC(20)\nβ\n96.9\n96.9\n96.4\n96.8\n94.1\n94.0\n93.9\n94.3\nα\n96.8\n96.7\n96.5\n96.7\n93.9\n93.9\n93.9\n94.2\nDC(40)\nβ\n96.0\n96.6\n96.0\n96.4\n94.1\n91.2\n94.5\n92.4\nα\n95.9\n96.3\n95.8\n96.2\n93.9\n91.0\n94.4\n92.2\nFE\nNo\nYes\nNo\nYes\nNo\nYes\nNo\nYes\nTE\nNo\nNo\nYes\nYes\nNo\nNo\nYes\nYes\nNote: coverage rate (×100) for the model and methods as described below\nTable 1 with cross-sectional dimension n = 6, 000. For details, see the note\nfollowing Table 2.\n30\nFigure 1: Application: estimates for the eﬀect of Tobin’s q on investment.\nFigure 2: Application: estimates for the eﬀect of cash ﬂow on investment.\n31\nFigure 3: Application: estimates for the eﬀect of Tobin’s q on investment (1\nblock per year).\nFigure 4: Application: estimates for the eﬀect of cash ﬂow on investment (1\nblock per year).\n32\n"}