{"text": "arXiv:2310.13874v1  [stat.ME]  21 Oct 2023\nA Linear Errors-in-Variables Model with Unknown\nHeteroscedastic Measurement Errors\nLinh H. Nghiem∗1 and Cornelis J. Potgieter2\n1University of Sydney\n2Texas Christian University & University of Johannesburg\nAbstract: In the classic measurement error framework, covariates are contami-\nnated by independent additive noise. This paper considers parameter estimation\nin such a linear errors-in-variables model where the unknown measurement error\ndistribution is heteroscedastic across observations. We propose a new general-\nized method of moment (GMM) estimator that combines a moment correction\napproach and a phase function-based approach. The former requires distributions\nto have four ﬁnite moments, while the latter relies on covariates having asymmet-\nric distributions. The new estimator is shown to be consistent and asymptotically\nnormal under appropriate regularity conditions. The asymptotic covariance of\nthe estimator is derived, and the estimated standard error is computed using a\nfast bootstrap procedure. The GMM estimator is demonstrated to have strong\nﬁnite sample performance in numerical studies, especially when the measurement\nerrors follow non-Gaussian distributions.\nKey words: Asymmetric Distributions; Bootstrap; Generalized Method of Mo-\nments; Nutrition; Phase Function; Variance Heterogeneity.\n∗Corresponding author: linh.nghiem@sydney.edu.au\n1\n1.\nIntroduction\nThe errors-in-variables linear model arises when certain covariates suﬀer from measurement\nerror contamination. This can stem from sources like instrumentation and self-reporting\nerrors, as well as the inadequate use of short-term measurements as proxies for long-term\nvariables.\nIgnoring measurement error can result in biased estimators, see Carroll et al.\n(2006) regarding the importance of measurement error correction in understanding the ef-\nfects of the covariates on the outcome. This paper considers a heteroscedastic measurement\nerror setting, allowing the measurement error covariance to vary across observations. This\nobservation-speciﬁc measurement error variance structure, treated as unknown, requires esti-\nmation from replicate data. We adopt the classic additive measurement error model wherein\nthe contaminated covariates, i.e the surrogates, are treated as the sum of the true covariates\nand independent measurement errors, so surrogate variances exceed true covariate variances.\nOne of the ﬁrst papers to address the problem of a predictor variable contaminated by\nmeasurement error is Wald (1940). Since then, many parametric methods have been pro-\nposed, such as the maximum likelihood approach of Higdon and Schafer (2001). The con-\nditional scores approach (Stefanski and Carroll, 1987) and the conditional quasi-likelihood\napproach (Hanfelt and Liang, 1997) require the conditional distributions of the outcomes and\nthe contaminated covariates to be speciﬁed, both in terms of the true covariates. Regression\ncalibration (Carroll and Stefanski, 1990) estimates the true covariates from the contaminated\ncovariates in a validation sample. Simulation-extrapolation (SIMEX) (Stefanski and Cook,\n1995) is a computationally-intensive method that adds additional measurement error to esti-\nmate model parameters and then extrapolates to the error-free case. All the methods listed\nin this paragraph require parametric speciﬁcations for some distributional components of the\nmodel.\nOur paper proposes an eﬃcient distribution-free estimator for a linear errors-in-variables\nmodel with heteroscedastic measurement errors. Our estimator combines two existing meth-\nods: a moment correction approach and a phase-function based estimator. The moment\ncorrection approach dates back to Reiersøl (1941) and has also been considered by Gillard\n(2014) and Erickson et al. (2014). This method requires the existence of model moments up\nto order 2M, where M ≥2 is the number of moments that are used to derive moment equa-\ntions. In contrast, the phase function-based estimator, proposed by Nghiem et al. (2020),\ndoes not impose moment conditions on the underlying random variables, but requires the\ntrue covariates to have asymmetric distributions. These authors deﬁne minimum distance es-\ntimators based on the diﬀerence of two empirical phase functions. Our paper proposes a new\nmethod combining the moment-based and phase function-based approaches within a gen-\neralized method of moments (GMM) framework. We assume that the measurement errors\nhave a joint symmetric distribution, but both the distribution type and the observation-\n2\nspeciﬁc covariance matrix are unknown. Our estimator relaxes the asymmetry condition of\nNghiem et al. (2020) for a common scenario in practice where all observations have at least\ntwo replicates (Carroll et al., 2006). We propose two diﬀerent weighting schemes to construct\nweighted empirical phase functions that account for measurement error heteroscedasticity.\nFurthermore, we present a computationally eﬃcient bootstrap technique to estimate the co-\nvariance matrix, serving both GMM estimator computation and standard error estimation.\nSimulation studies and a data application demonstrate that our combined GMM estimator\nhave strong ﬁnite sample performance.\nThe remaining sections of the paper are organized as follows. Section 2 reviews moment-\ncorrected and phase function estimators. Section 3 introduces the GMM estimator along\nwith a bootstrap approach for covariance matrix estimation. Section 4 conducts simulation\nstudies to compare estimation methods and assess standard error recovery. Section 5 presents\nan illustrative NHANES dataset analysis, and Section 6 concludes the study.\n2.\nMoment-corrected and phase function estimators\n2.1\nHeteroscedastic errors-in-variables model formulation\nLet X = {D1, . . . , Dn} denote an observed sample following a linear errors-in-variables (EIV)\nmodel. Here, Dj = (W\n(nj)\nj\n, ˜Zj, yj) is a random sample following EIV model structure that\nyj = X⊤\nj β0 + Z⊤\nj γ0 +εj and Wjk = Xj + Ujk,\n(2.1)\nfor k = 1, . . . , nj and j = 1, . . . , n.\nIn this model, we let yj ∈R denote the outcome\nof interest, Xj = (Xj1, . . . , Xjp)⊤∈Rp denote the true values of the error-prone covari-\nates, Zj =\n\u00001, ˜Z\n⊤\nj\n\u0001⊤with ˜Zj = (Zj1, . . . , Zjq)⊤∈Rq denote the error-free covariates, and\nWjk = (Wjk,1, . . . , Wjk,p)⊤denote a contaminated version of Xj subject to independent\nmeasurement error Ujk = (Ujk,1, . . . , Ujk,p)⊤. Furthermore, we let W\n(nj)\nj\n= (Wj1, . . . , Wjnj)\nand U\n(nj)\nj\n= (Uj1, . . . , Ujnj) denote, respectively, the collections of contaminated repli-\ncates and measurement errors associated with the nj ≥2 replicates of the jth obser-\nvation, and εj denote the usual regression error.\nAlso, β0 = (β01, . . . , β0p)⊤∈Rp and\nγ0 = (γ00, γ01, . . . , γ0q)⊤∈Rq+1 denote, respectively, the coeﬃcients vectors associated with\nXj and Zj. We assume the measurement errors Ujk have mean zero and covariance Σj that\nis potentially distinct for all observations. Consequently, we have Var[Wjk] = Σx + Σj where\nΣx = Var[Xj] for k = 1, . . . , nj and j = 1, . . . , n. The regression errors εj’s are assumed to\nbe independent and identically distributed (iid) with mean zero and variance σ2\nε.\nIn subsequent sections of this paper, several conditions will be important when consid-\nering the estimation methods for the linear EIV model (2.1). These conditions are now\n3\npresented and discussed. To this end, let operator ⊥denote the independence of random\nquantities, let ∥A∥max = max{|ajk|} denote the element-wise inﬁnity norm of an arbitrary\nmatrix A, and let i = √−1 denote the imaginary unit.\nCondition C1. For the jth observation, Ujk ⊥Ujk′ for k ̸= k′, k, k′ ∈{1, . . . , nj}. Fur-\nthermore, U\n(nj)\nj\n⊥(Xj, Zj, εj). Finally, the random quantities (Xj, Zj, εj), j = 1, . . . , n are\niid copies of random variables (X, Z, ε).\nIn addition to requiring independent observations, Condition C1 requires that the mea-\nsurement error components across the replicates associated within a given observation are\nmutually independent. Furthermore, the measurement errors, true covariates, and regres-\nsion errors are required to be mutually independent as well. An example of a well-studied\nscenario that would violate this assumption is the Berkson error model wherein the observed\npredictor Wj has a smaller variance than the true predictor Xj, see Song (2021) for an\noverview. Many time-series error models would also violate Condition C1. Nevertheless,\nthese settings are outside the scope of the current paper.\nCondition C2. For the jth observation, random quantities ˜Xj = [X⊤\nj , ˜Z\n⊤\nj ]⊤and εj satisfy\nE\n\u0010\r\r ˜Xj ˜X\n⊤\nj\n\r\r4\nmax\n\u0011\n< ∞and E(ε4\nj) < ∞. Also, for the replicates associated with observation\nj, E\n\u0010\r\rUjk U⊤\njk\n\r\r4\nmax\n\u0011\n< ∞, j = 1, . . . , n.\nWhile this paper imposes no parametric distributional assumption on the underlying\nvariables in the model, we do require that the covariates, regression errors, and measurement\nerrors have distributions with at least four ﬁnite moments. Examples of situations where\nCondition C2 would be violated would be if the covariates and/or measurement error terms\nfollowed a multivariate t distribution with fewer than 4 degrees of freedom, or a multivariate\nstable law with index parameter α < 2. Condition C2 is central to the moment-corrected\napproach of Section 2.2 having an asymptotic normal distribution. While the phase function-\nbased approach of Section 2.3 is less concerned with the higher-order moments, the following\ntwo conditions are central to it.\nCondition C3. The replicate measurement error vectors Ujk have a distribution symmetric\nabout zero with strictly positive characteristic function, φUj(t) = E[exp(it⊤Ujk)] > 0, k =\n1, . . . , nj, for all t = (t1, . . . , tp)⊤∈Rp and possibly distinct for each j = 1, . . . , n. Similarly,\nthe regression errors εj have a distribution that is symmetric around zero with strictly positive\ncharacteristic function φε(t) = E[exp(itεj)] > 0 for all t ∈R and common to all j = 1, . . . , n.\nMany distributions commonly encountered in the measurement error literature satisfy\nCondition C3, including the Gaussian, the Laplace, and Student’s t distributions. Excluded\n4\nby this condition are distributions only taking values on a bounded interval, for example,\nthe (multivariate) uniform distribution, because the corresponding characteristic functions\nare negative for some t.\nIn order to state the next condition, the phase function of a random variable has to be\ndeﬁned. For an arbitrary random variable V , let φV (t) denote the characteristic function\nof V . The phase function of V is then deﬁned as ρV (t) = φV (t)/|φV (t)| with |φV (t)|2 =\nφV (t)¯φV (t) being the squared complex norm and ¯φV (t) the complex conjugate of φV (t). For\na more in-depth discussion of the phase function and its properties, consult Delaigle and Hall\n(2016) and Nghiem et al. (2020).\nCondition C4. Let V (β, γ) = X⊤β + Z⊤γ and let ρV (t| β, γ) denote the corresponding\nphase function of V . Note that this phase function depends on parameters (β, γ). Then,\nρV (t| β, γ) is continuously diﬀerentiable with respect to all elements of β and γ. Furthermore,\n∂ρV (t| β, γ)/∂βk ̸= 0 for k = 1, . . . , p and ∂ρV (t| β, γ)/∂γk ̸= 0 for k = 0, . . . , q.\nCondition C4 may appear esoteric. In essence, this condition imposes a joint skewness\nrequirement on the true covariates, as any symmetric variable independent of the other\nvariables will not contribute to the phase function in any way. A related suﬃcient condition\nused by Nghiem et al. (2020) is that for covariates ˜X = (X⊤, ˜Z\n⊤)⊤= ( ˜X1, . . . , ˜Xp+q)⊤and\ntrue parameter values ˜β0 = (˜β01, . . . , ˜β0,p+q) = (β01, . . . , β0p, γ01, . . . , γ0q)⊤, there exists no\nsubset of variables P ⊆{1, . . . , p + q} such that P\nk∈P ˜β0k ˜Xk has a symmetric distribution.\nCondition C5. The true parameter θ0 = (β⊤\n0 , γ⊤\n0 )⊤is an interior point of a compact and\nconvex parameter space Θ ⊆Rp+q+1.\nCondition C5 is a regularity condition imposed on the parameter space; here it is satisﬁed\nwhen all parameter values are ﬁnite.\n2.2\nMoment correction\nMoment correction is a well-established approach to estimate the parameters of the het-\neroscedastic EIV model as per equation (2.1). As moment correction is also central to the\nnew estimation method proposed in Section 3, a brief overview is provided here. The inter-\nested reader can consult Buonaccorsi (2010, Section 5.4) for more details.\nLet Wj = n−1\nj\nPnj\nk=1 Wjk = Xj + Uj denote the averaged contaminated replicates of\nthe jth observation. Here, Uj = n−1\nj\nPnj\nk=1 Ujk, whose variance is Var (Uj) = n−1\nj Σj. Mo-\nment correction relies on the corrected L2 norm L(β, γ) = n−1 Pn\nj=1\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u00012−\nn−1 Pn\nj=1 n−1\nj\nβ⊤Σj β, which satisﬁes E[L(β0, γ0)] = σ2\nε when Condition C1 holds. The gra-\n5\ndients corresponding to this function are\nSL,β = ∂L\n∂β = −2\nn\nn\nX\nj=1\nWj\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u0001\n−2\nn\nn\nX\nj=1\n1\nnj\nΣj β,\nSL,γ = ∂L\n∂γ = −2\nn\nn\nX\nj=1\nZj\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u0001\n.\nThe moment corrected estimator is subsequently deﬁned to be the solution of the p + q + 1\nestimating equations SL = [S⊤\nL,β, S⊤\nL,γ]⊤= 0. These estimating equations are well-deﬁned in\na statistical sense whenever the underlying variables have at least two ﬁnite moments. How-\never, to establish that the estimators are asymptotically normally distributed, Conditions\nC2 and C5 are required to ensure the variances of the gradients SL,β and SL,γ are ﬁnite.\nTo implement the above moment correction, knowledge of the variance-covariance ma-\ntrices Σj is required. When these are unknown, they can be consistently estimated using\nˆΣj =\n1\nnj(nj −1)\nnj−1\nX\nk=1\nnj\nX\nk′>k\n(Wjk −Wjk′)(Wjk −Wjk′)⊤.\n(2.2)\nThe covariance estimator in (2.2) follows upon noting that\nE\n\u0002\n(Wjk −Wjk′)(Wjk −Wjk′)⊤\u0003\n= E\n\u0002\n(Ujk −Ujk′)(Ujk −Ujk′)⊤\u0003\n= 2 Σj\nfor any pair of replicates (Wjk, Wjk′) with k ̸= k′. The second equality follows from the\nindependence of measurement error terms (Ujk, Ujk′), and the assumed mean and covariance\nstructure of the Ujk. Subsequently, the estimator ˆΣj is deﬁned by averaging over the squared\ndiﬀerences of the nj(nj −1)/2 such pairs associated with the jth observation. Therefore, in\npractice, the gradient SL,β is replaced by an approximation ˆSL,β which substitutes unknown\nΣj by ˆΣj for j = 1, . . . , n. The moment-corrected estimators are then calculated as the\nsolution of the estimating equation\nˆSL = [ˆS\n⊤\nL,β, S⊤\nL,γ]⊤= 0.\n(2.3)\nThese estimators ˆΣj and the gradient ˆSL will be further used in Section 3.\n2.3\nPhase function-based estimation\nRecently, in the context of a homoscedastic EIV model without replicate data, Nghiem et al.\n(2020) proposed a phase function-based estimator.\nTheir approach, unlike the moment-\ncorrected estimator, does not require estimation of the measurement error covariances, but\n6\nstill leads to a consistent estimator even when the underlying random variables do not have\nﬁnite variances. We propose here a new variation of the phase function method that adjusts\nfor heteroscedasticity of the measurement error, which is made possible by the availability\nof replicates. Furthermore, the asymmetric linear combination assumption of Nghiem et al.\n(2020) is replaced by Condition C4.\nFor the model deﬁned in (2.1), deﬁne V0j = X⊤\nj β0 + Z⊤\nj γ0 so that yj = V0j + εj, j =\n1, . . . , n. Since (Xj, Zj, εj) are independent copies of (X, Z) by Condition C1, the random\nvariable V0j is an independent copy of V0 := V (β0, γ0) = X⊤β0 + Z⊤γ0 and yj is an\nindependent copy of Y = V0 + ε.\nRecall that φY (t) and ρY (t) denote, respectively, the\ncharacteristic and phase functions of Y , and the same holds for φV0(t) and ρV0(t) in terms of\nV0. From Condition C3, the phase function ρY (t) is given by\nρY (t) = φY (t)\n|φY (t)|\n(i)= φV0(t)φε(t)\n|φV0(t)φε(t)|\n(ii)\n= φV0(t)\n|φV0(t)| = ρV0(t),\nwhere (i) follows from the independence of the regression error as per Condition C1, and (ii)\nfollows from Condition C3. Moreover, recalling that Wj and Uj are the averaged replicates\nand measurement error terms, respectively.\nSince the term U⊤\nj β also has a symmetric\ndistribution around zero, a similar argument shows that the phase function of arbitrary\nlinear combination ˜Vj(β, γ) = W⊤\nj β + Z⊤\nj γ = X⊤\nj β + Z⊤\nj γ + U⊤\nj β is the same as the\nphase function of V (β, γ), i.e ρ ˜Vj(t| β, γ) = ρV (t| β, γ) for all j = 1, . . . , n.\nOur method now proceed by equating two diﬀerent empirical phase functions. Firstly,\nbased on the outcomes yj, deﬁne empirical phase function\nˆρY (t) =\nPn\nj=1 exp(ityj)\nhPn\nj=1\nPn\nk=1 exp {it (yj −yk)}\ni1/2,\nand based on covariates (Wj, Zj), we deﬁne the weighted empirical phase function (WEPF),\nˆρV (t| β, γ) =\nPn\nj=1 qj exp\n\b\nit(W⊤\nj β + Z⊤\nj γ)\n\t\n\u0010Pn\nj=1\nPn\nk=1 qjqk exp [it {(Wj −Wk)⊤β +(Zj −Zk)⊤γ}]\n\u00111/2.\n(2.4)\nwhere the weights {qj}n\nj=1 satisfy qj ≥0 and Pn\nj=1 qj = 1.\nThe phase function-based\nestimator is motivated by noting that the population level equivalents ρY (t) and ρV (t| β, γ),\nunder the asymmetry imposed on the covariates by Condition C4, are equal if and only if\n(β, γ) = (β0, γ0). Thus, the estimator for (β0, γ0) is deﬁned to be the minimizer of the\ndiscrepancy\nD(β, γ) =\nZ ∞\n−∞\n|ˆρY (t) −ˆρV (t| β, γ)|2ω(t)dt,\n(2.5)\n7\nwhere ω(t) is a weighting function to ensure the integral is ﬁnite. Direct minimization of (2.5)\nis computationally expensive. Following the example of Nghiem et al. (2020), we consider\nthe alternative minimization problem\n˜D(β, γ)\n=\nZ t∗\n0\n\u0014\nCy(t)\nn\nX\nj=1\nqj sin\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\n−Sy(t)\nn\nX\nj=1\nqj cos\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t \u00152\nKt∗(t)dt\n(2.6)\nwhere Cy(t) = n−1 Pn\nj=1 cos(t yj), Sy(t) = n−1 Pn\nj=1 sin(t yj), and Kt∗(t) is a kernel function\nthat is only non-zero on the interval [0, t∗]. Note that the two forms (2.5) and (2.6) are\nequivalent for appropriate choices of ω(t) and Kt∗(t). Following Delaigle and Hall (2016),\nwe use Kt∗(t) = (1 −t/t∗)2 for numerical implementation with t∗being the largest t such\nthat |ˆφy(t)| ≤n−1/2. For any ﬁxed (β, γ), by a similar argument to Nghiem and Potgieter\n(2018), the WEPF in (2.4) is a consistent estimator of ρV (β, γ) for any set of weights\nhaving maxj qj = O(n−1). Therefore, our intended goal is to adjust for measurement error\nheteroscedasticity through an appropriate choice of weights; we will elaborate on this in\nSection 3.2.\n3.\nA GMM estimator\n3.1\nGeneralized method of moments\nThe moment-corrected and phase function-based estimators from Section 2 rely on diﬀerent\nyet complementary sets of assumptions. On the one hand, moment correction is a least\nsquares approach with a variance correction term, thus using information from the ﬁrst two\nunderlying model moments. On the other hand, as discussed in Nghiem et al. (2020), the\nphase function method essentially uses all odd moments of the underlying model, provided\nthese moments exist. Hence, a method combining these two approaches will generally make\nuse of more model information, allowing for the possibility of a more eﬃcient estimator.\nIn this paper, we describe how to combine the two methods using a generalized method of\nmoments (GMM) approach, which is widely used to estimate parameters in over-identiﬁed\nsystems (Hansen, 1982).\nTo deﬁne the GMM estimator, recall that the phase function-based estimator is found\nby minimizing function ˜D(β, γ) in (2.6). The minimizer can be expressed as the solution of\nthe p + q + 1 estimating equations S ˜D = [S⊤\n˜D,β, S⊤\n˜D,γ]⊤= 0 where\nS ˜D,β = ∂˜D\n∂β and S ˜D,γ = ∂˜D\n∂γ .\n(3.7)\n8\nThus, if we simultaneously consider the estimating equations from moment correction, ˆSL =\n0 in (2.3), and the phase-function based estimators, S ˜D = 0 deﬁned above in (3.7), we have\na system of 2(p + q + 1) estimating equations in terms of the p + q + 1 model parameters.\nMore formally, let\nS := S(β, γ) = [ˆS\n⊤\nL, S⊤\nD]⊤= [ˆS\n⊤\nL,β, S⊤\nL,γ, S⊤\n˜D,β, S⊤\n˜D,γ]⊤\n(3.8)\ndenote the vector of 2(p + q + 1) gradient equations. The system S(β, γ) = 0 is generally\nover-identiﬁed and does not have an exact solution. Suppressing the dependence of S on\n(β, γ), we deﬁne a quadratic form in S,\nQ(β, γ) = S⊤Ω−1\nS S,\n(3.9)\nwhere ΩS =\n\u0002\nVar(S)\n\u0003\n(β,γ)=(β0,γ0) is the 2(p+q+1)×2(p+q+1) covariance matrix correspond-\ning of the gradient equations S evaluated at the true parameter values (β0, γ0). The GMM\nestimator is then deﬁned to be the minimizer of Q(β, γ). Minimizing the GMM discrepancy\nfunction Q(β, γ) is equivalent to projecting S onto a (p + q + 1)-dimensional subspace and\nsolving the resulting equations, so the GMM estimator can be thought of as the solution to\nan optimal linear combination of the estimating equations in S.\nWe next study the asymptotic properties of the proposed GMM estimator. Both the\nconsistency and asymptotic normality of our proposed estimator follow from the properties\nof the GMM approach under suitable regularity conditions. First, we establish the uniform\nconvergence of Q(β, γ).\nLemma 1. Assume that all random variables in the model (2.1) have at least two ﬁnite\nmoments. Then, for (β, γ) ∈Θ as per Condition C5, the function Q(β, γ)\np→Q0(β, γ)\nuniformly, where Q0(β, γ) = S⊤\n0 Ω−1\nS S0 and S0 := S0(β, γ) = limn→∞E[S(β, γ)] is the\nlimiting expectation of the gradient equations.\nThe proof of Lemma 1 is presented in Section S1 of the Supplementary Materials. The\nproof relies of verifying suﬃcient conditions for uniform convergence as per Lemma 2.9 of\nNewey and McFadden (1994). The uniform convergence of Q(β, γ) is an essential step in\nestablishing the consistency of the GMM estimator in our next theorem.\nTheorem 1. Consider the heteroscedastic linear EIV model deﬁned in (2.1). Assume Con-\nditions C1, C3 and C5 hold. Also assume that all variables in the model have at least two\nﬁnite moments. Finally, assume the weights qj used for constructing the empirical phase\nfunction in (2.4) satisfy maxj qj = O(n−1). Then, the estimator obtained by minimizing\nQ(β, γ) = S⊤Ω−1\nS S is consistent for true value (β0, γ0).\n9\nTheorem 1 follows from Theorem 2.1 of Newey and McFadden (1994) combining the uni-\nform convergence in Lemma 1 along with establishing that Q0(β, γ) has a global minimum\nat the true parameters (β0, γ0). The proof is presented in Section S2 of the Supplementary\nMaterials. We further note that for the GMM estimator to be consistent, Condition C4 (co-\nvariate asymmetry) is not a requirement. When it does not hold, some of the components of\nS converge to 0 for all values of the underlying parameters. However, the limiting quadratic\nform still has a unique minimum at the true parameter values, because the estimating equa-\ntions originating with the moment-corrected approach do not rely on asymmetry. With this\nin mind, we focus the GMM method on a situation where ∂ρV (t| β, γ)/∂βk ̸= 0 for some\nk = 1, . . . , p and/or ∂ρ(t| β, γ)/∂γk ̸= 0 for some k = 1, . . . , q. When some of these partial\nderivatives are non-zero, then evaluation of the empirical phase function contributes infor-\nmation to the estimation procedure and it is possible that the eﬃciency of the estimator is\nimproved. Finally, we establish the asymptotic normality of the proposed estimator.\nTheorem 2. Consider the heteroscedastic linear EIV model deﬁned in (2.1). Assume Con-\nditions C1, C2, C3, and C5 hold. Furthermore, assume the weights qj used for construct-\ning the empirical phase function in (2.4) satisfy maxj qj = O(n−1). Then, the estimator\n(ˆβgmm, ˆγgmm) obtained by minimizing Q(β, γ) = S⊤Ω−1\nS S satisﬁes\nn1/2 n\u0000 ˆβ⊤\ngmm ˆγ⊤\ngmm\n\u0001⊤−\n\u0000β⊤\n0 γ⊤\n0\n\u0001⊤o\n∼N\n\u0010\n0,\n\u0000P1Ω−1\nS P ⊤\n1\n\u0001−1\u0011\nwhere\nP1 = E\n\" \u0012∂S\n∂β\n⊤\n, ∂S\n∂γ\n⊤\u0013 #\nwith the expectations in P1 evaluated at the true parameter values (β0, γ0).\nTheorem 2 follows from Theorem 3.4 of Newey and McFadden (1994).\nCompared to\nthe required conditions for the consistency established in Theorem 1, Theorem 2 requires\nstronger moment conditions that all the variables in the model having four ﬁnite moments\nas per Condition C2. We furthermore note that versions of Theorems 1 and 2 still hold if\nwe replace the covariance matrix ΩS by any positive deﬁnite matrix Ω∗. Nevertheless, the\nchoice of ΩS leads to the most asymptotically eﬃcient estimator, as discussed in Section 5.2\nof Newey and McFadden (1994).\nIn practice, the covariance matrix ΩS is unknown and needs to be replaced by a suitable\nestimator ˆΩS. As per Section 4 of Newey and McFadden (1994), using a consistent estimator\nof ΩS leaves the asymptotic distribution of the estimators unchanged. We therefore propose\na bootstrap resampling algorithm in Section 3.3 to obtain a suitable estimator ˆΩS. First,\nhowever, we explore the calculation of weights qj, j = 1, . . . , n in the WEPF to adjust for\nmeasurement error heteroscedasticity.\n10\n3.2\nChoice of phase function weights\nThe weighted phase function in (2.4) requires the speciﬁcation of weights {qj}n\nj=1 with qj ≥0\nand Pn\nj=1 qj = 1. If the underlying distributions were known, it would be possible to directly\nminimize an asymptotic variance metric directly related to this estimated phase function –\nsee Nghiem and Potgieter (2018) for a derivation of the pointwise asymptotic variance of\nsuch a WEPF. However, since the underlying distributions are assumed unknown, the direct\napproach is unavailable to us. We therefore present here two weighting schemes that are\neasily implemented in practice.\nFor the ﬁrst approach, note that the variable Pn\nj=1 qj W⊤\nj β0 is an unbiased estimator of\nE(X⊤β0). Therefore, one can consider ﬁnding a set of weights that minimize the variance of\nthe above mean estimator. Speciﬁcally, we have Var\n\u0010P\nj qj W⊤\nj β0\n\u0011\n= P\nj q2\nj β⊤\n0 (Σx +n−1\nj\nΣj) β0,\nwhich is minimized by weights qj = a−1\nj /Pn\nk=1 a−1\nk , where aj = β⊤\n0 (Σx +n−1\nj\nΣj) β0. Un-\nfortunately, these weights depend on the unknown true β0 and are therefore impossible\nto calculate. We propose the following proxy estimator based on a “minimax” argument.\nLet λj denote the largest eigenvalue of Σx +n−1\nj\nΣj.\nWe then have aj ≤λj∥β0 ∥2 with\n∥β0 ∥2 = Pp\nk=1 β2\n0k denoting the squared L2 norm. Therefore, we calculate weights based\non replacing the aj by the corresponding upper bounds. Note that using the upper bounds\nhas the potential to underweight observations with the large measurement error i.e. their\ninﬂuence is even further mitigated. The proposed minimax weights are given by\nˆqmm\nj\n=\nˆλ−1\nj\nPn\nk=1 ˆλ−1\nk\n, j = 1, . . . , n,\n(3.10)\nwhere ˆλj is the largest eigenvalue of ˆΣx + n−1\nj\nˆΣj with ˆΣj given in (2.2) and with ˆΣx =\n(n −1)−1 Pn\ni=1(Wj −W)(Wj −W)⊤−n−1 Pn\nj=1 n−1\nj\nˆΣj, with W = n−1 Pn\nj=1 Wj.\nFor the second approach, note that for all j = 1, . . . , n, we have E(Wj) = E(X). There-\nfore, the quantity ˆµq = Pn\nj=1 qjWj is an unbiased estimator of E(X).\nRecalling that\nVar(Wj) = Σx + n−1\nj Σj, we deﬁne the L2 discrepancy\nL(q) =\nn\nX\nj=1\n(Wj −ˆµq)⊤\u0000Σx + n−1\nj Σj\n\u0001−1 (Wj −ˆµq)⊤,\n(3.11)\nwith q = (q1, . . . , qn). Our second weighting scheme proposes minimizing L(q) in terms\nof the weights q subject to qj ≥0 and Pn\nj=1 qj = 1. We note that minimizing L(q) is\nequivalent to maximizing the log-likelihood of the {Wj}n\nj=1 in terms of q assuming each Wj\nfollows a multivariate normal distribution. We therefore refer to this approach as the quasi-\nlikelihood weighting scheme. In Section S3 of the Supplementary Materials, we show that\n11\nthe quasi-likelihood weights are found by solving a system of linear equations. Replacing\nΣx and the Σj in (3.11) with their corresponding estimator ˆΣx and ˆΣj, we denote the\nresulting minimizing weights by ˆqql\nj for j = 1, . . . , n. The performance of the minimax and\nquasi-likelihood weights are further considered in the simulation studies of Section 4.\n3.3\nGMM covariance matrix and standard error estimation\nImplementation of the proposed GMM estimator requires a suitable estimator for ΩS in\n(3.9), where ΩS is the covariance matrix of the 2(p + q + 1) gradient equations S at the\ntrue parameter values (β0, γ0). We propose a computationally–eﬃcient strategy based on\nthe estimating function bootstrap approach of Hu and Kalbﬂeisch (1997); this strategy is\nalso used in Nghiem et al. (2020) for estimating the variances of the phase function-based\nestimators.\nRecall that X = {D1, . . . , Dn} denotes the random sample from the linear EIV model\nwith Dj = (W\n(nj)\nj\n, ˜Zj, yj), j = 1, . . . , n. The bth bootstrap sample, X ∗\nb = {D∗\nb1, . . . , D∗\nbn},\nb = 1, . . . , B, is obtained by sampling n times with replacement from X . No re-sampling\nis done at the replicate level. For the bth bootstrap sample, we compute ˆΣ\n∗\nb,x, ˆΣ\n∗\nb,j, and\nˆq∗\nb,j which correspond to the observation-level measurement error covariance matrices, and\nthe weights for the phase function estimator calculated using Xb for j = 1, . . . , n.\nWe\nsubsequently use these quantities and our bootstrap sample to evaluate S∗\nb(ˆβin, ˆγin) =\n[ˆS\n∗\nb,L(ˆβin, ˆγin)⊤S∗\nb, ˜D(ˆβin, ˆγin)⊤]⊤as deﬁned in equation (3.8). Here, (ˆβin, ˆγin) denote consis-\ntent initial estimators of (β0, γ0); in our implementation, the moment-corrected estimators\n(ˆβmc, ˆγmc) are used as initial estimators. Finally, using the B bootstrap samples, we estimate\nΩS by ˆΩ∗\nS = B−1 PB\nb=1 S∗\nb(ˆβin, ˆγin) S∗\nb(ˆβin, ˆγin)⊤. The method is fast and can be implemented\nwithout the need to minimize bootstrap versions of the discrepancy function Q(β, γ); imple-\nmentation requires only evaluation of the gradient vector for each bootstrap sample prior to\ncalculating ˆΩ∗\nS. We have found that B = 100 bootstrap samples lead to a good performance.\nThe GMM estimator is ﬁnally computed by minimizing ˆQ(β, γ) = S⊤\u0000 ˆΩ∗\nS\n\u0001−1 S.\nAs pointed out by a referee, our approach is similar to the traditional two–step feasible\nGMM approach, in which we ﬁrst obtain a consistent estimator (ˆβmc, ˆγmc) and then use\nit to estimate the covariance matrix ΩS in the GMM discrepancy function.\nNote that\nan iterated GMM approach can be pursued, whereby this estimator and a new round of\nbootstrap samples are used to update the GMM covariance matrix and then minimize the\nresulting statistic. Asymptotically, this iterated GMM estimator is equivalent to the two-\nstep estimator, although in ﬁnite samples, the relative performance between two–step and\niterative GMM estimators have been reported to be mixed, see Hansen et al. (1996).\nThis bootstrap quantity ˆΩ∗\nS can also subsequently be used to estimate standard errors of\nthe GMM estimators. Based on the GMM covariance matrix from Theorem 2, the asymptotic\n12\ncovariance matrix of ( ˆβgmm, ˆγgmm) is estimated by ( ˆP1 ˆΩ∗\nS ˆP ⊤\n1 )−1. Here, ˆP1 an empirical coun-\nterpart of the expected gradient P1 and is evaluated at the GMM estimator ( ˆβgmm, ˆγgmm).\nSpeciﬁcally, the matrix ˆP1 is given by\nˆP1 =\n\n\n2n−1 Pn\nj=1 Wj W⊤\nj −2n−1 Pn\nj=1 ˆΣj\n2n−1 Pn\nj=1 Wj Z⊤\nj\n2n−1 Pn\nj=1 Zj W⊤\nj\n2n−1 Pn\nj=1 Zj Z⊤\nj\n∂ˆS ˜D,β\n∂β\n\f\f\f\f\n( ˆβgmm,ˆγgmm)\n∂ˆS ˜D,β\n∂γ\n\f\f\f\f\n( ˆβgmm,ˆγgmm)\n∂ˆS ˜D,γ\n∂β\n\f\f\f\f\n( ˆβgmm,ˆγgmm)\n∂ˆS ˜D,γ\n∂γ\n\f\f\f\f\n( ˆβgmm,ˆγgmm)\n\n\n.\nFor implementation, the partial derivatives corresponding to the phase function criterion are\ncalculated numerically. The estimated standard errors are given by the square root of the\ndiagonal elements of ( ˆP1 ˆΩ∗\nS ˆP ⊤\n1 )−1. In Section 4.3, we consider the performance of these\nestimated standard errors.\n4.\nSimulation studies\n4.1\nSimulation description\nThe ﬁnite-sample performance of the GMM estimators was evaluated using a simulation\nstudy.\nWe considered three diﬀerent settings for mutiple linear EIV models (2.1) where\neach observation has the same number of replicates, nj = nrep for j = 1, . . . , n, with nrep ∈\n{2, 3}. We chose sample sizes n ∈{250, 500, 1000} and generate M = 500 samples for each\nsimulation conﬁguration. A univariate linear EIV model was also considered in Section S4.1\nof the Supplementary Materials. Details of the simulation settings are given as follows:\n(I) A model with p = 2 error-prone and q = 0 error-free covariates. The true covariates\nwere generated from a Gaussian copula (Xue-Kun Song, 2000), where the two covariates\nhave scaled half-normal marginals with variance 1, i.e. Xjk\niid\n∼(1 −2/π)−1/2 \f\fN(0, 1)\n\f\f for\nk = 1, . . . , nrep, and correlation 0.5. Three distributions were considered for the measurement\nerror vectors Ujk, namely a bivariate normal, a bivariate t with 2.5 degrees of freedom, and\na contaminated bivariate normal Ujk ∼0.9 N(0, Σj) + 0.1 N(0, 102Σj). These distributions\nwere all scaled to have covariance matrices Σj for the replicates associated with the jth\nobservation, where Σj = DjRDj with Dj the marginal standard deviations and R the\ncorrelation matrix. We considered two choices of R, namely the identity matrix and a model\nwith common correlation ρ = 0.5 between all measurement error components. The diagonal\nelements of the matrix Dj were independently generated from the uniform distribution\n13\n√nj × U(\n√\n0.2,\n√\n1.5) by which the marginal signal-to-noise ratios Var(Xjk)/Var(Ujk) range\nfrom 2/3 (fairly weak signal) to 5 (fairly strong signal). The true model coeﬃcients were set\nto β0 = (1, 0.5)⊤and intercept γ0 = 2. The regression error εj was generated to match the\ndistribution of the measurement error in each scenario and with constant variance σ2\nε = 0.25\nfor j = 1, . . . , n.\n(II) A model with p = 2 error-prone and q = 2 error-free covariates, diﬀering from\nsetting I due to the inclusion of two error-free covariates.\nThe true covariates (Xj, Zj)\nwere generated to have scaled half-normal marginals with the joint structure speciﬁed by\na Gaussian copula with correlation 0.5 between each pair of predictors. The true model\ncoeﬃcients were β0 = (1, 0.5)⊤and γ0 = (2, 1, 0.5)⊤. All other conﬁgurations are equivalent\nto the speciﬁcations in setting I.\n(III) The model as in setting II, but the two error-free covariates were generated to be\nsymmetric having standard normal marginals. The predictor correlation structure was still\nspeciﬁed by a Gaussian copula with correlation parameter 0.5 between each pair of predictor\nvariables.\nAmong the three error distributions considering, the t2.5 does not have four ﬁnite mo-\nments. Consequently, asymptotic normality as per Theorem 2 does not hold in this case.\nHowever, the consistency requirements are still satisﬁed. We also note that setting III de-\nparts from Condition C4, allowing us to explore the eﬀect of symmetric predictors when\nusing the GMM method.\nFor each generated sample, we computed several diﬀerent estimators. Firstly, we com-\npute the true ordinary least squares (OLS) estimator which regresses yj on the true uncon-\ntaminated data (Xj, Zj), as well as a naive OLS estimator which regresses yj on (Wj, Zj)\nwith Wj denoting the averaged replicates for the jth observations. Next, we computed the\nmoment-corrected estimator with plug-in covariance matrices ˆΣj as per Section 2.2. Finally,\nwe computed three versions of the proposed GMM estimator, corresponding to an equal\nweighting scheme, the minimax weights, and the quasi-likelihood weights as per Section 3.2.\nFor the GMM estimators, covariance matrix ˆΩ∗\nS was estimated using B = 100 bootstrap\nsamples.\nA robust performance metric was adopted to evaluate estimator performance. Let θ0 =\n(β⊤\n0 , γ⊤\n0 )⊤be the true coeﬃcients, and ˆθ\n(m) = (ˆβ\n(m)⊤, ˆγ(m)⊤)⊤denote the estimators ob-\ntained using one of the outlined approaches in the mth generated sample, m = 1, . . . , M.\nTo remove outliers, we constructed the M × (p + q + 1) error matrix A with rows Am =\n(ˆθ\n(m) −θ)⊤. Next, we formed a vector of medians Amed by taking the median of each column\nof A. Then, we computed the Mahalanobis distance between each row of A and Amed using\nthe robust minimum covariance determinant estimator of Rousseeuw and Driessen (1999).\nFinally, we removed the rows with Mahalanobis distances larger than the 90th percentile\n14\nand calculate the robust mean square error matrix MSErob = ˜\nA⊤˜\nA/ ˜\nM where ˜\nA denotes the\nmatrix A with the outlier rows removed and ˜\nM is the number of rows in ˜\nA. The quantity\nMSErob is a robust estimator of E[(ˆθ −θ)⊤(ˆθ −θ)], and det(1000 × MSErob) is the reported\nperformance metric. We reported the determinant rather than the trace as it better accounts\nfor unequal variances for and correlations between estimated parameters. Smaller (larger)\nvalues of det(MSErob) indicate better (worse) performance of estimators in a square error\nloss sense.\n4.2\nSimulation results: Parameter recovery\nTables 1 and 2 present results for simulation settings I and II with nrep = 2; results with\nnrep = 3 and are presented in Section S4.2 of the Supplementary Materials and show similar\nconclusions. The true OLS estimator stands out with much smaller performance metrics\nthan those of the estimators computed using data with measurement error; note that this\ntrue estimator is not available in practice since the true covariates Xi’s are not observed.\nOn the other hand, the naive OLS estimator has the worst performance in all the settings,\nhighlighting the deleterious eﬀect of ignoring measurement error as well as the importance\nof measurement error correction. Next, we compare all the correction estimators. For the\nt2.5 and contaminated normal errors, all versions of the GMM estimator outperform the\nmoment-corrected estimator, often with signiﬁcant eﬃciency gains. For normally distributed\nerrors, the GMM estimators perform competitively compared to moment-correction. That\nbeing said, in the normal error scenarios, GMM occasionally performs worse than moment-\ncorrection; see Setting II. When comparing GMM weighting schemes, there is no clear supe-\nrior weighting scheme, but minimax and quasi-likelihood weights perform better than equal\nweighting for non-normal errors.\nTable 3 presents the results for setting III where the asymmetry condition C4 is violated,\nagain for the case with nrep = 2 replicates. The case with nrep = 3 replicates is summarized\nin Section S4.2 in the Supplementary Materials. Similar to other settings, there is little\ndiﬀerence in the performance between the moment-corrected estimator and the GMM esti-\nmator when the measurement error is Gaussian. However, we continue to note that GMM\nrepresents a substantive improvement over moment correction for contaminated normal and\nt2.5 error distributions. Also, in the latter two error settings, minimax and quasi-likelihood\nweights outperform equal weighting; neither of the latter two weighting scheme is clearly\npreferred.\nWe also note that across settings I through III, it is observed that the MSE metric for\nthe naive estimators also decreases as sample size increases. This is an artifact of the scaling\nused. The interested reader can easily verify that the MSE metric for the naive estimator\ndecreases at a much slower rate than the same metric for the MC and GMM estimators.\n15\nTable 1: Setting I performance of uncontaminated OLS (True), naive OLS (Naive), moment-\ncorrected (MC), and GMM estimators with equal (Equal), minimax (MM) and quasi-\nlikelihood (QL) weights with nrep = 2 as measured by det(1000 × MSErob).\nR\nU\nn\nTrue\nNaive\nMC\nGMM\nEqual\nMM\nQL\nρ = 0\nNormal\n250\n0.012\n9.799\n1.394\n1.040\n1.020\n1.102\n500\n0.001\n2.889\n0.240\n0.224\n0.222\n0.234\n1000\n0.000\n0.668\n0.026\n0.025\n0.027\n0.030\nt2.5\n250\n0.018\n11.413\n0.816\n0.576\n0.525\n0.593\n500\n0.001\n5.128\n0.134\n0.100\n0.075\n0.077\n1000\n0.000\n1.502\n0.021\n0.013\n0.011\n0.010\nCont.Normal\n250\n0.010\n17.965\n1.290\n0.693\n0.605\n0.556\n500\n0.001\n4.305\n0.149\n0.105\n0.077\n0.090\n1000\n0.000\n1.143\n0.022\n0.014\n0.009\n0.011\nρ = 0.5\nNormal\n250\n0.008\n27.999\n3.155\n2.698\n3.399\n2.953\n500\n0.001\n7.365\n0.355\n0.362\n0.378\n0.373\n1000\n0.000\n1.339\n0.037\n0.036\n0.038\n0.039\nt2.5\n250\n0.015\n34.374\n1.351\n0.643\n0.661\n0.730\n500\n0.001\n8.390\n0.211\n0.128\n0.112\n0.111\n1000\n0.000\n2.583\n0.026\n0.017\n0.016\n0.016\nCont.Normal\n250\n0.008\n45.002\n2.976\n1.405\n1.048\n1.228\n500\n0.001\n10.191\n0.287\n0.193\n0.120\n0.157\n1000\n0.000\n2.331\n0.034\n0.024\n0.015\n0.021\nIn conclusion, the GMM estimator has a competitive performance compared to the\nmoment-corrected estimator when the measurement errors are Gaussian. However, the rel-\native decrease in det(MSErob) is often so large for the heavier-tailed error distributions that\nsome would be willing to risk a small loss in eﬃciency were the error distribution closer to\na true normal. Furthermore, the two weighting schemes that account for heteroscedasticity\ntend to result in better estimators than the equal weighting.\n4.3\nSimulation results: Standard error estimation\nWe also performed a simulation study to examine the performance of the asymptotic covari-\nance estimator in estimating the standard errors of the GMM estimators. The data were\nsimulated from Settings I and III with the sample size n ∈{500, 1000}, the measurement\nerror Ujk following either a bivariate normal or bivariate t distribution with 2.5 degrees of\nfreedom, and the correlation matrix R having ρ = 0.5. We reported the Monte Carlo esti-\nmates of the true standard errors obtained from 500 simulated pairs ( ˆβgmm, ˆγgmm) obtained\nfrom independently generated datasets, as well as the average bootstrap plug-in standard\n16\nTable 2: Setting II performance of uncontaminated OLS (True), naive OLS (Naive), moment-\ncorrected (MC), and GMM estimators with equal (Equal), minimax (MM) and quasi-\nlikelihood (QL) weights with nrep = 2 as measured by det(1000 × MSErob).\nR\nU\nn\nTrue\nNaive\nMC\nGMM\nEqual\nMM\nQL\nρ = 0\nNormal\n250\n0.001\n19.898\n3.427\n4.418\n4.472\n3.763\n500\n0.000\n2.053\n0.145\n0.161\n0.203\n0.157\n1000\n0.000\n0.121\n0.003\n0.004\n0.004\n0.004\nt2.5\n250\n0.001\n24.749\n0.985\n0.751\n0.594\n0.574\n500\n0.000\n2.359\n0.087\n0.055\n0.052\n0.045\n1000\n0.000\n0.139\n0.001\n0.001\n0.001\n0.001\nCont.Normal\n250\n0.001\n13.924\n1.564\n1.200\n1.048\n0.793\n500\n0.000\n0.985\n0.043\n0.042\n0.038\n0.033\n1000\n0.000\n0.063\n0.002\n0.002\n0.001\n0.001\nρ = 0.5\nNormal\n250\n0.001\n83.078\n11.799\n11.058\n11.721\n12.045\n500\n0.000\n5.037\n0.266\n0.288\n0.332\n0.292\n1000\n0.000\n0.286\n0.007\n0.008\n0.009\n0.009\nt2.5\n250\n0.001\n81.873\n5.663\n3.799\n3.669\n4.338\n500\n0.000\n4.953\n0.130\n0.104\n0.097\n0.086\n1000\n0.000\n0.329\n0.003\n0.003\n0.003\n0.002\nCont.Normal\n250\n0.001\n71.486\n5.833\n3.522\n2.922\n2.260\n500\n0.000\n3.010\n0.150\n0.126\n0.105\n0.088\n1000\n0.000\n0.230\n0.004\n0.004\n0.003\n0.002\nerrors as deﬁned in Section 3.3 for the GMM estimators with the minimax weighting scheme\nˆqmm\nj\ndeﬁned in (3.10), while the results for other weighting schemes are similar and hence are\nomitted. Table 4 presents the results for nrep = 2, while the results for nrep = 3 are presented\nin Section S4.2 the Supplementary Materials. The average bootstrap plug-in standard errors\nare similar to the Monte Carlo standard error in all the considered settings, suggesting that\nthe bootstrap procedure in Section 3.3 provides a reliable estimator for the standard errors\nof the proposed GMM estimators.\n5.\nAnalysis of NHANES data\nThe National Health and Nutrition Examination Survey (NHANES) is a long-running re-\nsearch survey conducted by the National Center for Health Statistics (NCHS). The goal of\nthis longitudinal survey study is to assess the health and nutritional status of both adults\nand children in the United States, tracking the evolution of this status over time. Dur-\ning the 2009-2010 survey period, participants were interviewed and asked to provide their\n17\nTable 3:\nSetting III performance of uncontaminated OLS (True), naive OLS (Naive),\nmoment-corrected (MC), and GMM estimators with equal (Equal), minimax (MM) and\nquasi-likelihood (QL) weights with nrep = 2 as measured by det(1000 × MSErob).\nR\nU\nn\nTrue\nNaive\nMC\nGMM\nEqual\nMM\nQL\nρ = 0\nNormal\n250\n0.001\n10.963\n1.625\n1.623\n1.615\n1.623\n500\n0.000\n0.926\n0.069\n0.069\n0.068\n0.068\n1000\n0.000\n0.064\n0.002\n0.002\n0.002\n0.002\nt2.5\n250\n0.001\n11.607\n0.944\n0.936\n0.855\n0.890\n500\n0.000\n0.996\n0.041\n0.040\n0.032\n0.036\n1000\n0.000\n0.062\n0.001\n0.001\n0.001\n0.001\nCont.Normal\n250\n0.001\n12.622\n1.665\n1.663\n1.467\n1.572\n500\n0.000\n1.477\n0.068\n0.070\n0.066\n0.067\n1000\n0.000\n0.072\n0.002\n0.002\n0.001\n0.001\nρ = 0.5\nNormal\n250\n0.001\n54.053\n7.288\n7.162\n7.214\n7.338\n500\n0.000\n2.879\n0.147\n0.145\n0.147\n0.148\n1000\n0.000\n0.169\n0.004\n0.004\n0.004\n0.004\nt2.5\n250\n0.001\n41.193\n2.852\n2.782\n2.374\n2.524\n500\n0.000\n2.484\n0.078\n0.074\n0.067\n0.070\n1000\n0.000\n0.162\n0.002\n0.002\n0.002\n0.002\nCont.Normal\n250\n0.001\n65.616\n5.556\n5.552\n4.945\n5.375\n500\n0.000\n3.563\n0.144\n0.143\n0.130\n0.140\n1000\n0.000\n0.205\n0.004\n0.004\n0.004\n0.004\ndemographic background as well as information about nutrition habits. Participants also\nundertook a series of health examinations. To assess the nutritional habits of participants,\ndietary data were collected using two 24-hour recall interviews wherein the participants\nself-reported the consumed amount for a series of food items during the 24 hours prior to\neach interview. Based on these recalls, daily aggregated consumption of water, food energy,\nand other nutrition components such as total fat and total sugar consumption were com-\nputed. We used the 2009-2010 NHANES dietary data to illustrate our new GMM estimation\nprocedure.\nIn this illustrative analysis, we considered the relationship between participants’ BMI\n(outcome of interest) and their age as well as daily aggregates of energy, protein and fat\nconsumption. As these nutritional variables were calculated based on self-reported data,\nthey are well-known to be subject to measurement error.\nWe restricted our analysis to\nn = 1595 white women and treat the nutritional data from each of the interviews as nrep = 2\nindependently observed replicates. We ﬁtted the multiple linear EIV model to this data,\ntreating the nutritional quantities energy, protein, and fat consumption as error-prone co-\n18\nTable 4: Monte Carlo standard errors (MC-SE) and average of the bootstrap plug-in standard\nerrors (Avg-SE) for the GMM estimators with the minimax weighting scheme in simulation\nsettings I and III with nrep = 2 replicates and ρ = 0.5.\nSetting\nU\nCoeﬀ\nn = 500\nn = 1000\nMC-SE\nAvg-SE\nMC-SE\nAvg-SE\nI\nNormal\nˆβ1\n0.031\n0.030\n0.025\n0.022\nˆβ2\n0.031\n0.029\n0.023\n0.021\nˆγ00\n0.043\n0.044\n0.033\n0.032\nt2.5\nˆβ1\n0.029\n0.026\n0.021\n0.018\nˆβ2\n0.029\n0.026\n0.019\n0.019\nˆγ00\n0.038\n0.036\n0.028\n0.025\nIII\nNormal\nˆβ1\n0.037\n0.033\n0.021\n0.024\nˆβ2\n0.031\n0.031\n0.024\n0.022\nˆγ00\n0.055\n0.050\n0.038\n0.036\nˆγ1\n0.028\n0.027\n0.019\n0.020\nˆγ2\n0.029\n0.028\n0.019\n0.019\nt2.5\nˆβ1\n0.030\n0.028\n0.018\n0.021\nˆβ2\n0.029\n0.028\n0.019\n0.021\nˆγ00\n0.042\n0.043\n0.029\n0.032\nˆγ1\n0.024\n0.026\n0.019\n0.018\nˆγ2\n0.025\n0.024\n0.016\n0.018\nvariates with age considered an error-free covariate. Furthermore, all of these covariates\nwere standardized in the analysis. We computed the naive, moment-corrected, and GMM\nestimators, the latter with the three diﬀerent weighting schemes. We further reported the\nestimated standard errors for these estimators: The estimated standard errors for the naive\nestimators were obtained from the linear regression model of the outcome on all the observed\ncovariates, while the standard errors for the moment corrected estimators were calculated\nfrom the robust estimator given in Buonaccorsi (2010, Section 5.4). The estimated standard\nerrors for the GMM estimators were calculated in the same manner as in our simulation\nusing the asymptotic covariance and the bootstrap procedure.\nTable 5 demonstrates that the consequences of ignoring measurement error are apparent\n– the naive estimator exhibits dramatic attenuation for all the nutritional variables. On the\nother hand, the moment-corrected and GMM approaches all appear to correct for the bias as\nthe estimated coeﬃcients for energy, protein and fat intake are much larger in absolute terms.\nComparing the diﬀerent corrected estimators, we note the magnitude of the coeﬃcients\n19\nTable 5: NHANES study estimated coeﬃcients for naive, moment-corrected (MC) and GMM\nestimators with equal (Equal), minimax (MM), and quasi-likelihood weights (QL) weights.\nNaive\nMC\nGMM\nEqual\nMM\nQL\nIntercept\n26.39 (0.18)\n26.39 (0.18)\n26.63 (0.18)\n26.59 (0.18)\n26.56 (0.18)\nEnergy\n-0.86 (0.47)\n-2.3 (1.05)\n-2.7 (0.78)\n-2.59 (0.85)\n-2.49 (0.83)\nProtein\n1.29 (0.34)\n3.35 (1.03)\n3.56 (0.43)\n3.68 (0.49)\n3.54 (0.47)\nFat\n0.54 (0.43)\n1.03 (0.99)\n0.88 (0.57)\n0.89 (0.64)\n0.89 (0.59)\nAge\n3.92 (0.18)\n3.71 (0.19)\n3.82 (0.16)\n3.78 (0.16)\n3.79 (0.16)\ncorresponding to energy and protein are smaller for moment correction than for GMM. The\nreverse holds for the coeﬃcient corresponding to fat consumption. The eﬀect of age on BMI\nis similar across all the estimators, which can be explained by the low correlation between age\nand each of the nutritional variables (the correlations between age and the averaged energy,\nprotein, and fat intakes are -0.02, 0.10, and 0.03, respectively). Finally, the GMM estimators\ntend to have lower estimated standard errors than the moment-corrected estimators. This\npossibly reﬂects information contributions from the phase function beyond the ﬁrst two\nmoments.\n6.\nConclusion\nIn this paper, we have explored distribution-free solutions for parameter estimation in the\nlinear errors-in-variables model with heteroscedastic measurement errors across cases. The\nnewly proposed solution combines the popular moment-corrected estimator with a phase\nfunction-based estimator using a GMM framework. On the one hand, the proposed GMM\nestimator inherits estimating equations from the moment-corrected estimator and in this\nway is able to relax a strict asymmetry condition imposed on the covariates as in the phase\nfunction-based estimator proposed by Nghiem et al. (2020). On the other hand, the proposed\nGMM estimator inherits estimating equations from the phase function-based estimator that\nleverages the skewness of the true covariates if present, and introduces observation-speciﬁc\nweighting to account for the measurement error heteroscedasticity. Our simulation studies\nshow that when the measurement errors are normal, the GMM estimator is competitive with\nthe moment-corrected estimator. Nevertheless, when measurement errors are non-normal,\nthe GMM estimator has superior performance across all simulation settings considered, in-\ncluding ones where some covariates are symmetrically distributed.\nWe close by noting some future research that could be explored relating to this problem.\nFirstly, in the multivariate setting, the estimation of observation-level measurement error\n20\ncovariance matrices is a challenge. Some form of covariance regularization could be applied\nto further improve the estimation eﬃciency of the regression parameters. Secondly, the idea\nof a continuously-updating GMM treating the matrix ΩS as an explicit function of (β, γ)\ncan be explored. This could further improve estimator performance, but does increase the\ncomputational complexity of the problem. Finally, the development of tools for exploring\nand quantifying the skewness of the true covariates subject to symmetric measurement error\nwill help practitioners understand when the GMM approach is beneﬁcial.\n21\nSupplementary Materials\nS1.\nProof of Lemma 1\nIn this section, we provide proof of Lemma 1 from Section 3.1 in the main paper. For clarity,\nthe lemma is restated here. To this end, let θ = (β, γ) and recall that S(θ) = [S⊤\nL(θ), S⊤\n˜D(θ)]⊤\ndenotes the vector of gradient equations with SL(θ) the gradient vector of the corrected L2\nnorm L(θ) as deﬁned in Section 2.2, and with S ˜D(θ) the gradient of the phase function-based\nstatistic ˜D(θ) as deﬁned in Section 2.3 of the main paper. Let S0(θ) = limn→∞E[S(θ)]\ndenote the limiting expectation of the gradient equations. Subsequently, deﬁne\nQ0(θ) = S⊤\n0 (θ)Ω−1\nS S0(θ).\nLemma 1 now follows.\nLemma 2. Assume that all variables in the model have at least two ﬁnite moments. For\nθ ∈Θ ⊆Rp+q+1, the function Q(θ)\np→Q0(θ) uniformly.\nThe proof of Lemma 1 relies on establishing the conditions established in Lemma 2.9 of\nNewey and McFadden (1994). Speciﬁcally, the proof ﬁrst shows that function Q converges in\nprobability to Q0 for a ﬁxed value of θ and is continuously diﬀerentiable for all θ ∈Θ. Then,\nit establishes a Lipschitz condition that bounds the diﬀerence between Q at two arbitrary\nparameter values. This Lipschitz condition is crucial to show that Q converges uniformly\nin probability to Q0. Finally, the proof shows that S(θ) and ∇S(θ) = ∂S(θ)/∂θ converge\nuniformly to their limiting expected values.\nThus, the result from Newey & McFadden\napplies and the required uniform convergence of Q to Q0 follows.\nProof of Lemma 1. Consider the function Q(θ) = S⊤(θ)Ω−1\nS S(θ) and a ﬁxed value θ ∈Θ.\nThen, Q(θ)\nP→Q0(θ) by Slutsky’s theorem and the continuous mapping theorem. Moreover,\nQ(θ) is continuously diﬀerentiable for all θ ∈Θ. Thus, by the mean value theorem, for\nθ1, θ2 ∈Θ, we have\nQ(θ1) −Q(θ2) = ∇Q(θz)(θ1 −θ2),\nwhere ∇Q(θ) = ∂Q/∂θ and θz is a linear interpolant of θ1 and θ2. Applying the Cauchy-\nSchwarz inequality, we obtain\n|Q(θ1) −Q(θ2)| ≤∥∇Q(θz)∥∥θ1 −θ2∥.\nSubsequently, uniform convergence in probability will follow by by Lemma 2.9 of Newey and McFadden\n(1994) if we can establish the the Lipschitz condition that for some constants α > 0 and a\n22\nsequence Bn = Op(1) such that for θ1 and θ2, we have\n|Q(θ1) −Q(θ2)| ≤Bn∥θ1 −θ2∥α.\n(S1.12)\nObserve that equation (S1.12) will hold for α = 1 if ∥∇Q(θz)∥= Op(1).\nNow, by\ndeﬁnition ∇Q(θ) = 2[∇S(θ)]⊤Ω−1\nS S(θ) with ∇S(θ) = ∂S(θ)/∂θ a (p+q +1)×(p+q +1)\nmatrix of partial derivatives. By another application of the Cauchy-Schwarz inequality, we\nobtain\n∥∇Q(θz)∥≤cS∥∇S(θz)∥∥S(θz)∥≤cS sup\nθ∈Θ\n∥∇S(θ)∥· sup\nθ∈Θ\n∥S(θ)∥\nwhere cS is a constant depending only on ΩS and not on the arguments θ. Thus, it remains\nonly to be shown that S(θ) and ∇S(θ) converge uniformly to E[S(θ)] and E[∇S(θ)].\nTo this end, consider the components SL(θ) and ∇SL(θ). These functions are continuous\nfor all θ ∈Θ. Furthermore, provided the random variables (Xj, Zj), Uj, and εj used to\ndeﬁne Q have ﬁnite variances, there exists dominating functions dL,1(θ) and dL,2(θ) such\nthat ∥SL(θ)∥≤dL,1(θ) and ∥∇SL(θ)∥≤dL,2(θ) for all θ ∈Θ by a uniform law of large\nnumbers as in Hoadley (1971) or P¨otscher and Prucha (1989).\nNext, consider the component S ˜D(θ) and ∇S ˜D(θ). Again, these functions are continuous\nfor all θ ∈Θ. While slightly tedious, one can also verify that a dominating function d ˜D,1(θ)\nexists for S ˜D(θ) provided (Xj, Zj) and Uj have ﬁnite ﬁrst moments. Similarly, a dominating\nfunction d ˜D,2(θ) exists for ∇S ˜D(θ) provided (Xj, Zj) and Uj have ﬁnite second moments.\nAgain, by the same uniform law of large numbers, uniform convergence is achieved. Conse-\nquently, we have supθ∈Θ ∥S(θ)∥= Op(1) and supθ∈Θ ∥∇S(θ)∥= Op(1), the conditions of\nNewey and McFadden (1994) are satisﬁed, and the required uniform convergence of Q(θ) to\nQ0(θ) follows.\n23\nS2.\nProof of Theorem 1\nAs Q0(θ) is a positive deﬁnite quadratic form in terms of S0(θ), the global minimum occurs\nat a point θ∗if and only if S0(θ∗) = 0 for a unique value of θ∗. The proof of Theorem 1 thus\nrelies on showing that Q0(θ), the uniform-in-probability limit of Q(θ), has a unique global\nminimum at the true parameter values θ0 due to S0(θ) = 0 only when θ = θ0. Throughout\nthe proof, for any random variable V , we let φV (t) denote its characteristic function. For\nany complex number z, let Re(z) and Im(z) be its real and imaginary parts, respectively.\nProof of Theorem 1. By Lemma 1, the GMM objective function Q(θ) converges uniformly\nin probability to Q0(θ). For consistency of the estimators obtained by minimizing Q(θ), it\nsuﬃces to establish that limiting function Q0(θ) has a unique global minimum at the true\nparameter θ0 = (β0, γ0). This proof will separately consider the L2 norm and phase function\ncomponents contributing to Q(θ). Particularly, we will prove the two following statements:\nStatement 1: The ﬁrst p + q + 1 elements of S0(θ), which correspond to the estimating\nequations from the corrected L2 norm, has a unique solution at θ0.\nStatement 2: θ0 is always a solution to the last p + q + 1 elements of S0(θ), which\ncorrespond to the estimating equations from the phase function distance ˜D.\nGiven the two previous statements, Theorem 1 will follow immediately. Indeed, these\ntwo statements imply that θ0 is the unique solution for S0(θ) = 0 as a whole. This also\nestablishes that Q0(θ0) = 0, meaning Q0(θ) has a unique global minimum of zero at θ0. As\na result, the estimator ˆθ that minimizes Q(θ) is consistent for θ0.\nHence it remains to prove the two statements, and we will do it in two separate subsec-\ntions.\nS2.1\nProof of Statement 1\nConsider ﬁrst the corrected L2 norm function with estimating equations SL(θ) = [SL,β(θ)⊤, SL,γ(θ)⊤]⊤\nas deﬁned in equation (2.3) of the main paper with\nSL,β(θ) = −2\nn\nn\nX\nj=1\nWj\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u0001\n−2\nn\nn\nX\nj=1\n1\nnj\nΣj β,\nSL,γ(θ) = −2\nn\nn\nX\nj=1\nZj\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u0001\n.\n24\nThe expected values E[SL,β(θ)] and E[SL,γ(θ)] are found by evaluating the conditional ex-\npectations of the component summands. For SL,β(θ), we have\nE\nh\nWj\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u0001\f\f\f Xj, Zj\ni\n= E\nh\u0000Xj + Uj\n\u0001\u0000X⊤\nj β0 + Z⊤\nj γ0 +εj −X⊤\nj β −Z⊤\nj γ −U⊤\nj β\n\u0001\f\f\f Xj, Zj\ni\n(i)= Xj X⊤\nj\n\u0000β0 −β\n\u0001\n+ Xj Z⊤\nj\n\u0000γ0 −γ\n\u0001\n−n−1\nj\nΣj β,\nwhere step (i) follows from the independence of Uj and (Xj, Zj), as well as noting that\nE\n\u0002\nUj U⊤\nj\n\u0003\n= n−1\nj\nΣj. Similarly, for SL,γ(θ), we have\nE\nh\nZj\n\u0000yj −W⊤\nj β −Z⊤\nj γ\n\u0001\f\f\f Xj, Zj\ni\n= Zj X⊤\nj\n\u0000β0 −β\n\u0001\n+ Zj Z⊤\nj\n\u0000γ0 −γ\n\u0001\n.\nLetting (X, Z) denote an independent copy of (Xj, Zj), we have\nE[SL,β(θ)] = −2 E\n\u0002\nX X⊤\u0003\u0000β0 −β\n\u0001\n−2 E\n\u0002\nX Z⊤\u0003\u0000γ0 −γ\n\u0001\nE[SL,γ(θ)] = −2 E\n\u0002\nZ X⊤\u0003\u0000β0 −β\n\u0001\n−2 E\n\u0002\nZ Z⊤\u0003\u0000γ0 −γ\n\u0001\n.\nAs a consequence of Lemma 1, SL,β(θ) and SL,γ(θ) converge uniformly to E[SL,β(θ)] and\nE[SL,γ(θ)], the ﬁrst p + q + 1 components of S0(θ). It is straightforward to see that the\ncorresponding system of equations\nE[SL,β(θ)] = 0\nand\nE[SL,γ(θ)] = 0\nhas a unique solution at θ = θ0 = (β0, γ0).\nS2.2\nProof of Statement 2\nConsider next the phase function-based criterion ˜D(θ) directly. From Lemma 1, we have\nthe uniform convergence of ˜D(θ) to a limiting function D0(θ). We will now evaluate this\nlimiting function. Recall that\n˜D(θ) =\nZ t∗\n0\n \nCy(t)\n\" n\nX\nj=1\nqj sin\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\n#\n−Sy(t)\n\" n\nX\nj=1\nqj cos\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\n# !2\nKt∗(t)dt.\n(S2.13)\n25\nLet V0 = X⊤β0 + Z⊤γ0 and Y = V0 + ε. For arbitrary t, by the weak law of large numbers,\nCy(t) = 1\nn\nn\nX\nj=1\ncos(yjt)\np→E [cos(Y t)] = Re[φY (t)] = Re[φV0(t)]φε(t),\nwhere the last equality follows upon noting that ε has a real-valued characteristic function.\nSimilarly, Sy(t)\np→Im[φV0(t)]φε(t). Furthermore, noting that for any θ, the random variables\nsin\n\u0002\nt(W⊤\nj β + Z⊤\nj γ)\n\u0003\nand cos\n\u0002\nt(W⊤\nj β + Z⊤\nj γ)\n\u0003\nare bounded, and subsequently have ﬁnite\nvariances. By a generalized weak law of large numbers,\nn\nX\nj=1\nqj sin\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001 \t\np→E\n\" n\nX\nj=1\nqj sin\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\n#\n.\nLetting Vj(β, γ) = X⊤\nj β + Z⊤\nj γ, we have\nE\n\u0002\nsin\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\u0003\n= Im\n\b\nφVj(β,γ)(t)\n\t\nφU⊤\nj β(t),\nwhere we make use of the fact that U⊤\nj β has a symmetric distribution about zero and hence\na real-valued characteristic function. Since (Xj, Zj) are iid by Condition C1, the random\nvariables Vj(β, γ), j = 1, . . . , n are also iid and have a common characteristic function\nφV (β,γ)(t) = φVj(β,γ)(t) for j = 1, . . . , n. As a consequence, we have\nE\n\" n\nX\nj=1\nqj sin\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\n#\n= Im\n\b\nφV (β,γ)(t)\n\t\n n\nX\nj=1\nqjφU⊤\nj β(t)\n!\n.\nSimilarly,\nE\n\" n\nX\nj=1\nqj cos\n\b\nt\n\u0000W⊤\nj β + Z⊤\nj γ\n\u0001\t\n#\n= Re\n\b\nφV (β,γ)(t)\n\t\n n\nX\nj=1\nqjφU⊤\nj β(t)\n!\n.\nLetting h(t, β) = φε(t)2 hPn\nj=1 qjφU⊤\nj β(t)\ni2\n, and recalling the established uniform conver-\ngence for (β, γ) ∈Θ, the statistic ˜D(θ) converges uniformly to\nD0(θ) =\nZ t∗\n0\nh\nRe {φV0 (t)} Im\n\b\nφV (β,γ)(t)\n\t\n−Im {φV0(t)} Re\n\b\nφV (β,γ)(t)\n\t i2\nh(t, β)Kt∗(t)dt\n=\nZ t∗\n0\nh\nIm{φV0−V (β,γ)(t)}\ni2\nh(t, β)Kt∗dt,\n26\nwhere random variables V0 and V (β, γ) are independent. Note that\nIm\n\b\nφV0−V (β,γ)(t)\n\t\n= 0 for all t ∈R\nif and only if the distribution of V0 −V (β, γ) is symmetric about 0. When Condition C4\nholds, this is only true for θ = θ0 = (β0, γ0). On the other hand, when Condition C4\ndoes not hold, D0(θ) may have inﬁnitely many global minima, but one of those minima still\noccurs at θ = θ0.\nWe conclude by noting that ˜D(θ) is continuous, as is the gradient vector ∇˜D(θ) =\n∂˜D(θ)/∂θ. From Lemma 1, it subsequently follows that ∇˜D(θ) also converges uniformly\nto ∇D0(θ). Thus, ∇D0(θ0) = 0, even though this is not a unique solution to this system\nof equations. Note also that ∇D0(θ0) represents the last p + q + 1 elements of S0(θ). The\nproof is now complete.\nS3.\nCalculating the Quasi-Likelihood Weights\nThe quasi-likelihood weights are deﬁned in Section 3.2 of the main paper to be the minimizer\nof the L2 discrepancy\nL(q) =\nn\nX\nj=1\n(Wj −ˆµq)⊤\u0000Σx + n−1\nj Σj\n\u0001−1 (Wj −ˆµq)⊤,\nwhere ˆµq = Pn\nj=1 qj Wj, subject to qj ≥0, j = 1, . . . , n and Pn\nj=1 qj = 1. To ﬁnd the\nminimizer, let Ωj = Σx + n−1\nj Σj for j = 1, . . . , n. Some algebraic manipulation gives\nL(q) =\nn\nX\nj=1\nW⊤\nj Ω−1\nj\nWj −ˆµ⊤\nq\n n\nX\nj=1\nΩ−1\nj\nWj\n!\n−\n n\nX\nj=1\nW⊤\nj Ω−1\nj\n!\nˆµq + ˆµ⊤\nq\n n\nX\nj=1\nΩ−1\nj\n!\nˆµq.\nNote that L(q) is a function of q only through ˆµq. To calculate the weights, we deﬁne the\nfunction D(q) to be only the terms in L(q) involving ˆµq, and also introducing two Lagrange-\nmultiplier type terms. The ﬁrst of these ensures the weights qj sum to 1, while the second\nensures a numerically stable solution by constraining the squared diﬀerences between the qj.\n27\nThe resulting function to be minimized is\nD(q, λ)\n=\n−ˆµ⊤\nq\n n\nX\nj=1\nΩ−1\nj\nWj\n!\n−\n n\nX\nj=1\nW⊤\nj Ω−1\nj\n!\nˆµq + ˆµ⊤\nq\n n\nX\nj=1\nΩ−1\nj\n!\nˆµq\n+2λ\n n\nX\nj=1\nqj −1\n!\n+ γ\nX\nj,k\n(qj −qk)2.\nThis function is minimized over (q, λ), while γ is a user-speciﬁed constant ensuring a nu-\nmerically stable solution. Now, deﬁning\nA1 =\nn\nX\nj=1\nΩ−1\nj\nWj\nand\nA2 =\nn\nX\nj=1\nΩ−1\nj\nthe target function can be written in the convenient form\nD(q, λ) = −2ˆµ⊤\nq A1 + ˆµ⊤\nq A2 ˆµq + 2λ\n n\nX\nj=1\nqj −1\n!\n+ γ\nX\ni,j\n(qi −qj)2.\nThis function is quadratic in (q, λ) with a global minimum that can be found by solving\na linear system of equations. Taking partial derivatives of with respect to the qk, for k =\n1, . . . , n, we have estimating equations\n∂D\n∂qk\n= −2V⊤\nk A1 + 2V⊤\nk A2 ˆµq + 2λ + 2γ\nX\nj̸=k\n(qk −qj) = 0.\nHere, Vk denotes a n × 1 column vector of zeros, with the kth entry equal to 1. Writing\nthese estimating equations explicitly in terms of the weights q gives\n−V⊤\nk A1 +\nn\nX\nj=1\nqj\n\u0000V⊤\nk A2Vj\n\u0001\n+ λ + γ\nX\nj̸=k\n(qk −qj) = 0, k = 1, . . . , n.\nThe minimizer of D(q, λ) is found by solving the linear system\n\n\n\n\n\n\n\n\nV⊤\n1 A2V1 + (n −1)γ\nV⊤\n1 A2V2 −γ\n· · ·\nV⊤\n1 A2Vn −γ\n1\nV⊤\n2 A2V1 −γ\nV⊤\n2 A2V2 + (n −1)γ\n· · ·\nV⊤\n2 A2Vn −γ\n1\n...\n...\n...\n...\n...\nV⊤\nn A2V1 −γ\nV⊤\nn A2X2 −γ\n· · ·\nV⊤\nn A2Vn + (n −1)γ\n1\n1\n1\n· · ·\n1\n0\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nq1\nq2\n...\nqn\nλ\n\n\n\n\n\n\n\n\n=\n\n\n\n\n\n\n\n\nV⊤\n1 A1\nV⊤\n2 A1\n...\nV⊤\nn A1\n1\n\n\n\n\n\n\n\n\n.\nNumerical exploration suggests the solution ˆq of this system, which is easily obtained\n28\nnumerically, is fairly robust with regards to the speciﬁc choice of γ. In a simulation study not\nreported here, the choices γ = 1/n and γ = log(n) resulted in nearly identical estimators of\nthe observation-speciﬁc weights. Furthermore, any value of γ > 0 resulted in a numerically\nstable system to solve. We therefore use γ = 1/n in the remainder of the paper.\nS4.\nAdditional Simulation Results\nS4.1\nSimulation for simple linear EIV models\nIn this section, we report a set of simulation results for the simple errors-in-variables model\nyj = γ + βXj + ǫj, Wjk = Xj + Ujk for j = 1, . . . , n and k = 1, . . . , nrep. In this setting, the\ntrue covariates Xj are generated from the half-normal distribution scaled to have variance\n1, i.e. Xj\niid\n∼(1 −2/π)−1/2 \f\fN(0, 1)\n\f\f. Three scenarios are considered for the distribution of\nthe measurement error terms, namely normal, Ujk ∼N(0, σ2\nj), Student’s t with 2.5 degrees\nof freedom, Ujk ∼σj/\n√\n5 t2.5, and a contaminated normal, Ujk ∼σj/\n√\n10.9{0.9N(0, 1) +\n0.1N(0, 102)}. In each scenario, the Ujk are generated independently, have mean 0, and are\nscaled to have Var(Ujk) = σ2\nj for k = 1, . . . , nrep. In all the three scenarios, the measurement\nerror variances σ2\nj are generated from the uniform distribution nrep×U(0.2, 1.5), so the signal-\nto-noise ratio Var(Xj)/Var(Uj) for the averaged replicate measurement error Uj ranges from\n2/3 (fairly weak signal) to 5 (fairly strong signal). The true intercept and slope are set to\nbe γ00 = 2 and β = 1, respectively. The regression error ǫj’s are generated to match the\ndistribution of the measurement error in each scenario and with constant variance σ2\nε = 0.25.\nFor each generated sample, we compute the same set of estimators and used the same\ncriterion det(MSErob) as described in Section 4.2 of the main paper. Note that in the simple\nlinear EIV model, the two heteroscedastic weighting schemes (minimax and quasi-likelihood)\nresult in the same estimates. Table 6 summarizes the results.\nIt comes as no surprise that the naive estimator has the worst performance among the\nestimators considered. The large values observed demonstrate the consequences of ignoring\nmeasurement errors when they are present. When considering the various corrected esti-\nmators, the GEE estimators outperform the moment-corrected approach regardless of the\nweighting scheme used. The improvement of GMM estimators over moment correction is\nespecially pronounced in contaminated normal error scenario, with the t2.5 error scenario\nalso showing some large decreases in estimation error. These cases illustrate the value of\ncombining moment correction with the phase function-based approach. When comparing\nthe two GMM weighting schemes, the estimator with quasi-likelihood weights also outper-\nforms the equal weights estimator in almost all cases. The only exceptions occur under the\nnormal measurement error model, where equal weighting in two instances performs better\nthan quasi-likelihood weighting.\n29\nTable 6: Simple Linear EIV model performance naive OLS (Naive), moment-corrected (MC),\nand GMM estimators with equal (Equal), minimax (MM) and quasi-likelihood (QL) weights\nwith nrep ∈{2, 3} as measured by det(1000 × MSErob).\nU\nn\nnrep = 2\nnrep = 3\nNaive\nMC\nGMM\nNaive\nMC\nGMM\nEqual\nQL\nEqual\nQL\nNormal\n250\n381.98\n29.58\n26.80\n25.80\n397.80\n28.47\n25.08\n25.24\n500\n181.67\n9.44\n6.21\n6.65\n160.34\n8.13\n6.52\n6.10\n1000\n88.78\n2.13\n1.63\n1.56\n90.83\n1.80\n1.40\n1.40\nt2.5\n250\n263.14\n20.89\n10.56\n8.74\n322.03\n17.25\n9.32\n7.99\n500\n128.75\n5.66\n2.29\n1.90\n143.20\n3.75\n2.05\n1.60\n1000\n87.26\n1.44\n0.52\n0.42\n72.70\n1.27\n0.49\n0.36\nCont.Normal\n250\n19.96\n22.19\n2.18\n1.97\n20.05\n12.25\n1.94\n1.26\n500\n44.30\n15.28\n0.98\n0.66\n46.25\n11.49\n0.90\n0.48\n1000\n98.12\n14.27\n0.75\n0.48\n90.87\n12.58\n0.66\n0.37\nS4.2\nAdditional results for multiple linear EIV models\nIn this section, we summarize simulation results equivalent to those in Section 4.2 of the\nmain paper. Tables S2 through S4 are analogous to Tables 1 through 3, but with nrep = 3\nwhereas the main paper presents results for nrep = 2. For greater speciﬁcity regarding the\nsimulation conﬁgurations, see the descriptions in Section 4.2 of the main paper. We note here\nhere that similar conclusions can be drawn for the case with nrep = 3 replicates. Speciﬁcally,\nwhen the measurement error follows a t2.5 or contaminated normal distribution, the GMM\nestimators outperform moment correction. On the other hand, when the measurement error\nfollows a normal distribution, there isn’t a clear preference for either the moment corrected\nor GMM estimators, each in turn outperforming the other. Finally, Table S5 is analogous to\nTable 4 of the main paper, showing the accuracy with which the standard error is estimated\nfor the model parameters.\n30\nTable 7: Setting I performance of uncontaminated OLS (True), naive OLS (Naive), moment-\ncorrected (MC), and GMM estimators with equal (Equal), minimax (MM) and quasi-\nlikelihood (QL) weights with nrep = 3 as measured by det(1000 × MSErob).\nR\nU\nn\nTrue\nNaive\nMC\nGMM\nEqual\nMM\nQL\nρ = 0\nNormal\n250\n0.010\n14.237\n1.565\n2.082\n2.023\n2.087\n500\n0.001\n3.385\n0.188\n0.182\n0.180\n0.180\n1000\n0.000\n0.944\n0.028\n0.029\n0.031\n0.030\nt2.5\n250\n0.012\n20.132\n1.827\n0.967\n0.805\n0.802\n500\n0.001\n4.778\n0.108\n0.075\n0.072\n0.071\n1000\n0.000\n1.364\n0.018\n0.014\n0.012\n0.012\nCont.Normal\n250\n0.009\n13.100\n1.009\n0.853\n0.650\n0.676\n500\n0.001\n3.744\n0.128\n0.100\n0.073\n0.080\n1000\n0.000\n1.036\n0.017\n0.015\n0.012\n0.013\nρ = 0.5\nNormal\n250\n0.009\n34.094\n2.511\n3.097\n2.892\n2.771\n500\n0.001\n6.323\n0.286\n0.252\n0.274\n0.253\n1000\n0.000\n1.715\n0.042\n0.042\n0.044\n0.042\nt2.5\n250\n0.008\n39.974\n2.152\n1.134\n1.004\n1.129\n500\n0.001\n8.377\n0.166\n0.105\n0.108\n0.111\n1000\n0.000\n3.272\n0.027\n0.020\n0.017\n0.019\nCont.Normal\n250\n0.009\n41.149\n2.271\n1.761\n1.400\n1.475\n500\n0.001\n10.698\n0.311\n0.241\n0.157\n0.191\n1000\n0.000\n2.413\n0.035\n0.027\n0.019\n0.023\n31\nTable 8: Setting II performance of uncontaminated OLS (True), naive OLS (Naive), moment-\ncorrected (MC), and GMM estimators with equal (Equal), minimax (MM) and quasi-\nlikelihood (QL) weights with nrep = 3 as measured by det(1000 × MSErob).\nR\nU\nn\nTrue\nNaive\nMC\nGMM\nEqual\nMM\nQL\nρ = 0\nNormal\n250\n0.001\n34.108\n2.509\n2.777\n2.673\n2.403\n500\n0.000\n1.716\n0.096\n0.108\n0.122\n0.108\n1000\n0.000\n0.089\n0.002\n0.003\n0.003\n0.003\nt2.5\n250\n0.002\n13.080\n1.388\n1.133\n0.814\n0.746\n500\n0.000\n2.394\n0.051\n0.042\n0.036\n0.034\n1000\n0.000\n0.255\n0.002\n0.001\n0.002\n0.001\nCont.Normal\n250\n0.001\n18.461\n1.571\n1.483\n1.460\n1.041\n500\n0.000\n1.495\n0.055\n0.055\n0.055\n0.036\n1000\n0.000\n0.057\n0.001\n0.001\n0.001\n0.001\nρ = 0.5\nNormal\n250\n0.001\n51.039\n9.331\n14.770\n18.866\n14.313\n500\n0.000\n4.915\n0.234\n0.266\n0.291\n0.257\n1000\n0.000\n0.336\n0.009\n0.010\n0.011\n0.011\nt2.5\n250\n0.002\n92.843\n6.001\n3.647\n2.989\n2.726\n500\n0.000\n5.910\n0.143\n0.105\n0.104\n0.090\n1000\n0.000\n0.648\n0.006\n0.004\n0.003\n0.003\nCont.Normal\n250\n0.001\n60.581\n4.318\n3.805\n3.496\n2.731\n500\n0.000\n4.936\n0.150\n0.149\n0.128\n0.094\n1000\n0.000\n0.296\n0.005\n0.004\n0.004\n0.003\n32\nTable 9:\nSetting III performance of uncontaminated OLS (True), naive OLS (Naive),\nmoment-corrected (MC), and GMM estimators with equal (Equal), minimax (MM) and\nquasi-likelihood (QL) weights with nrep = 3 as measured by det(1000 × MSErob).\nR\nU\nn\nTrue\nNaive\nMC\nGMM\nEqual\nMM\nQL\nρ = 0\nNormal\n250\n0.001\n14.862\n1.997\n1.972\n1.964\n1.976\n500\n0.000\n0.789\n0.043\n0.043\n0.043\n0.043\n1000\n0.000\n0.042\n0.001\n0.001\n0.001\n0.001\nt2.5\n250\n0.001\n13.456\n1.132\n1.087\n0.978\n1.056\n500\n0.000\n0.837\n0.022\n0.022\n0.020\n0.020\n1000\n0.000\n0.118\n0.001\n0.001\n0.001\n0.001\nCont.Normal\n250\n0.001\n21.877\n2.346\n2.379\n2.159\n2.282\n500\n0.000\n1.116\n0.053\n0.053\n0.049\n0.052\n1000\n0.000\n0.055\n0.002\n0.002\n0.001\n0.001\nρ = 0.5\nNormal\n250\n0.001\n51.724\n4.557\n4.554\n4.543\n4.555\n500\n0.000\n3.059\n0.145\n0.145\n0.145\n0.145\n1000\n0.000\n0.180\n0.005\n0.005\n0.005\n0.005\nt2.5\n250\n0.001\n32.805\n2.819\n2.777\n2.470\n2.635\n500\n0.000\n2.937\n0.081\n0.076\n0.069\n0.070\n1000\n0.000\n0.354\n0.003\n0.003\n0.003\n0.003\nCont.Normal\n250\n0.001\n44.184\n4.592\n4.594\n4.243\n4.462\n500\n0.000\n3.465\n0.149\n0.149\n0.135\n0.145\n1000\n0.000\n0.205\n0.004\n0.005\n0.004\n0.004\n33\nTable 10: Monte Carlo standard errors (MC-SE) and average of average of the bootstrap\nplug-in standard errors (Avg-SE) for the GMM estimators with the minimax weighting\nscheme in simulation settings I and III with nrep = 3 replicates and ρ = 0.5.\nSetting\nU\nCoeﬀ\nn = 500\nn = 1000\nMC-SE\nAvg-SE\nMC-SE\nAvg-SE\nII\nNormal\nˆβ1\n0.030\n0.029\n0.021\n0.021\nˆβ2\n0.028\n0.029\n0.022\n0.021\nˆγ00\n0.043\n0.044\n0.031\n0.031\nt2.5\nˆβ1\n0.023\n0.026\n0.022\n0.019\nˆβ2\n0.027\n0.025\n0.019\n0.019\nˆγ00\n0.035\n0.036\n0.027\n0.025\nIV\nNormal\nˆβ1\n0.036\n0.033\n0.021\n0.022\nˆβ2\n0.032\n0.030\n0.021\n0.022\nˆγ00\n0.061\n0.049\n0.037\n0.035\nˆγ1\n0.026\n0.027\n0.020\n0.019\nˆγ2\n0.028\n0.028\n0.019\n0.019\nt2.5\nˆβ1\n0.029\n0.032\n0.020\n0.021\nˆβ2\n0.027\n0.027\n0.020\n0.020\nˆγ00\n0.043\n0.046\n0.032\n0.030\nˆγ1\n0.028\n0.026\n0.022\n0.018\nˆγ2\n0.029\n0.025\n0.016\n0.018\n34\nReferences\nBuonaccorsi, J. P. (2010). Measurement Error: Models, Methods, and Applications. CRC\npress.\nCarroll, R. J., Ruppert, D., Stefanski, L. A., and Crainiceanu, C. M. (2006). Measurement\nError in Nonlinear Models: A Modern Perspective. Chapman and Hall/CRC.\nCarroll, R. J. and Stefanski, L. A. (1990). Approximate quasi-likelihood estimation in models\nwith surrogate predictors. Journal of the American Statistical Association, 85(411):652–\n663.\nDelaigle, A. and Hall, P. (2016). Methodology for non-parametric deconvolution when the\nerror distribution is unknown. Journal of the Royal Statistical Society: Series B: Statistical\nMethodology, pages 231–252.\nErickson, T., Jiang, C. H., and Whited, T. M. (2014). Minimum distance estimation of\nthe errors-in-variables model using linear cumulant equations. Journal of Econometrics,\n183(2):211–221.\nGillard, J. (2014). Method of moments estimation in linear regression with errors in both\nvariables. Communications in Statistics-Theory and Methods, 43(15):3208–3222.\nHanfelt, J. J. and Liang, K.-Y. (1997). Approximate likelihoods for generalized linear errors-\nin-variables models. Journal of the Royal Statistical Society: Series B (Statistical Method-\nology), 59(3):627–637.\nHansen, L. P. (1982). Large sample properties of generalized method of moments estimators.\nEconometrica: Journal of the Econometric Society, pages 1029–1054.\nHansen, L. P., Heaton, J., and Yaron, A. (1996). Finite-sample properties of some alternative\ngmm estimators. Journal of Business & Economic Statistics, 14(3):262–280.\n35\nHigdon, R. and Schafer, D. W. (2001). Maximum likelihood computations for regression\nwith measurement error. Computational Statistics & Data Analysis, 35(3):283–299.\nHoadley, B. (1971). Asymptotic properties of maximum likelihood estimators for the inde-\npendent not identically distributed case. The Annals of Mathematical Statistics, pages\n1977–1991.\nHu, F. and Kalbﬂeisch, J. D. (1997).\nEstimating equations and the bootstrap.\nLecture\nNotes-Monograph Series, pages 405–416.\nNewey, W. K. and McFadden, D. (1994). Chapter 36: Large sample estimation and hypoth-\nesis testing. Handbook of Econometrics, 4:2111–2245.\nNghiem, L. and Potgieter, C. J. (2018). Density estimation in the presence of heteroscedastic\nmeasurement error of unknown type using phase function deconvolution.\nStatistics in\nMedicine, 37(25):3679–3692.\nNghiem, L. H., Byrd, M. C., and Potgieter, C. J. (2020). Estimation in linear errors-in-\nvariables models with unknown error distribution. Biometrika, 107(4):841–856.\nP¨otscher, B. M. and Prucha, I. R. (1989). A uniform law of large numbers for dependent and\nheterogeneous data processes. Econometrica: Journal of the Econometric Society, pages\n675–683.\nReiersøl, O. (1941). Conﬂuence analysis by means of lag moments and other methods of\nconﬂuence analysis. Econometrica: Journal of the Econometric Society, pages 1–24.\nRousseeuw, P. J. and Driessen, K. V. (1999). A fast algorithm for the minimum covariance\ndeterminant estimator. Technometrics, 41(3):212–223.\nSong, W. (2021).\nNonparametric inference methods for berkson errors.\nIn Handbook of\nMeasurement Error Models, pages 271–292. Chapman and Hall/CRC.\n36\nStefanski, L. A. and Carroll, R. J. (1987). Conditional scores and optimal scores for gener-\nalized linear measurement-error models. Biometrika, 74(4):703–716.\nStefanski, L. A. and Cook, J. R. (1995). Simulation-extrapolation: the measurement error\njackknife. Journal of the American Statistical Association, 90(432):1247–1256.\nWald, A. (1940). The ﬁtting of straight lines if both variables are subject to error. The\nAnnals of Mathematical Statistics, 11(3):284–300.\nXue-Kun Song, P. (2000). Multivariate dispersion models generated from gaussian copula.\nScandinavian Journal of Statistics, 27(2):305–320.\n37\n"}