{"text": "arXiv:2411.01686v2  [stat.ME]  5 Nov 2024\nFRODO: A novel approach to micro-macro\nmultilevel regression\nNovember 6, 2024\nShaun McDonald (Corresponding Author)1\nAlexandre Leblanc2\nSaman Muthukumarana2\nDavid Campbell3\nAbstract\nWithin the ﬁeld of hierarchical modelling, little attention is paid to\nmicro-macro models: those in which group-level outcomes are dependent\non covariates measured at the level of individuals within groups. Although\nsuch models are perhaps underrepresented in the literature, they have ap-\nplications in economics, epidemiology, and the social sciences.\nDespite\nthe strong mathematical similarities between micro-macro and measure-\nment error models, few eﬀorts have been made to apply the much better-\ndeveloped methodology of the latter to the former. Here, we present a\nnew empirical Bayesian technique for micro-macro data, called FRODO\n(Functional Regression On Densities of Observations). The method jointly\ninfers group-speciﬁc densities for multilevel covariates and uses them as\nfunctional predictors in a functional linear regression, resulting in a model\nthat is analogous to a generalized additive model (GAM). In doing so,\nit achieves a level of generality comparable to more sophisticated meth-\nods developed for errors-in-variables models, while further leveraging the\nlarger group sizes characteristic of multilevel data to provide richer infor-\nmation about the within-group covariate distributions. After explaining\nthe hierarchical structure of FRODO, its power and versatility are demon-\nstrated on several simulated datasets, showcasing its ability to accommo-\ndate a wide variety of covariate distributions and regression models.\n1Department of Statistics and Actuarial Science, Simon Fraser Univesity, 8888 University\nDrive, Burnaby, V5A 1S6, British Columbia, Canada. drshaunmcdonald at gmail dot com\n2Department of Statistics, University of Manitoba, 66 Chancellors Circle, Winnipeg, R3T\n2N2, Manitoba, Canada. alex.leblanc at umanitoba dot ca, saman.muthukumarana at uman-\nitoba dot ca\n3School of Mathematics and Statistics, Carleton University, 1125 Colonel By Drive, Ot-\ntawa, K1S 5B6, Ontario, Canada. davecampbell at math dot carleton dot ca\n1\n1\nIntroduction\nHierarchically structured data is quite common in statistics, with a litany\nof resources and methodology available for almost every imaginable conﬁg-\nuration. Books such as [18] provide comprehensive reviews on the subject\nof multilevel data. For the purposes of this manuscript, it will suﬃce to\nconsider data organized in a two-level hierarchy. Data will be observed\nfrom “groups”, each of which is comprised of multiple “individuals”, with\nvariables measured at either the group level (i.e. one measurement per\ngroup) or individual level (i.e. one measurement for each individual within\neach group).\nMultilevel data structures can be broadly categorized into two types:\nmacro-micro, in which an individual-level outcome is predicted from group-\nlevel covariates; and micro-macro, which is the opposite [39]. Although\nsubstantial attention has been given to the former structure (random\neﬀects models being one example of the macro-micro framework), the\nmicro-macro paradigm is the subject of much less discussion [14], despite\nthe occurrence of such datasets in health sciences [12], sociology [3], and\neconomics [2]. Among the relatively few papers on the subject is the one\nby Croon and van Veldhoven [11], one of the earliest papers to devise a\nmethod speciﬁcally for micro-macro regression. The data structure they\nconsidered (hereafter described as “classical”) is as follows. Letting sub-\nscripts i and ij denote, respectively, the ith group and the jth individual\nwithin that group, the basic structure is\nYi = α + βξi + βZZi + ǫi,\n(1)\nXij = ξi + νij.\n(2)\nAssuming group i contains ni individuals, the observed data correspond-\ning to that group is {Yi, Zi, Xi1, . . . , Xini}. In words, Yi is a group-level\nresponse variable (with regression error ǫi), Zi is a group-level scalar co-\nvariate, and the Xij’s are individual-level measurements of some “latent”\nunobserved covariate ξi with errors νij. One can think of the model as\ntwo “parts”: a regression part speciﬁed by (1), and a covariate observa-\ntion part speciﬁed by (2). The linearity of the regression and additivity\nof the covariate error justify the “classical” moniker for this structure.\nAlthough micro-macro modelling literature is relatively scarce, the\nstructure implied by (1–2) is essentially equivalent to (a version of) the\nmuch better-studied classical measurement error model [chapter 1 of 9,\nand references therein]. The main diﬀerence is conceptual: in a micro-\nmacro model, replicate covariate measurements correspond to distinct in-\ndividuals within a group; while in a measurement error model, they are\nmerely repeated noise-corrupted observations of some true explanatory\nvariable for the ith observational unit. There is another practical diﬀer-\nence: most measurement error literature assumes smaller ni’s (the number\nof covariate measurements per group) than one tends to encounter in a\n“true” micro-macro setting.\nThe simplest approach to modelling such data is the “naive” one: sim-\nply using the sample means ¯Xi = n−1\ni\nP\nj Xij as proxies for the latent ξi’s.\nHowever, it is well-known [e.g. chapter 3 of 9, and references therein] that\n2\nsuch a failure to account for the uncertainty in the Xij’s biases estimates\nof the regression parameters. Most notably, it creates attenuation in the\nestimate of β: letting ˆβ denote such an estimate, we will have |bβ| < |β|,\neven as the number of groups grows asymptotically. In intuitive terms,\nthis attenuation happens because the noise in the covariates stretches the\nregression line on the horizontal axis. Thus, a plethora of both frequen-\ntist and Bayesian methods have been proposed to account for covariate\nuncertainty in a way that produces less biased estimation and inference\nfor the regression part of the model. A comprehensive review of measure-\nment error methodology is beyond the scope of this manuscript, but the\ninterested reader may refer to books such as [7, 9] or the review paper of\nSchennach [36].\nMany real-world datasets do not obey the “classical” framework of\n(1–2) [e.g. Section 6.4 of 7, and references therein], and there are two\nways to transcend it: by replacing the linear terms βξi and βZZi in (1)\nwith arbitrary regression functions, or by generalizing the additive covari-\nate structure in (2). There are few micro-macro modelling papers with\ngeneralizations of either type, aside from the discrete variable methods of\nBennink et al. [3, 4]. Thus, we focus our attention here on the measure-\nment error literature instead. Beyond the comprehensive review sources\nmentioned above, the most generalized framework which is relevant to\nthis manuscript is that of Hu and Schennach [22]. They assumed each ob-\nservational unit i only has a single covariate measurement Xi ∼fX|ξ=ξi,\nbut also has a single replicate measurement or instrumental variable Wi,\nassumed to provide further information about ξi. They also allowed a\nvery general form for the regression function in which Y only depends on\nthe unobserved ξ, with only some technical assumptions on the distribu-\ntions of Y | ξ, X | ξ, and ξ | W . Their assumptions on the covariate\nstructure were very broad, requiring only that there exists a functional\nM such that M\n\u0002\nfX|ξ (· | ξ)\n\u0003\n≡ξ for all ξ. Examples of such functionals\ninclude the mode, as well as any quantile or moment. With this frame-\nwork, the authors proposed a sieve likelihood estimator for the regression\nparameters and the densities of X | ξ and ξ | W . To our knowledge, there\nare no established Bayesian methods that accommodate this level of gen-\nerality. Sarkar et al. [35] proposed a Bayesian model which used Dirichlet\nProcess mixtures to achieve a great deal of ﬂexibility in modelling the re-\ngression function, latent covariates, and error terms; but it still assumed\nan additive error structure of the form (2).\nNeither of the aforementioned papers (or, indeed, any measurement er-\nror literature we have seen) gives much consideration to the “unit-speciﬁc”\ncovariate distributions fX|ξ=ξi — speciﬁcally, to any diﬀerences between\nthem across units.\nThis is understandable, as most errors-in-variables\nproblems have no more than a single-digit number of covariate measure-\nments available per unit, making any such diﬀerences irrelevant. How-\never, in an explicitly multilevel setting, there are typically many more\nindividuals per group [e.g. 11, 2], and it may be of interest to explicitly\nconsider the group-speciﬁc covariate densities in inference.\nWe believe\nthat the Bayesian paradigm (or, at the very least, the empirical Bayesian\nparadigm) is the most natural setting in which to achieve this.\nWith all of the above considerations in mind, our goals in this paper are\n3\nthreefold. First, we seek to develop a(n empirical) Bayesian model with\ngenerality comparable to that of Hu and Schennach [22]. Second, we wish\nto apply this model in the micro-macro multilevel setting, providing an\nability to accommodate “non-classical” data structures which we believe is\nsorely missing in that literature. Our ﬁnal goal is to leverage the data sizes\ncharacteristic of micro-macro situations in order to focus our inference\nnot only on the regression part of the model, but also the distributions of\n“individual-level” covariates within each group.\nTo achieve these goals, we propose FRODO (Functional Regression\nOn Densities of Observations), a method which uniﬁes density estima-\ntion and functional regression in a joint empirical Bayesian model. Al-\nthough the core idea of FRODO is a fairly straightforward combination of\nwell-established methods in principle, it allows for a remarkable degree of\ngenerality in data structures, and its design proves to be far from trivial.\nBefore describing FRODO, we ﬁrst give an overview of necessary func-\ntional data analysis concepts in Section 2. We then give a general overview\nof the FRODO model and its assumed data structure in Section 3, fol-\nlowed by a detailed description of its prior and likelihood components, as\nwell as its practical implementation. In Sections 4 and 5, we show several\nsimulation studies which demonstrate the potential generality of FRODO\nin both the regression and covariate observation parts of a micro-macro\nmodel.\n2\nA brief review of key functional data\nanalysis concepts\nBroadly speaking, functional data analysis (FDA) is a ﬁeld of statistics in\nwhich the fundamental units of interest are (almost everywhere) smooth\nfunctions. A detailed overview of the ﬁeld is beyond the scope of this\nmanuscript, but the interested reader may ﬁnd one in the excellent book\nby Ramsay and Siverman [32]. Here we discuss only the concepts neces-\nsary to establish notation and motivation for FRODO.\n2.1\nScalar-on-function functional regression\nAs the name implies, scalar-on-function regression concerns the modelling\nof a real-valued univariate (or “scalar”) response variable with predictors\nthat are functions [32, Section 12.3]. This is achieved by using integrals\nin place of the sums which deﬁne scalar regression models. For example,\nconsider a simple case in which our data are pairs {Yi, f ∗\ni }, i = 1, . . . , N,\nwhere Yi is a real-valued (continuous) scalar response and f ∗\ni is an almost\neverywhere continuous function on [0, 1]. For this data, a functional linear\nmodel would be of the form\nYi = α +\nZ 1\n0\nβ∗(x)f ∗\ni (x)dx + ǫi,\n(3)\nwith i.i.d. errors ǫi ∼N (0, σY ). The coeﬃcient function β∗weighting the\nintegral is analogous to regression coeﬃcients in a fully scalar regression\nmodel.\n4\n2.2\nBasis function expansions\nBecause function spaces are inﬁnite-dimensional, a core component of\nFDA is the representation of functions of interest in ﬁnite-dimensional\nspaces [32]. Typically, this is achieved by modelling functions as linear\ncombinations of ﬁnitely many basis functions [32, Section 3.3]. Through-\nout this manuscript, we will use f ∗to denote a function of interest, and\nremove the asterisk to denote a relevant basis function approximation f.\nSeveral types of functional bases exist, including those based on func-\ntional principal components, Fourier series, and splines [32]. Attention\nhere is restricted to the latter, and in particular the P-splines of Eilers\nand Marx [13]. For our purposes, it suﬃces to know that a P-spline rep-\nresentation of a function f ∗on a compact interval [a, b] has the form\nf(x) =\nK\nX\nk=1\nckBk(x).\n(4)\nHere, the basis functions Bk are splines: piecewise polynomials with sup-\nports deﬁned by a set of equally-spaced “knots” in [a, b]. More detailed\nexplanations of splines can be found in, for example, [32] and Eilers and\nMarx [13]. In the frequentist setting, the coeﬃcients c = (c1, . . . , cK) can\nbe ﬁt with a penalized likelihood method. Common penalties force f to\nadhere to desirable shapes by penalizing “roughness”, as measured with a\nsuitable linear diﬀerential operator [see 32, Chapter 5]. Eilers and Marx\n[13] modiﬁed this idea by instead using a penalty based on ﬁnite diﬀer-\nences between coeﬃcients. Their penalty deﬁnes the notion of P-splines\nand is of the form\nλ\nK\nX\nk=r+1\n\u0002\n(∆rc)k−r\n\u00032 ,\n(5)\nfor a positive integer r, where ∆r denotes the rth-order ﬁnite diﬀerence\noperator and (∆rc)k−r denotes the (k −r)th element of the (K −r)-\ndimensional vector (∆rc). For instance,\n\u0000∆1c\n\u0001\n1 = c2 −c1,\n\u0000∆2c\n\u0001\n1 = c3 −2c2 + c1, and\n\u0000∆3c\n\u0001\n1 = c4 −3c3 + 3c2 −c1.\nWhen the smoothing parameter λ > 0 is large, (5) dominates the penalized\nlikelihood. Eilers and Marx noted that the sum in this penalty is a good\napproximation to the rth derivative of f when the knots deﬁning the spline\nbasis are equally spaced, especially for large dimensionality K. Thus, for\nlarge λ the estimated f is forced to take the approximate shape of a\npolynomial of degree r −1.\nLang and Brezger [24] devised a Bayesian version of P-splines, based on\nthe notion that a penalized likelihood function is analogous to a posterior\ndistribution on the log scale, with the penalty term assuming the role of\nthe prior.\nThe penalty (5) is the log density of an rth-order Gaussian\n5\nrandom walk:\n(∆rc)k−r ∼N\n\u0012\n0,\n1\n√\n2λ\n\u0013\n(6)\nfor k = r, r + 1, . . . , K. Lang and Brezger [24] gave the ﬁrst r components\nof c (which we call “free parameters” in contrast with the last K −r\ncomponents, whose behaviour is restricted by (6)) ﬂat priors. However,\nwe adopt the philosophy that such priors are unreasonable because they\ngive equal weight to all values, no matter how extreme [e.g. the case\nstudy of 5], and we have also found such priors to result in extremely\npoor MCMC sampling behaviour in our models. Our priors on the free\nparameters in the various P-spline components of FRODO are described\nin Sections 3.2–3.3.\nAs noted by Eilers and Marx [13], one can use P-splines to model a\ndensity f ∗by replacing f with log f in (4). The imposition of a polynomial\nshape on log f then leads to a density estimate which is close to the\nexponentiation of the corresponding polynomial. For instance, a penalty\nof order r = 3 (in either the frequentist or Bayesian setting) forces log f\ntowards a quadratic shape, and therefore the resulting density estimate\nwill be similar in shape to a Gaussian.\n3\nThe FRODO model\n3.1\nGeneral overview\nHaving reviewed the necessary functional data analysis concepts, we are\nnow ready to describe the FRODO approach to micro-macro modelling.\nAssume the data is organized into N groups, with the ith group contain-\ning ni individuals.\nIn the simplest case (assumed in the remainder of\nthis section for ease of exposition), data in the ith group consists of a\ngroup-level response variable Yi, and individual-level observations of a co-\nvariate X, (Xi1, . . . , Xini). Although we assume real-valued Gaussian Yi’s\nthroughout this paper for the sake of simplicity, in principle the following\nmethodology could be extended to any response type for which general-\nized linear modelling is possible. As in Section 1, the model is comprised\nof both a regression part and a covariate observation part, but we assume\na much greater level of generality than in (1–2). Our only assumption for\nthe covariate density part is that, for the ith group, Xi := (Xi1, . . . , Xini)\n(where an omitted subscript means the collection of all elements across\nthat subscript) is an i.i.d. sample from an unobserved or “latent” group-\nspeciﬁc covariate density f ∗\ni . The regression part of the model deﬁnes\nthe “novel” idea at the core of FRODO: the use of these densities (tech-\nnically, basis expansion estimators thereof) as predictors in a functional\nlinear regression. In mathematical terms, the regression part of the model\n6\nis\nYi = α +\nZ\nβ∗(x)f ∗\ni (x)dx + ǫi\n(7)\n= α + E∗\ni [β∗(X)] + ǫi,\n(8)\nǫi\ni.i.d\n∼N (0, σY ) ,\nwhere E∗\ni [β∗(X)] denotes the expectation of β∗(X) with respect to the\ndensity f ∗\ni . The equivalence between (7) and (8) is the key to FRODO’s\nutility: by simply using densities as predictors in a functional linear regres-\nsion, the resulting model is essentially a GAM. Thus, FRODO allows for\na fully nonparametric approach to both regression functions and covariate\nstructures.\nIt must be noted that the regressor in (8), E∗\ni [β∗(X)], is the “ex-\npectation of the regression function”.\nIn general, this is not equal to\nβ∗(E∗\ni [X]) — the “regression on the expectations” — unless β∗is linear.\nUse of the latter is perhaps more “standard” in the measurement error\nliterature, where it is typically assumed that the Xij’s within each unit\ni are noise-corrupted versions of some “true” covariate ξi [see 9, or any\nstandard reference on measurement error]. Although it is not always as-\nsumed that E∗\ni [X] = ξi (e.g. the general linear error structures described\nin Section 6.4 of [7], and references therein), typically the target is estima-\ntion of β∗(ξi), possibly marginalized over an estimate of the “posterior”\nfξ|Xi [e.g. 21, 25]. We are not aware of any literature which explicitly uses\n“expectations of the regression” in the way that FRODO does.\nIn the next two subsections, we detail the priors and likelihoods com-\nprising FRODO. Recall that we approximate β∗and the f ∗\ni ’s with basis\nfunction expansions, use of which will be denoted without asterisks. In a\nslight abuse of notation, we consider the model\nYi = α +\nZ\nβ(x)fi(x)dx + ǫi\n(9)\n= α + Ei [β (X)] + ǫi,\n(10)\nas a proxy to (7–8), where β and fi are the basis function approximations\nto their “true” counterparts (β∗and f ∗\ni , respectively), and Ei denotes\nexpectation w.r.t. fi.\nTo formally justify this “proxy model” in terms of the “true” model\n(7), it would be necessary to replace the error terms in (9) with terms\nthat account for both the random regression error and the approximation\nerror inherent to such ﬁnite-dimensional approximations [e.g. 19]. Such\nterms would be of the form\nei = ǫi +\nZ\n[β∗(x)f ∗\ni (x) −β(x)f(x)] dx.\n(11)\nHowever, in practice we eﬀectively assume that the second term in (11)\nis negligible and do not concern ourselves with the distinction between ǫi\nand ei.\nBefore exploring the details of FRODO, some ﬁnal technical and no-\ntational points are in order. We recommend standardizing the data so\n7\nthat default prior choices are weakly informative [17, Sections 2.9 and\n16.3]. Keeping with our convention of using omitted subscripts to mean\nthe collection of all elements across that subscript, let Y = (Y1, . . . , YN)\nand X = {X1, . . . , XN}, where Xi was deﬁned above. In what follows, we\nwill assume that Y and X have both been standardized to have zero mean\nand unit variance. Note that for X, this standardization is “marginal”,\nmeaning that it is done across groups and individuals within groups. We\nwill overload notation and use f ∗\ni and fi to refer to, respectively, the true\ndensity and its basis function approximation for the standardized version\nof Xi. For technical reasons, it is necessary to assume that β and the fi’s\nare all deﬁned on a common compact interval. This will be denoted by\n[a, b] on the standardized scale, and when it is necessary to speak about\nthe domain of the covariates on the original (unstandardized) scale, it\nwill be denoted by [a′, b′].\nAssuming X has been standardized as rec-\nommended above, we have a =\n\u0000a′ −¯X\n\u0001\n/σ(X) and b =\n\u0000b′ −¯\nX\n\u0001\n/σ(X),\nand [a′, b′] can be chosen so that its endpoints are (nearly) equal to the\nunscaled extrema of the covariates.\n3.2\nThe density model\nFor computational convenience — and because it suﬃces for the ordinal\ncovariates which are common in real micro-macro datasets [e.g. 11, 2, 12]\n— the fi’s are modelled as histograms. In practical terms, this means\nthat they are linear combinations of constant basis functions:\nfi(x) =\nK\nX\nk=1\nφik\n1Ik(x),\n(12)\nwhere Ik is the kth equal-width subinterval [a + (k −1)h, a + kh) of [a, b],\n1Ik is the indicator function of Ik, and h = (b−a)/K is the bin width. The\ndensity coeﬃcients φik are scaled “softmax” transformations of Gaussian\nrandom variables θik, i = 1, . . . , N, k = 1, . . . , K:\nφik =\neθik\nh PK\nj=1 eθij ,\n(13)\nwhere, for all i, θi1 ≡0 to ensure identiﬁability. Equivalently, we may\nsay that the φi’s are (up to the scaling factor h) logistic normal random\nvectors [1].\nThe priors for the θ’s are chosen in order to impose useful constraints\non the behaviour of the densities. In particular, for some positive inte-\nger r we will impose an rth-order Gaussian random walk prior on θi =\n(θi1, . . . , θiK) for all i. Since the logarithms of the fi’s are also piecewise\nconstant, this structure means that log fi is a Bayesian P-spline of degree\nzero, with rth-order penalty, for all i. Recall from Section 2.2 that an\nrth-order random walk prior on θi,\n(∆rθi)k−r ∼N (0, τi) , k ≥r + 1\n(14)\n8\nforces log fi towards the approximate shape of a (r −1)th-degree polyno-\nmial when the smoothing parameter τi is small1.\nNote that (14) completely determines the conditional distributions of\nθik for k > r given θik for k ≤r.\nIn the case r > 1, it remains to\nset the priors on the “free parameters” θik for 2 ≤k ≤r: the “initial\nvalues” of the random walk. A seemingly sensible and simple choice would\nbe diﬀuse, mean-zero, independent Gaussian priors. Unfortunately, this\nturns out not to be entirely suitable for FRODO. For r > 1, imposing fully\nindependent priors on the densities2 causes bias in the posterior mean\ncoeﬃcient function, bβ. For instance, if the true β is a linear function,\nthe magnitude of the slope of bβ will be biased downward, just as in the\n“naive” approach to modelling described in Section 1. In the Bayesian\nhierarchical setting, this “attenuation” problem can be solved by putting\npriors on the covariates which introduce dependence between them and\n“pool” each group’s measurements towards a latent group-level variable.\nThe solution here is similar.\nTo expand on this, ﬁrst note that with θi1 ≡0 for all i, we have\nθik = log\n\n\nh−1\na+kh\nZ\na+(k−1)h\nfi(x)dx\n\n\n−log\n\nh−1\na+h\nZ\na\nfi(x)dx\n\n\n(15)\n≈log f ∗\ni\n\u0012\na + h\n\u0012\nk −1\n2\n\u0013\u0013\n−log f ∗\ni\n\u0012\na + h\n2\n\u0013\n,\n(16)\nrecalling that f ∗\ni is the “true” density for group i.\nSuppose f ∗\ni is that of a N (ξi, σi) random variable3. This corresponds\nto the limiting case for r = 3 as τi →0, and it can be shown that (16) in\nthis case reduces to\nθik ≈h(k −1)\nσ2\ni\n\u0012\nξi −\n\u0012\na + kh\n2\n\u0013\u0013\n(17)\nFor r = 3, this approximation motivates our choice of priors for the\n“free parameters”. For each i and k = 2, 3, we take them to be Gaussian\nwith mean given by the right side of (17) and standard deviation τi. Thus,\nτi controls fi’s adherence to the limiting Gaussian shape in two respects:\nby controlling the free parameters’ deviations from their means, and by\nscaling the random walk behaviour in (14).\nWe now set priors on ξi and σi. When the true covariate densities are\nGaussian, the structure of the data is analogous to that of the “classical”\nmicro-macro model, with ξi being a “latent group-level covariate” and σi\ncontrolling the level of Gaussian noise for each group’s individual-level co-\nvariate measurements. In keeping with natural choices for that setting, we\n1Henceforth, the phrase “smoothing parameter” will refer to the standard deviation of the\nrandom walk prior (τ), instead of its precision as in Section 2.2 (where it was denoted by\nλ = τ −2/2).\n2When discussing the model itself, we will typically write “the densities” to refer to the\nhistograms fi which are actually part of the model. When it is necessary to invoke the f∗\ni ’s,\nwe will specify them as the “true densities”.\n3Assuming the covariates have been standardized as recommended in Section 3.1, most of\nf∗\ni ’s mass presumably lies in [a, b], and a < ξi < b.\n9\nﬁrst assign the ξi’s a N (µξ, σξ) prior. Recalling that [a′, b′] denotes the as-\nsumed domain of the covariate densities on the original (unstandardized)\nscale, the mean µξ is given a N\n\u0000(a′b −b′a)/(a′ −b′), 15/K2\u0001\nhyperprior.\nThis corresponds to a mean-zero hyperprior on the original covariate scale,\nwith the empirically-determined standard deviation 15/K2 accounting for\nthe discretization error from approximation (16). The scale σξ is given\na standard half-normal prior, which will be fairly uninformative if the\nXij’s have been scaled to have unit marginal variance. It will often be\nreasonable that the covariate densities are homoscedastic: σi ≡σX for\nall i. A standard half-normal prior is a sensible choice in this case. If\none wishes to explicitly model heterogeneity, then each σi can be given its\nown half-normal prior, perhaps sharing a common scale parameter with\nits own hyperprior.\nNow, suppose f ∗\ni is instead a (shifted) Exponential (λi) density. This\ncorresponds to the limiting case for the random walk with r = 2, and here\n(16) reduces to\nθik = −λi (k −1) h.\n(18)\nNote that for an exponential density, there is no discretization error, so\n(15) and (16) are equal. Thus, analogously to the r = 3 case described\nabove, when r = 2 we assume the “free parameters” θi2 are Gaussian\nwith mean given by the right side of (18) and standard deviation τi. A\nnatural choice of prior for the “latent rates” λi is Gamma (αλ, αλ/µλ).\nThe mean µλ is given a standard half-normal prior (which should be only\nweakly informative if the covariates have been standardized), while the\nshape parameter αλ is given a more diﬀuse half-normal prior with scale\n10.\nNote that this parameterization of the Gamma in terms of shape\nand mean, rather than the more conventional shape and rate, proved\ncomputationally advantageous.\nBy deﬁning the “free parameters” in terms of latent group-level vari-\nables with their own hyperpriors, we introduce the necessary dependence\nand “pooling” to prevent bias in the regression part of the model, just as\none might do in the scalar case. For any order r, the density model is\ncompleted with priors on the smoothing parameters τi, which we take to\nbe exponentials with rates δ−1\ni\n. The scales are assumed to be ﬁxed data,\nchosen empirically based on heuristics and the properties of the Xij’s in\nthe absence of more meaningful prior information.\nSuch choices place\nFRODO in the category of “empirical Bayesian” methods, but we have\nfound that sampling behaviour and posterior results can become poor\nwhen the δi’s are not chosen carefully. If group sizes are moderate (ni’s\nroughly between 20 and 60) and one doesn’t expect any of the covariate\ndensities to deviate too seriously from the shape implied by the rth-order\nrandom walk prior, δi = 0.1 for all i seems to be a good default choice\nbased on preliminary empirical results. Smaller groups tend to require\nsmaller δi’s, and it may also be advantageous to shrink them when the\nbasis dimension K is very large, especially relative to the ni’s.\nFinally note that, because the densities are piecewise constant, the like-\nlihood Xi ∼fi is equivalent to mi := (mi1, . . . , miK) ∼Multinomial (ni, φi),\nwhere mik is the bin count |{j : Xij ∈Ik}|. In summary, the model for the\n10\ndensities, assuming an rth-order random walk prior structure (for r ≤3),\nis\nmi ∼Multinomial (ni, φi)\nφik =\neθik\nh PK\nj=1 eθij\nθi1 ≡0\nθi2 ∼N (−λih, τi)\nλi ∼Gamma\n\u0012\nαλ, αλ\nµλ\n\u0013\nαλ ∼Half-Normal(0, 10)\nµλ ∼Half-Normal(0, 1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nr = 2\nθik ∼N\n\u0012h(k −1)\nσ2\ni\n\u0012\nξi −\n\u0012\na + kh\n2\n\u0013\u0013\n, τi\n\u0013\n(k = 2, 3)\nξi ∼N (µξ, σξ)\nµξ ∼N\n\u0012a′b −b′a\na′ −b′ , 15\nK2\n\u0013\nσξ ∼Half-Normal(0, 1)\nσX ∼Half-Normal(0, 1)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nr = 3\n(∆rθi)k−r ∼N (0, τi) , k > r\nτi ∼Exp(δ−1\ni\n)\n3.3\nThe regression model\nHere we detail priors for the regression part of FRODO, the likelihood for\nwhich is deﬁned by (9–10). Recall that we have restricted our attention\nin this manuscript to continuous real-valued responses Yi with i.i.d. errors\nǫi ∼N (0, σY ), The following priors on α and β would require only minor\nchanges to accommodate more general response types (e.g. diﬀerent scal-\ning may be in order to ensure plausible eﬀect sizes in a logistic regression;\nsee Section 16.3 of Gelman et al. [17]), and the prior on the dispersion\nparameter could easily be changed as necessary.\nThe error scale σY is given a half-T prior with 4 degrees of freedom and\nscale 1/\n√\n2, so that σY has a prior mean of 1/\n√\n2. Recalling the assump-\ntion from Section 3.1 that Y has been standardized to have unit variance,\nthis scale (in informal terms) loosely corresponds to a prior expectation\nthat roughly half of the variation in the response values is due to regres-\nsion error (assuming that the errors and regressors are independent, which\nwe do here). This seems to be a sensible approach for a “default” prior,\nunless one has prior domain knowledge which would allow for context-\nspeciﬁc prior beliefs about the regression error.\n11\nBoth α and β are given hierarchical priors with scales proportional to\nσY . This can be shown to ensure unimodality in some penalized Bayesian\nregression models [30], and we also found that it improved sampling be-\nhaviour. The intercept α is given a diﬀuse N (0, 20σY ) prior.\nWe take the coeﬃcient function β to be piecewise constant, with the\nsame dimensionality K as the densities. This is quite computationally\nconvenient, as the integral in (9) then reduces to the inner product be-\ntween the coeﬃcients of β and fi, scaled by the bin width h. Because\nthe functional predictors all have unit integral, adding a constant shift to\nβ does not change the model: for any c ∈R, the model is identical if β\nand α are replaced by β + c and α −c, respectively. Thus, we impose the\nidentiﬁability constraint E [β (X)] :=\nR b\na bfCent(x)β(x)dx = 0, where bfCent\nis the empirical central density:\nbfCent(x) :=\nK\nX\nk=1\nPN\ni=1 mik\nPK\nl=1\nPN\ni=1 mil\n1Ik(x).\n(19)\nEssentially, bfCent is the “marginal histogram” of all covariate data across\ngroups.\nPresumably, the total number of covariate observations P\ni ni\nwill be large enough in most data sets to ensure that bfCent is reasonably\n“smooth”, so that it is a good approximation to the “marginal” covariate\ndensity (i.e. marginalized across groups) for large K. Note that we use\nthe empirical central density mainly for computational convenience: an\n“inferred central density” like N −1 P\ni fi would certainly be “smoother”,\nbut this would add needless complexity to the gradients used in NUTS\nwhen the empirical version is suﬃcient to ensure identiﬁability.\nThis constraint amounts to centering the inferred regressors Ei [β(X)].\nIn practice, the constraint is achieved by deﬁning a piecewise constant\nfunction\nβ0(x) :=\nK\nX\nk=1\nβ0\nk\n1Ik(x)\n(20)\nand taking β = β0 −\nR bfCentβ0. In keeping with Bayesian functional re-\ngression approaches such as [10], we put a second-order random walk prior\non the coeﬃcients of β0, with the ﬁrst coeﬃcient set to 0 for identiﬁability:\nβ0\n1 ≡0,\nβ0\n2 ∼N (0, 20hσY ) ,\n\u0000∆2β0\u0001\nk−2 ∼N (0, τβσY ) .\nThe smoothing parameter τβ controls the extent to which β deviates from\nthe random-walk behaviour. As τβ →0, β is forced towards a stepwise\napproximation to a straight line, and the regression model (9) is therefore\nforced towards a linear regression. In this limiting case, the “slope” of β,\nh−1β0\n2, is equivalent to the regression coeﬃcient in a scalar linear model.\nThus, using a scale factor of 20σY h in β0\n2’s prior can be considered roughly\nanalogous to placing a N (0, 20σY ) prior on the coeﬃcient in the scalar\ncase, which should be reasonably diﬀuse if the covariates have been scaled\n12\nas recommended above [e.g 40, Section 25.12 of User’s Guide]. Finally,\nτβ is given an exponential prior with rate 2 (equivalently, scale 0.5). In\ncontrast to the smoothing parameters for the densities, we found that τβ\ndid not require a careful selection of prior scale in order to ensure good\nmodel performance.\n3.4\nImplementation\nThe FRODO model is implemented in the Stan programming language [8],\nwhich provides exceptional power, ﬂexibility, and eﬃciency through its use\nof the No-U-Turns Sampling (NUTS) variant of Hamiltonian Monte Carlo\n[20]. For each of the below simulation studies, four parallel chains were\nrun with fairly diﬀuse starting values, with suﬃciently many sampling\niterations to ensure eﬀective sample sizes of at least 450 for all parameters\n[see 17, Section 11.5]. All model runs were devoid of divergent transitions\n[40], and the overwhelming majority of parameters in all simulations had\nˆR values (where ˆR is a diagnostic which helps to assess model convergence,\nsee Vehtari et al. [44]) below 1.01, with only a single parameter in each\nof the models of Sections 4.2 and 4.5 having a value very slightly above\nthis threshold. All of the simulation studies below were conducted using\nR [31], interfacing with Stan via the RStan package [41]. More details are\ngiven in Appendix A.\n4\nSimulation studies\nAs discussed in previous sections, FRODO is uniquely powerful in theory\nbecause it is “doubly nonparametric”: it can capture arbitrary unknown\nstructures in both the covariate densities and the regression model. In\nthe following subsections, we put this to the test with a wide variety of\nsimulated datasets. We will assess FRODO’s ability to harness location,\nscale, and shape information from covariate densities and use it to recover\ntrue regression relationships. In each study, FRODO will be compared to\ntwo simpler models:\n1. a “naive” scalar regression model using only the sample means of the\ncovariate measurements (or of some suitable transformation thereof,\nwhere applicable); and\n2. a “hierarchical” scalar regression model, where the form of the re-\ngression function and covariate distributions are assumed known,\nwith only the actual parameter values unknown.\nMore detail will be provided in the following subsections.\nBecause FRODO does not assume any parametric form for either the\nregression or covariate parts of the model, all that is required are choices of\nan appropriate random walk order r, dimensionality K, (unstandardized)\ndensity domain [a′, b′], and set of density scaling factors δ = (δ1, . . . , δN).\nThese choices must be made assuming that the true data-generating mech-\nanisms are not known a priori. One could use subject-speciﬁc domain\nknowledge if it is available. Otherwise, an “empirical Bayesian” approach\nbased on informal inspections of the data is acceptable, and this is the\n13\napproach we will use for all simulation studies in this manuscript. Vi-\nsual inspection of default histograms or KDE’s suﬃces to this end. From\na strictly Bayesian perspective on inference, one could argue that this\ndata dependence in the prior is not philosophically sound. However, an\nempirical Bayesian approach to nonparametric modelling is certainly not\nwithout precedent [e.g. 34, 42]. Serra and Krivobokova [37] devised an\nempirical Bayesian method for determining both the smoothing parame-\nter and penalty order in spline ﬁtting; our strategy could be viewed as a\ncrude, heuristic approximation of such a method.\n4.1\nGaussian covariate densities, linear regression\nmodel\nWe begin with the “classical” structure from Section 1, where the individual-\nlevel measurements within groups are Gaussian deviations from a latent\ngroup-level covariate, itself Gaussian:\nξi ∼N (0, σξ) ,\n(21)\nXij ∼N (ξi, σX) .\n(22)\nThe regression model is also linear:\nYi = α + ˜βξi + ǫi,\n(23)\n= α + Ei\nh\n˜βX\ni\n+ ǫi,\nǫi ∼N (0, σY ) .\n(24)\nNote that the second line explicitly restates the regression model in the\nform of (8), with the true regression function β∗(x) = ˜βx being a line with\nslope ˜β. Some clariﬁcation on notation is in order here. Throughout Sec-\ntions 4–5, ˜β ∈R will denote a scalar which determines the magnitude and\nsign of the true regression function β∗. In turn, recall that the (piecewise\nconstant) basis function approximation to β∗is denoted as β.\nThe true parameter values before standardizing4 the data as described\nin Section 3.2 are σξ = 2, σX = 3, α = 0.3, ˜β = 0.4, and σY = 0.5. The\nresult is a dataset with moderate amounts of noise in both the regression\nand the covariate measurements. The number of groups is N = 275 and\neach group contains covariate samples for n = 20 individuals.\nUpon inspecting the data as recommended in the introduction to this\nsection (not shown), we ﬁnd that an assumption of roughly Gaussian\ndensity shape (corresponding to r = 3) is reasonable for these data. Be-\ncause the densities are moderately wide but relatively close together (as\nthe between-density variability σξ, is somewhat smaller than the within-\ndensity variability, σX), a modest basis of size K = 10 should suﬃce\nwithout substantial loss of information. For this simulated data we have\nmini,j Xij = −13.54922, maxi,j Xij = 10.87845, so we extend this range\nslightly by the same amount in each direction to arrive at an assumed\n4Throughout this section, all parameter values and results will be presented on the original\n(unstandardized) scale of the given data. The standardization only occurs “internally”, during\nthe ﬁtting of the FRODO model.\n14\n−10\n−5\n0\n5\n10\n−6\n−4\n−2\n0\n2\n4\nRegression function\nx\nβ(x)\nFRODO post. mean\nFRODO P.W. 95% C.I.\nTrue function\nHierarchical post. mean\nNaive post. mean\n−1\n0\n1\n2\n−2\n−1\n0\n1\n2\n3\nResponse values\nPredicted responses\nActual responses\n95% P.I.’s\nFigure 1: Results of FRODO applied to data with Gaussian covariates and a\nlinear regression structure. Left: the regression function estimated by FRODO,\nalongside its pointwise 95% credible region, the true function, and posterior\nmean estimates from hierarchical and naive scalar models. Right: responses ˆYi\npredicted by FRODO (along with 95% prediction intervals) vs. true responses.\ndensity domain5 of [a′, b′] = [−13.67077, 11]. Finally, the default choice of\nδi = 0.1 for all i recommended in Section 3.2 is used here.\nAs stated at the beginning of this section, we compare FRODO to\ntwo simpler models. The ﬁrst is simply a standard Bayesian linear re-\ngression, with (21) omitted and the group-level sample covariate means\n¯\nXi treated as the “true” covariates. The second is a scalar micro-macro\nBayesian regression, implemented in the “obvious” way: namely, (21)–\n(24) are assumed to be the known form of the model, with all parameters\n(including the latent ξi’s) unknown and inferred. Recall that the estimate\nof ˜β from the “naive” model will be smaller in magnitude than the “true”\nvalue, which the hierarchical scalar model will presumably recover more\neﬀectively.\nFigure 1 shows results for the regression part of the model. In the left\nplot, the stepwise estimator of the regression function is shown with its\npointwise (P.W.) 95% credible interval (C.I.). Superimposed on the plot\nare the true regression function, as well as the posterior means from the\nhierarchical and naive scalar models (both of which assume a known linear\nform for the regression unlike FRODO, which only controls adherence to\na linear regression through τβ). Because the within-group variability is\nnot too much larger than the across-group variability and the sample sizes\nare reasonable, only a small amount of attenuation is caused by using the\nnaive model, so the estimated regression functions for both scalar models\nare entirely within the pointwise C.I. from FRODO. However, the “slope”\n5Henceforth, the “assumed domain” will be stated on the unstandardized scale of the\noriginal data (i.e. [a′, b′]), with the standardization to [a, b] left unstated.\n15\n−10\n−5\n0\n5\n10\n0.00\n0.05\n0.10\n0.15\nf10\nx\nf(x)\nPost. mean\nP.W. 95% C.I.\nTrue density\nXij\n−10\n−5\n0\n5\n10\n0.00\n0.05\n0.10\n0.15\nf 192\nx\n−10\n−5\n0\n5\n10\n0.00\n0.05\n0.10\n0.15\nf 73\nx\nFigure 2: For a selection of groups (from the data with Gaussian covariates and a\nlinear regression structure), the FRODO estimate of the group-speciﬁc covariate\ndensity, alongside its pointwise 95% credible regions. The true densities are\nsuperimposed as red lines, and the actual covariate samples are shown as rug\nplots.\nof the mean regression function from FRODO seems to be closer to those\nof the true function and the hierarchical scalar estimate, rather than that\nof the naive estimate. We can formalize this observation by considering\nthe secant line to the FRODO regression function which intersects it at\nthe midpoints of the ﬁrst and last bins.\nThe slope of this line (which\nis roughly analogous to a notion of “slope” for the FRODO regression\nfunction) is 0.4002, whereas the slopes of the true, hierarchical scalar,\nand naive scalar regressions are 0.4, 0.4172, and 0.3678, respectively.\nAnother way to assess FRODO’s ability to infer the “true” regression\n(rather than the incorrect one implied by the naive model) is by checking\nthe posterior for the regression error scale, σY . Because of the additional\nnoise in the individual-level covariate measurements, the naive model’s\nestimate for σY will be biased upward [e.g. 9, Section 3.2.1]. Indeed, the\nposterior mean for this parameter from the naive scalar model is 0.5556\n(95% C.I. (0.5107, 0.6027)), while the posterior means from FRODO and\nthe hierarchical scalar model are 0.4930 (95% C.I. (0.4421, 0.5473)) and\n0.4904 (95% C.I. (0.4384, 0.5453)), respectively. Because the FRODO es-\ntimate is much closer to the true value of 0.5 than it is to the “naive\nestimate”, we are satisﬁed that we have avoided the attenuation prob-\nlem inherent in the naive model. Table 2 contains summaries of the σY\nposteriors for every simulation study in this manuscript.\nOn the right of Figure 1, we have plotted the posterior mean predicted\nresponses ˆYi against the observed responses. The shaded region is a visual\nrepresentation of 95% posterior prediction intervals (P.I.’s) for each group.\nFigure 2 shows the estimated fi’s, along with their pointwise 95%\nC.I.’s, for the group with the smallest (left) and largest (right) ξi’s, as well\nas the group whose ξi is closest to the sample mean (middle). The middle\nand right ﬁts are satisfactory, with the inference eﬀectively capturing the\n16\ntrue covariate densities (shown in red). The left plot shows that there\nis something of a mismatch between the inferred and true densities for\nthe group with the lowest ξi, with the former shifted slightly too far to\nthe right.\nGiven that the model appears to perform well in all other\nrespects, this is not a signiﬁcant concern, especially since the rug plot\nsuggests consistency with the data. We did not observe this problem in\nother datasets generated with the same parameter values (not shown),\nand therefore assume it is simply an unfortunate quirk of this particular\ndata.\n4.2\nGaussian covariate densities, nonlinear regres-\nsion model\nHere, we test FRODO’s ability to handle nonlinear regression functions.\nThe covariates adhere to the same Gaussian structure as in Section 4.1,\nbut the regression model is now quadratic:\nYi = α + ˜β\n\u0000ξ2\ni + σ2\nX\n\u0001\n+ ǫi\n= α + Ei\nh\n˜βX2i\n+ ǫi.\nBecause the true covariate densities all have common variance σ2\nX, the\ndiﬀerence between Ei\n\u0002\nX2\u0003\nand (Ei [X])2 is constant and can therefore be\nabsorbed into the intercept. Here, the regression function is β∗(x) = ˜βx2.\nThe same parameter values\n\u0010\nσξ, σX, α, ˜β, σY\n\u0011\n= (2, 3, 0.3, 0.4, 0.5) and\nnumber of groups N = 275 are used as in Section 4.1 although the data is\nnot strictly the same as we used a diﬀerent seed for pseudorandom number\ngeneration in this study. Because the values of ξ2 span a wider interval\nthan those of ξ, the “relative” level of regression error is lower than in\nSection 4.1, since the “signal” is larger in scale than the “noise”.\nAs before, we compare FRODO to two scalar models, one hierarchical\nand one naive. Here, however, it is assumed known in the hierarchical\nmodel that the regression is quadratic in the latent covariates ξ, with no\nlinear term. The naive scalar model here is a GAM rather than a linear\nmodel, with the covariates taken to be the group-level sample means and\nthe unknown regression function modelled as a cubic P-spline with second-\norder penalty.\nBecause the regression function is not one-to-one, an interesting diﬃ-\nculty arises in this framework when the group sizes ni are too small. On\nthe regression side, the distributions are unchanged if ξi is replaced with\n−ξi in a given group. When ni is small and the true ξi is close to zero, the\navailable measurements Xi may not be informative enough to distinguish\nbetween these possibilities6. This creates multimodality in the posterior\n(for the hierarchical scalar model, and for FRODO to a somewhat lesser\nextent) with all of its associated diﬃculties, including poor HMC sam-\npling behaviour and posterior mean estimates that are not particularly\nmeaningful. Thus, larger group sizes are required if one wants meaningful\ninference on the covariate parameters as well as the regression parameters.\nHere, we increase the group size in the simulated data from the n = 20\nused in Section 4.1 to n = 50 for all i. The Xij’s range from -13.76074 to\n17\n−10\n−5\n0\n5\n10\n15\n0\n10\n20\n30\n40\n50\nRegression function\nx\nβ(x)\nFRODO post. mean\nFRODO P.W. 95% C.I.\nTrue function\nHierarchical post. mean\nNaive post. mean\n0\n5\n10\n15\n0\n5\n10\n15\nResponse values\nPredicted responses\nActual responses\n95% P.I.’s\nFigure 3: Results of FRODO applied to data with Gaussian covariates and\na quadratic regression structure.\nLeft: the regression function estimated by\nFRODO, alongside its pointwise 95% credible region, the true function, and\nposterior mean estimates from hierarchical and naive scalar models.\nRight:\nresponses ˆYi predicted by FRODO (along with 95% prediction intervals) vs. the\ntrue response values.\n14.0043, and we expand this range by a small amount in each direction\nfor an assumed density domain of [−13.80644, 14.05]. As before, we ﬁnd\nK = 10 and δi = 0.1 ∀i to be suitable choices here.\nResults for the regression part of the model are shown in Figure 3.\nAt ﬁrst glance, it may appear as though the FRODO estimate of the\nregression function is too attenuated, as it is closer to the estimate from\nthe naive scalar model at the endpoints than it is to the true function and\nthe hierarchical scalar estimate. Note, however, that over 95% of the Xij’s\nlie within the middle six bins, and over 95% of the true latent ξi’s within\nthe middle four.\nIn those regions, the FRODO estimate is quite close\nto the true quadratic regression function. Towards the endpoints where\nthe Xij’s are very sparse, there is much less information with which to\nestimate value of the regression function. This edge eﬀect is readily seen in\nseveral examples in this manuscript by observing that the pointwise C.I.’s\nfor β are wider in regions with few covariate estimates.\nIn the linear\nexample of Section 4.1, this did not create noticeable bias in the actual\nposterior mean for β near the endpoints. Presumably this is because —\nin somewhat informal terms — the covariates in the middle of the domain\nwere suﬃciently informative to constrain the posterior for β to a linear\nshape with high probability, which results in the smoothing parameter τβ\nbeing small with high probability, which, in turn, enforces a linear shape\n6This appears to also depend on the amount of covariate variability withing the group\nrelative to the size of its regression error, although it is not currently clear exactly how this\ndependence works.\n18\n−10\n−5\n0\n5\n10\n15\n0.00\n0.05\n0.10\n0.15\nf 175\nx\nf(x)\nPost. mean\nP.W. 95% C.I.\nTrue density\nXij\n−10\n−5\n0\n5\n10\n15\n0.00\n0.05\n0.10\n0.15\nf 191\nx\n−10\n−5\n0\n5\n10\n15\n0.00\n0.05\n0.10\n0.15\nf 112\nx\nFigure 4: For a selection of groups (from the data with Gaussian covariates and\na quadratic regression structure), the FRODO estimate of the group-speciﬁc\ncovariate density, alongside its pointwise 95% credible region. The true densities\nare superimposed as red lines, and the actual covariate samples are shown as\nrug plots.\nin β with fairly high probability throughout the rest of the domain. In this\nexample, we do not penalize β towards a quadratic shape — only away\nfrom a linear shape. As such, it is not surprising that the posterior for β\nis biased away from the truth near the endpoints, as neither the prior nor\nthe likelihood are very informative there. In principle, one could specify\na third-order random walk prior for β in order to ensure a more genuinely\nquadratic shape, provided one had suﬃcient reason a priori to assume\nthis was an appropriate choice. However, we argue that the second-order\nrandom walk prior used here is more intuitive, as it is formulated in terms\nof deviations from a linear model. At any rate, the heightened bias and\nuncertainty in the FRODO regression function near the endpoints does\nnot create any seriously adverse consequences for the rest of the inference.\nIn particular, the FRODO posterior mean for σY is 0.4734 (95% C.I.\n(0.3849, 0.5643)), much closer to the true value of 0.5 than the estimate\nfrom the naive model (0.8863, 95% C.I. (0.8152, 0.9669)), suggesting that\nFRODO is successfully recovering the true regression model and not the\nbiased naive version. The plot of estimate vs. true responses on the right\nof Figure 3 shows an overall good ﬁt, although there is a small amount of\nbias in the estimates of the lowest responses.\nFigure 4 shows a sample of covariate densities, once again for the\ngroup with the smallest and largest ξi’s, and the ξi closest to the sample\nmean. With larger group sizes, FRODO successfully approximates the\ntrue densities for each group shown here.\n19\n4.3\nExponential covariate densities, linear regres-\nsion model\nAlthough it is useful to model arbitrary regression functions, doing so with\nGaussian covariate distributions is a capability shared by many methods.\nIn fact, authors such as Sarkar et al. [35] have developed Bayesian methods\nwhich allow for even more general structures of the form Xij = ξi + νij.\nThe true advantage of FRODO lies in its ability to handle covariates that\nare not based on any kind of additive error structure. To demonstrate\nthis, here we use an exponential covariate structure:\nλi ∼Gamma (10, 10)\nXij ∼Exponential (λi) ;\nand a linear regression model\nYi = α + ˜βλ−1\ni\n+ ǫi\n= α + Ei\nh\n˜βX\ni\n+ ǫi,\nwhere we have not restated the distribution for the error variance since it\nis identical to (24) for all subsequent studies.\nIt is worth contrasting this framework with that of Section 4.1. There,\nthe true covariate densities were Gaussians with equal variances, so the\ngroup-level responses depended on their locations. With exponential co-\nvariate distributions, the linear regression model implies responses that\ninstead vary with the scales of the densities. This turns out to be a some-\nwhat challenging type of model for FRODO, due to its treatment of β and\nthe fi’s as piecewise constant functions on bins of equal width. When the\ntrue densities are exponential, for any group i it is highly probable that\nmost of the Xij’s will be near 0, with a few very large measurements in\nthe groups with small rates λi. If the dimensionality (equivalently, the\nnumber of bins) K is taken too small, then the groups with large rates will\nall have estimated fi’s with probability mass near one in the ﬁrst bin, and\nmass near zero in the rest. Thus, it is necessary to use a fairly large K\nin order to capture the diﬀerences between these densities. However, this\nintroduces an opposing challenge due to the sparsity of large Xij’s: near\nthe right end of the domain, many of the bins will not contain any covari-\nate measurements, so there is little information with which to estimate\nthe densities — and therefore, the regression function — in that region.\nIn summary, when the density scales diﬀer to this extent, the “resolution”\nof the data varies throughout the domain.\nThe use of unequal-width bins would perhaps mitigate this problem,\nbut recall from Section 2.2 that the P-spline constructions used here\nare predicated on an assumption of equally-spaced “knots” (which, with\nsplines of degree zero, are simply the bin endpoints). Without these, the\nunaltered ﬁnite-diﬀerence penalties on the coeﬃcients no longer serve as\napproximations to derivatives of a suitable order. It then becomes non-\ntrivial to penalize the fi’s towards some predetermined “smooth” shape,\nalthough Li and Cao [26] proposed a method of modifying the P-spline\npenalty in the presence of uneven knots.\nWe do not pursue this here,\n20\n0\n5\n10\n15\n−15\n−10\n−5\n0\nRegression function\nx\nβ(x)\nFRODO post. mean\nFRODO P.W. 95% C.I.\nTrue function\nHierarchical post. mean\nNaive post. mean\n−2.0\n−1.5\n−1.0\n−0.5\n−2.5\n−2.0\n−1.5\n−1.0\n−0.5\nResponse values\nPredicted responses\nActual responses\n95% P.I.’s\nFigure 5: Results of FRODO applied to data with exponential covariates and a\nlinear regression structure. Left: the regression function estimated by FRODO,\nalongside its pointwise 95% credible region, the true function, and posterior\nmean estimates from hierarchical and naive scalar models. Right: responses ˆYi\npredicted by FRODO (along with 95% prediction intervals) vs. the true response\nvalues.\nacknowledging that FRODO in its current state has slightly more diﬃ-\nculty using scale information in the covariate densities than it does using\nlocation or shape information.\nFor this dataset (N = 200 groups, each of size n = 50), we use param-\neter values\n\u0010\nα, ˜β, σY\n\u0011\n= (0.1, −0.9, 0.1). A preliminary visual inspection\nof KDE’s or histograms (not shown) of the covariate data — and the ob-\nservation that they are all strictly positive and highly concentrated near\nzero — justiﬁes a random walk prior of order r = 2 on the densities. In\norder to capture the “high-resolution” diﬀerences between covariate mea-\nsurements near zero as described above, we use a moderately large basis\nof size K = 20. With no reason to suspect severe deviations from this\nshape we once again set δi = 0.1 for all groups. The observed covariates\nrange from 1.3232 × 10−4 to 16.3810. Zero is a natural choice for the left\nendpoint of the assumed domain, and because there are so few large val-\nues, we simply take the right endpoint to be the overall sample maximum\n16.3810.\nThe regression results in the left plot of Figure 5 represent the most\nsigniﬁcant example of the phenomenon discussed in Section 4.2; namely,\nthe heightened uncertainty in the regression function in regions where\ncovariate measurements are sparse. Here, 99.73% of the observed Xij’s\nlie in the left half of the domain, while all of the latent λ−1\ni\n’s lie within\nthe ﬁrst 3 bins. Thus, the pointwise 95% credible interval for β is quite\nnarrow near zero — where most of the covariates are concentrated —\nand becomes signiﬁcantly wider moving from left to right. Once again,\n21\n0\n5\n10\n15\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nf 186\nx\nf(x)\nPost. mean\nP.W. 95% C.I.\nTrue density\nXij\n0\n5\n10\n15\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nf 106\nx\n0\n5\n10\n15\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\nf 28\nx\nFigure 6: For a selection of groups (from the data with exponential covariates\nand a linear regression structure), the FRODO estimate of the group-speciﬁc\ncovariate density, alongside its pointwise 95% credible region. The true densities\nare superimposed as red lines, and the actual covariate samples are shown as\nrug plots.\nwe compare FRODO to two scalar models: a naive linear regression using\nthe of the ¯\nXi’s as ﬁxed covariates, and a hierarchical linear model in which\nthe latent λi’s are jointly inferred with the regression parameters. Once\nagain, the estimated regression function from the hierarchical model is\nvery close to the true function, and the FRODO estimate approximates it\nquite well. Some attenuation bias occurs in the right half of the domain,\nbut because all of the covariate densities have such small mass in this\nregion, this does not seem to adversely aﬀect the regression inference in\nany other signiﬁcant way. Indeed, the right plot of Figure 5 shows that\nthe predicted responses closely align with the true Yi’s.\nAs in previous studies, we compare inferred and true covariate densities\nfor multiple groups in Figure 6. FRODO appears to do a good job of\ncapturing the true densities for small, moderate, and large λi’s, although\nwith no real deviations from the shape imposed by the random walk prior,\nthis is perhaps not surprising.\n4.4\nBeta covariate densities, linear regression model\nIn the following two sections, we demonstrate FRODO’s ability to cap-\nture regression relationships that are encapsulated in the shapes of the\ncovariate densities, rather than their locations or scales.\nWhereas the\ncovariate densities in preceding examples were governed by group-level\nlatent parameters which were random themselves, here those parameters\nare deterministic, allowing us to better control the range of shapes we see.\nIn particular, for this section we take ξ = (ξ1, . . . , ξN) to be a mesh of\nequally-spaced points from 1/10 to 9/10, and\nXij ∼Beta (ξi, 1 −ξi) .\n22\nThe regression model is\nYi = α + ˜βξi + ǫi\n= α + Ei\nh\n˜βX\ni\n+ ǫi.\nThe true densities f ∗\ni are bimodal for all i, with peaks at 0 and 1 and\nminima at 1/2. For small i with ξi < 1 −ξi, the peak on the left is wider\nthan the one on the right, so fi is skewed towards 0 and Ei [X] < 1/2. The\nopposite is true for large i, and for i near N/2 the densities are roughly\nsymmetric.\nFor this simulation, we use N = 250 groups. Because the beta densities\nhave relatively low variance (for the parameter values used here, all of\nthem have variance below 1/8), we use relatively small groups of size\nni = 15 for all i, so that the diﬀerence between the “true” and “naive”\nregression functions is more pronounced7. The true regression parameters\nare\n\u0010\nα, ˜β, σY\n\u0011\n= (0.2, 1, 0.05).\nUpon inspection of the available covariate data, one would see that\nall covariate measurements are constrained to the unit interval, with the\nminimum and maximum measurements being extremely close to 0 and\n1, respectively. Thus, [a′, b′] = [0, 1] is a sensible choice for the assumed\ndomain. Quick visual assessment of KDE or histogram estimates for the\ngroup-speciﬁc covariate densities reveals that they are neither Gaussian\nnor exponential.\nThis observation, combined with the strong evidence\nthat the densities are supported only on the unit interval, may lead one\nto believe that the covariates within each group are, indeed, roughly Beta-\ndistributed. This justiﬁes a random walk prior of order r = 1 on the densi-\nties, for which the limiting shape is a uniform distribution. Note, however,\nthat unlike the examples above for which we used second- and third-order\nrandom walk priors, here the limiting behaviour is unique, in the sense\nthat there is only one uniform density on the chosen domain. Thus, if all\ngroups had small smoothing parameter scales δi (corresponding to a prior\nassumption that no severe deviations from the limiting shape occurred),\nthe FRODO estimates of the covariate densities all would be nearly identi-\ncal, thereby suppressing the diﬀerences between groups and compromising\nthe model’s ability to extract meaningful regression information. With\nan assumed ﬁrst-order random walk prior, one should therefore expect\nthat the covariate densities will exhibit larger deviations from the limit-\ning shape than they would in a situation where r > 1 was appropriate\n(especially since a bimodal shape will be apparent for at least some of the\ngroups upon preliminary visual inspection). Thus, rather than the default\nδi = 0.1 used in previous examples, here we take δi = 1 for all groups.\nFinally, since several groups have most of their covariate measurements\nnear the endpoints (necessitating bins which are narrow enough to cap-\nture diﬀerences in densities within these regions), we use K = 12 bins:\nmore than the 10 used in the Gaussian examples, but less than the 20\nused in Section 4.3 since we do not have enough covariate measurements\n7With large groups, the “naive” regression with group-level covariate sample means would\nbe quite close to the true model, making it diﬃcult to tell which one FRODO was capturing.\n23\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n−0.4\n−0.2\n0.0\n0.2\n0.4\nRegression function\nx\nβ(x)\nFRODO post. mean\nFRODO P.W. 95% C.I.\nTrue function\nHierarchical post. mean\nNaive post. mean\n0.4\n0.6\n0.8\n1.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\nResponse values\nPredicted responses\nActual responses\n95% P.I.’s\nFigure 7: Results of FRODO applied to data with beta-distributed covariates\nand a linear regression structure. Left: the regression function estimated by\nFRODO, alongside its pointwise 95% credible region, the true function, and\nposterior mean estimates from hierarchical and naive scalar models.\nRight:\nresponses ˆYi predicted by FRODO (along with 95% prediction intervals) vs. the\ntrue response values.\nper group to support such a large number of bins (especially since “rough-\nness”, or deviation from the random walk shape, is penalized less severely\nhere).\nOnce again, the regression component of the model is visualized in\nFigure 7, alongside posterior mean estimates from naive and hierarchi-\ncal scalar models In contrast to previous datasets, here there are more\ncovariate measurements at each endpoint of the domain than there are\nin the middle, leading to a slight “bulge” in the pointwise 95% credi-\nble interval around 0.5.\nHowever, each bin is relatively well-populated\nwith observations, compared to the large diﬀerences in concentration seen\nin previous examples. It is visually obvious that FRODO captures the\ntrue regression function and not the naive one. The plot of predicted vs.\ntrue responses on the right of Figure 7 provides further conﬁrmation that\nFRODO’s regression inference is satisfactory here.\nFigure 8 shows that FRODO has more diﬃculty inferring the true den-\nsities here than for previous examples. Although the asymmetrical shapes\nfor ξi’s near 0.1 or 0.9 are captured, the steep curvature of the true den-\nsities near the endpoints in these cases results in them being near the\nedges of the model’s pointwise 95% credible intervals — if not excluded\naltogether — in these regions.\nFrom the middle plot, we see that the\nmodel imposes a somewhat excessive degree of uniformity on the nearly-\nsymmetric densities for which ξi is near 0.5.\nThese diﬃculties are not\nsurprising: given the small group sizes and the fairly large values used for\nK and the δi’s, neither the prior nor the likelihood make very strong im-\n24\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0\n2\n4\n6\n8\n10\nf1\nx\nf(x)\nPost. mean\nP.W. 95% C.I.\nTrue density\nXij\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0\n2\n4\n6\n8\n10\nf 125\nx\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0\n2\n4\n6\n8\n10\nf 250\nx\nFigure 8: For a selection of groups (from the data with beta-distributed covari-\nates and linear regression structure), the FRODO estimate of the group-speciﬁc\ncovariate density, alongside its pointwise 95% credible region. The true densities\nare superimposed as red lines, and the actual covariate samples are shown as\nrug plots.\nplications about the density shapes. Aside from collecting more covariate\nmeasurements for each group (i.e. strengthening the likelihood), the only\nother possible mitigation for this would be to strengthen the prior: either\nby using smaller δi’s to more strictly enforce the uniform shape, or by\nusing a smaller K to reduce the dimensionality of the problem. However,\nas discussed above, both of these options would result in an obfuscation\nof any information that does exist in the available covariate data. Thus,\nthe most prudent choice seems to be accepting that FRODO’s density in-\nference in this example is necessarily limited to some degree. Fortunately,\nthis limitation does not adversely aﬀect any of the inference on the regres-\nsion side of the model. Furthermore, despite the relative “roughness” of\nthe FRODO density estimates8, they are certainly improvements over, say,\n“raw” histograms (corresponding to δi →∞), for which the low amount\nof covariate data would result in even less interpretable shapes.\n4.5\nBeta covariate densities, nonlinear regression\nmodel\nAlthough the previous example shows that FRODO can extract relation-\nships based on the shapes of covariate densities, the regression model itself\nstill ultimately depended only on the means of the covariate measure-\nments. The non-additive structure of the Xij’s would pose a challenge\nfor many established multilevel methods, but it is conceivable that one\ncould devise a nonparametric, hierarchical Bayesian method which jointly\n8Note that this is an inherent diﬃculty in any dataset for which the ﬁrst-order random\nwalk prior is justiﬁed, because imposing smoothness in this case is inseparable from forcing\nall of the densities towards being identical.\n25\ninferred the Ei [X]’s while using them to recover the correct regression\nparameters, subverting the need for full functional regression on the den-\nsities. When the regression is not linear, this may not be the case. Thus,\nin this section we combine a nonadditive covariate structure with a nonlin-\near regression model to demonstrate the full generality of FRODO. Once\nagain ξ is a mesh of equally-spaced points, this time from 1/10 to 2, and\nXij ∼Beta (ξi, ξi) ,\nYi = α + ˜β\n\u0012\n1 +\n1\n2ξi + 1\n\u0013\n+ ǫi\n= α + Ei\n\"\n4˜β\n\u0012\nX −1\n2\n\u00132#\n+ ǫi.\n(25)\nHere, the regression function is β∗(x) = 4˜β(x −1/2)2. The f ∗\ni ’s are all\nsymmetric: bimodal and U-shaped for i near 1, roughly uniform for i\nnear N/2, and peaked at 1/2 for i near N. For positive ˜β, the expected\nresponse Ei [Y ] is higher for “more bimodal” covariate densities and lower\nfor “more unimodal” ones. The regression is therefore entirely dependent\non the shapes of the densities, not their locations or scales. Furthermore,\nbecause the densities are all symmetric it holds that E∗\ni [X] = 1/2 for all\ni. Thus, any modelling approach targeting β (Ei [X]) (“regression on the\nexpectaton”) will be unsuitable here9, as opposed to FRODO with its use\nof “the expectation of the regression”, Ei [β (X)]. In every aspect, this\nparticular data structure is decidedly “non-classical”, and FRODO seems\nuniquely well-suited to handle such a structure.\nBecause the true covariate densities all have expectation equal to 1/2,\nthe regression function is actually not unique: indeed, when the f ∗\ni ’s are\nall symmetric Beta densities, (25) is equivalent to α + E\nh\n4˜βX2i\n+ ǫi, up\nto a term which is constant with respect to i.\nThis does not seem to\nbe a problem in practice, however: even when HMC chains are explicitly\ninitialized such that β is close to the latter form, they converge to a\nposterior which is consistent with (25). We conjecture that the FRODO\nposterior concentrates around the form of the regression function with\n“lowest error”: empirically, we observed that the within-group sample\nmeans of (Xij −1/2)2 values provide much more accurate estimates of\ntheir population analogues than the within-group sample means of the\nX2\nij’s.\nFor this example, we simulated a dataset with N = 250 groups, each\ncontaining n = 60 covariate measurements. The true regression parame-\nters were\n\u0010\nα, ˜β, σY\n\u0011\n= (0.7, 1, 0.1). As in Section 4.4, the observed range\nof the covariate measurements provides strong evidence that [0, 1] is a\ngood choice for the assumed density domain. Here, the range of shapes\n9In theory, one could invoke a measurement error method with more general assumptions\non the covariate structure. Recall from 1 that the frequentist approach of Hu and Schennach\n[22] described in Section 1 assumed a general functional mapping the f∗\ni ’s to the ξi’s. Although\nhigher-order moments should be permissible under their assumptions, the authors required\na known functional. Thus, even with their level of generality it would still be necessary to\nassume quadratic regression a priori.\n26\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n−0.5\n0.0\n0.5\n1.0\nRegression function\nx\nβ(x)\nFRODO post. mean\nFRODO P.W. 95% C.I.\nTrue function\nHierarchical post. mean\nNaive post. mean\n2.0\n2.2\n2.4\n2.6\n1.8\n2.0\n2.2\n2.4\n2.6\n2.8\nResponse values\nPredicted responses\nActual responses\n95% P.I.’s\nFigure 9: Results of FRODO applied to data with beta-distributed covariate\ndata and a quadratic regression structure. Left: the regression function esti-\nmated by FRODO, alongside its pointwise 95% credible region, the true func-\ntion, and posterior mean estimates from hierarchical and naive scalar models.\nRight: responses ˆYi predicted by FRODO (along with 95% prediction intervals)\nvs. the true response values.\nin preliminary histograms or KDE’s (from bimodal, to roughly uniform,\nto unimodal) gives further justiﬁcation for a random walk prior of order\nr = 1. As in the previous section, we take δi = 1 for all i to allow a\ngreater degree of deviation from the limiting (uniform) shape of the prior.\nBecause the data is highly concentrated near the endpoints for the groups\nwhose ξ-values are low (even moreso than in Section 4.4’s dataset), we use\na basis of size K = 15.\nDue to the aforementioned uselessness of methods involving “regres-\nsion on expectations” here, constructing scalar models to compare with\nFRODO is nontrivial. We cannot use a “naive GAM” as we did for the\nGaussian quadratic model in Section 4.2. There, Ei\n\u0002\nX2\u0003\nand (Ei [X])2\ndiﬀered by a constant, but this is not the case here. Thus, the naive scalar\nmodel we use for comparisons is somewhat contrived: a linear regression\nmodel, using the within-group sample means of the (Xij −1/2)2 values\nas covariates. As always, the hierarchical scalar model assumes the true\nforms of the regression function and covariate densities are all known,\njointly inferring the ξi’s and all regression parameters.\nBecause of the relatively large group sizes, and the fact that the\nquadratic form of the regression function was assumed known in both\nscalar models, the naive model does not suﬀer from any appreciable at-\ntenuation bias.\nAs shown on the left of Figure 9, both it and the hi-\nerarchical scalar model approximate the true regression function almost\nperfectly. Some bias is apparent in the FRODO estimate, particularly\nnear the vertex at 1/2, but its pointwise 95% credible interval almost\n27\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0\n1\n2\n3\n4\n5\n6\nf1\nx\nf(x)\nPost. mean\nP.W. 95% C.I.\nTrue density\nXij\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0\n1\n2\n3\n4\n5\n6\nf 126\nx\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n0\n1\n2\n3\n4\n5\n6\nf 250\nx\nFigure 10: For a selection of groups (from the data with beta-distributed co-\nvariates and quadratic regression structure), the FRODO estimate of the group-\nspeciﬁc covariate density, alongside its pointwise 95% credible region. The true\ndensities are superimposed as red lines, and the actual covariate samples are\nshown as rug plots.\ncompletely captures the true function. On the right side of Figure 9, we\nsee a moderate “clumping” of predicted responses just over 2.0, where the\nvariability in the actual Yi’s exceeds that of the mean predictions from\nFRODO. These values correspond to groups with ξ-values near 1 (i.e.\nthose whose true covariate densities f ∗\ni are close to uniform). For this\ndataset, it appears that FRODO has a small amount of diﬃculty captur-\ning small shape diﬀerences between nearly-uniform densities. Note also\nthat a few groups have posterior 95% prediction intervals which exclude\ntheir observed responses, although it seems reasonable to attribute this to\nmere random chance given the large number of groups. In any case, the\noverall ﬁt appears largely satisfactory, especially considering that the true\nforms of the regression function and covariate densities are not known a\npriori.\nFigure 10 shows that FRODO roughly captures all three types of den-\nsity shapes present in this data, although some excess noise and bias is\nevident in the posterior estimates.\nThis is particularly evident for the\nunimodal density in the right plot.\nAlthough the true density is fully\ncontained in the pointwise 95% credible interval, the posterior mean is\nperhaps somewhat too ﬂat. The true unimodal densities in this dataset\ncertainly diﬀer more subtly from the uniform shape than the bimodal ones\n(contrast the true density in the left plot of Figure 10 with that on the\nright) — since the prior on densities here is structured only in terms of\n“deviations from uniformity”, this slight deﬁciency is not entirely unex-\npected. As in Section 4.4, some of the excess noise in the density inference\nis an unavoidable consequence of the larger values of K and δ necessary\nto capture the shapes and ﬁne structure of the true densities with the\nﬁrst-order prior.\n28\n5\nExtended simulation study:\nFRODO\nwith varying group sizes and a group-level\ncovariate\nAs a ﬁnal “application” of FRODO, we recreate the simulated data con-\nsidered by Croon and van Veldhoven [11]. This is very much a “classi-\ncal” model, with Gaussian covariate data and a linear regression function\nmuch like the one considered in Section 4.1.\nHowever, there are three\nunique features here which were absent from the “toy” examples explored\nabove. First (recalling the notation of (21–24)), the parameter values are\n\u0010\nσξ, σX, α, ˜β, σY\n\u0011\n=\n\u00001, 3, 0.3, 0.3,\n√\n0.35\n\u0001\n: not only is the within-group\nvariability of the Xij’s much greater than the between-group variability\nof the true ξi’s, but the regression error is also quite high, accounting\nfor just under 65% of the variability in the Yi’s.\nOverall, the amount\nof “signal” in the data — at both the covariate and regression levels —\nis low relative to the amount of noise. Second, there are varying group\nsizes, some of which are quite small: out of N = 100 groups, roughly 50%\n(randomly selected with probability 1/2) contain ni = 10 covariate mea-\nsurements, and the rest contain ni = 40. Finally, the actual regression\nmodel is altered from the basic FRODO form considered thus far, with\nthe inclusion of a “scalar” group-level covariate Z as in (1):\nYi = α + ˜βξi + βZZi + ǫi.\n(26)\nThe covariate values Zi are generated from a standard Normal distribu-\ntion, independently of ξ, and are treated as ﬁxed observations.\nIt is straightforward to extend FRODO to accommodate for Z by\nputting a N (0, 20σY ) prior on βZ, conditionally independent from the\nprior for β (which still denotes the regression function corresponding to the\ngroup-speciﬁc densities of the Xij’s). We use a third-order random walk\nprior on the fi’s with K = 10 bins as in Section 4.1, since the available\ndata gives no reason to suspect that ﬁner structures need to be captured.\nDue to the relatively small amount of covariate measurements, we simply\ntake the assumed domain [a′, b′] to be the range of observed Xij-values,\nwhich in this case is [−12.0365, 11.2258]. For the groups of size ni = 40,\nthe default smoothing prior scale choice δi is appropriate, but with only\nni = 10 observations in the smaller groups, a tighter prior is necessary to\nensure posterior density estimates with useful shape information. Thus,\nwe set δi = 0.05 for the small groups.\nThe actual method proposed by Croon and van Veldhoven [11] for\nmicro-macro modelling is frequentist and involves a stepwise estimation\nprocedure. An R implementation exists [27], but here we are only inter-\nested in comparing FRODO to analogous scalar Bayesian methods. Thus,\nas in the studies of Section 4 we compare it to both a naive and hierar-\nchical scalar model, trivially extended to accommodate Z and place a\nprior on βZ. These results are shown in the left plot of 11. Note how\nmuch wider the pointwise 95% credible interval is — particularly near\nthe endpoints — than the one in the similar model of Figure 1, owing\nto the higher noise and smaller amount of available covariate data here.\n29\n−10\n−5\n0\n5\n10\n−6\n−4\n−2\n0\n2\n4\nRegression function\nx\nβ(x)\nFRODO post. mean\nFRODO P.W. 95% C.I.\nTrue function\nHierarchical post. mean\nNaive post. mean\n−0.5\n0.0\n0.5\n1.0\n−2\n−1\n0\n1\n2\nResponse values\nPredicted responses\nActual responses\n95% P.I.’s\nFigure 11: Results of FRODO applied to data with Gaussian covariates, a linear\nregression structure, and an additional group-level scalar covariate. Left: the\nregression function for the multilevel covariate estimated by FRODO, alongside\nits pointwise 95% credible region, the true function, and posterior mean esti-\nmates from hierarchical and naive scalar models. Right: responses ˆYi predicted\nby FRODO (along with 95% prediction intervals) vs. the true response values.\nIt appears that the posterior for FRODO has concentrated somewhere\nin between the true and naive regressions. Indeed, FRODO’s posterior\nmean for σY is 0.5987 (95% C.I. (0.5182, 0.6972)), in contrast with 0.5857\nfrom the hierarchical scalar model (95% C.I. (0.5053, 0.6834)) and 0.6130\nfrom the naive scalar model (95% C.I. (0.5370, 0.70234)). Given that the\ndataset is fairly small and high in noise, it is perhaps unsurprising that\nFRODO struggles more than it did in previous studies. However, this\nseems to be a problem of variability, not of bias: other simulated datasets\nwith the exact same parameters, group sizes, and number of groups re-\nsulted in FRODO estimates with diﬀering amounts of attenuation (not\nshown). Even the scalar hierarchical model proved quite variable with\nother datasets, as its estimate of the regression function did not always\nalign as closely with the true function as it does here. Although the high\ndegree of noise in the right plot of Figure 11 may appear troubling, this\nis reﬂective of the actual amount of noise in the data: a plot of predicted\nvs. actual responses from a frequentist multiple linear regression using the\ntrue ξi’s appears similar.\nThe usual density plots are shown in Figure 12. Note that the group\nin the left plot contains 40 individuals, and the other two contain only\n10.\nIt is intuitive that the smaller groups would have wider pointwise\ncredible intervals for their densities (on further inspection, this pattern\nalso seemed to hold for other groups not shown here), although it is some-\nwhat noteworthy that the smaller δi-values for these groups do not seem\nto neutralize this eﬀect. Some bias in the model is evident, particularly\n30\n−10\n−5\n0\n5\n10\n0.00\n0.05\n0.10\n0.15\nf61\nx\nf(x)\nPost. mean\nP.W. 95% C.I.\nTrue density\nXij\n−10\n−5\n0\n5\n10\n0.00\n0.05\n0.10\n0.15\nf 5\nx\n−10\n−5\n0\n5\n10\n0.00\n0.05\n0.10\n0.15\nf 56\nx\nFigure 12: For a selection of groups (from the data with Gaussian covariate\ndata, a linear regression structure, and an additional group-level covariate), the\nFRODO estimate of the group-speciﬁc covariate density, alongside its pointwise\n95% credible region. The true densities are superimposed as red lines, and the\nactual covariate samples are shown as rug plots.\nin the middle plot, but overall the inference provided by FRODO seems\nreasonable.\n6\nDiscussion\nIn this paper, we have presented a new approach for micro-macro mod-\nelling which combines density estimation and functional data analysis into\na uniﬁed hierarchical Bayesian framework. Although FRODO is relatively\nsimple in principle due to its use of step functions and only linear func-\ntional regression terms, it is deceptively powerful in its ability to use these\nelements for approximation of generalized additive models. Beyond the\ngenerality of the regression component of the model, FRODO is also quite\nﬂexible in terms of the individual-level covariate structures it can accom-\nmodate. Whereas many Bayesian methods for GAM’s with measurement\nerror or micro-macro structure assume a Gaussian — or at the very least,\nadditive — error structure in the Xij’s, FRODO has no such limitation,\nallowing for covariate densities which inﬂuence the group-level regression\nresponses through their locations, scales, or shapes. All that is required\nis the selection of a suitable prior structure for the densities, based on\neither prior domain knowledge, or — if this is not possible and an empir-\nical Bayesian approach is required — a preliminary heuristic examination\nof the data. Although FRODO’s inference on the covariate densities is\ngenerally more accurate when the true densities adhere to the speciﬁed\n“smooth shape” encoded in the prior, this is not a strict requirement pro-\nvided hyperparameters are chosen carefully.\nThe simulation studies conducted above show that the power and gen-\nerality of FRODO translate from theory to practice, providing reasonable\n31\ninference for a variety of data structures. However, the potential for im-\nprovements and extensions to the model is vast.\nThe most immediate\npotential for this is in the density part of the model, as described in\nSection 3.2. Here we have not considered rth-order random walk priors\nfor any integer r > 3. These would result in densities being penalized\ntowards exponentiated polynomials of higher degree: with an rth-order\nrandom walk prior, log fi(x) is close to a polynomial of degree r −1 when\nthe smoothing parameter τi is small. Such limiting smooth shapes corre-\nspond to generalized error distributions [43] (or folded versions thereof)\nwith shape parameter r −1, of which the Normal, Laplace, and uniform\ndistributions are special cases. For r > 2, the generalized error distribu-\ntion has lighter tails than a Gaussian. It is not certain how useful such\nhigher-order random walk priors would be in practice (i.e. how often one\nmight expect covariate densities to be similar to, say, an exponentiated\nquartic), but one challenge in implementing these would be determining\nsuitable distributions for the “free parameters” θik, 2 ≤k ≤r. Equivalent\nderivations of the type carried out for r = 2 and 3 in Section 3.2 would\nbe much more complex.\nThere is even room for generalization within the conﬁnes of the third-\norder (resp. second-order) random walk priors considered here. Although\nthe construction in Section 3.2 was explicitly tailored in terms of Gaussian\n(resp. exponential) distributions, in principle it could be adapted for any\ndensities whose logarithms are roughly quadratic (resp. linear) in shape.\nFolded or truncated Normal distributions may be a useful shape to ac-\ncommodate with a third-order random walk prior; one could even modify\nit to allow for densities f such that log f is approximately quadratic with\npositive leading coeﬃcient, not negative as for a Gaussian. This may be\nuseful for modelling “U-shaped” densities, such as the Beta distributions\nconsidered in Section 4.4.\nSimilarly, the second-order structure could\nbe generalized to allow for positively-sloped densities (i.e. “reversed” ex-\nponentials), or Laplace densities whose logarithms are piecewise linear.\nFurthermore, it may be useful to combine diﬀering random walk orders\nwithin the same model. For instance, the example in Section 4.5 might\nhave beneﬁted if we used a third-order random walk prior for the uni-\nmodal densities (since symmetric Beta densities are close to Gaussians in\nshape for large parameter values), a ﬁrst-order R.W. prior for the ﬂat-\nter densities, and perhaps an “inverted” third-order R.W. prior for the\nU-shaped densities as suggested above.\nFurther investigation of the relationships between n, r, K, and δ would\nalso be useful, particularly how best to set the latter two in terms of the\nformer two.\nAlthough the empirical heuristic methods employed here\nworked well in practice, a more formal approach might result in bet-\nter performance and generalization. Appeals to asymptotics could guide\nderivation of mathematical relationships between the hyperparameters:\nfor instance, an expression for an “optimal” δi in terms of r, K, and ni,\nbased on the “big-O” relationships shown by Silverman [38] to guarantee\nconvergence of penalized density estimators in the frequentist setting. The\nchoice of the assumed domain for the densities may also have an eﬀect on\nany such expressions.\nOn the subject of “big-O” considerations, recall that the diﬀerence be-\n32\ntween the “true” and “proxy” models ((7) and (9), respectively) was swept\nunder the rug, with a passing acknowledgement that a truly formally valid\ntreatment would consider a combined error (11) accounting for the use of\nﬁnite-dimensional approximation in this nonparametric setting. Further\nstudy of this approximation error – including its large-sample behaviour\n– would be of interest.\nThere is also signiﬁcant potential for generalizations on the regression\nside of the model. The most immediate of these is the realization of our\nproposed extension to non-Gaussian responses such as count or categorical\ndata. Just as the regression part of FRODO for the Gaussian responses\nconsidered here is nothing more than a functional linear model, allow-\ning for other response types is simply a matter of using functional GLM\nmachinery.\nPerhaps the most useful immediate extension to FRODO would be\nthe incorporation of multiple multilevel covariates.\nIndeed, many real-\nworld micro-macro datasets include several covariates measured at the\nindividual level within groups [e.g 11, 2, 12]. Of course, this would increase\nthe computational complexity of FRODO, as the number of parameters\nto infer grows roughly linearly in the number of multilevel covariates.\nNote, however, that real-world micro-macro datasets commonly include\nordinal covariates with a small number of levels [e.g. 2, 12]. Modelling the\ndistributions for these covariates requires only as many basis functions as\nthere are levels, which would mitigate computational diﬃculty to some\nextent in practice.\nA powerful yet challenging improvement would be modelling more\ncomplex relationships amongst covariates. For instance, Croon and van\nVeldhoven [11] considered a version of the simulation study replicated in\nSection 5 where the latent and observed group-level covariates (ξ and Z,\nrespectively) were correlated [see also measurement error literature such\nas 33]. Accounting for dependence between multilevel and “scalar” co-\nvariates in FRODO will be highly nontrivial, especially if one wishes to\nmaintain ﬂexibility in the shapes of the inferred densities. For instance, if\nthe multilevel data is Gaussian as in Section 5, the most obvious way to\naccount for correlation between ξ and Z is to explicitly include it in the\nprior for the ξi’s (see Section 3.2). However, we have found in practice\nthat the ξi’s inferred by FRODO are often poor approximations for the\nactual latent group means of the Xij’s, unless a Gaussian shape is heav-\nily enforced on the fi’s by deliberately taking very small δi’s. This was\nnot a problem for the examples in Sections 4.1 and 4.2, as the posterior\ndensity estimates ended up being close enough to the true Gaussians that\nthere were no major diﬃculties in the inference. If such latent density\nparameters are required more explicitly to model correlations with scalar\ncovariates, this inaccuracy may become problematic. The potential for\ndependence between distinct multilevel covariates is arguably even more\ninteresting. Presumably this would require regression on multiple integrals\nover their joint densities. However, even with the degree-zero splines con-\nsidered here, this would result in a substantial increase in computational\ncomplexity. Indeed, the number of coeﬃcients required to model the joint\ndensity of d multilevel covariates for a single group in this way is exponen-\ntial in d. Therefore, some type of simpliﬁcation would likely be required\n33\nto make interactions between multilevel covariates viable. See Lambert\nand Eilers [23] for a discussion of multivariate density estimation with\nsplines in the case of a single density.\nWe conclude by acknowledging potential shortcomings in FRODO for\nwhich there are likely no solutions, either due to the inherent properties of\nthe model or the excessive computational diﬃculty that would be required\nto solve them. First, one may question the use of piecewise constant basis\nfunctions, since higher-order splines would certainly result in smoother\nand better-behaved density estimates. However, recall from Section 3.3\nthat this choice was made partially for computational convenience: it\nensures that the integral of β · fi is simply the inner product of the two\nfunctions’ coeﬃcients. This is no longer the case with higher-order splines,\nfor which the integrals are more complicated expressions involving prod-\nucts between neighbouring coeﬃcients. Beyond the heightened complex-\nity, we also found in preliminary experiments that the resulting posterior\ngeometry was extremely diﬃcult to navigate with NUTS. Note that these\nexperiments modelled the densities themselves with higher-degree splines,\nrequiring (among other things) a potentially costly softmax transforma-\ntion of each θi vector. The other possibility is modelling the logarithms\nof the densities with splines [e.g. 29]. These approaches are equivalent\nfor degree-zero splines, but with higher degrees the logarithmic approach\nrequires approximate numerical integration to normalize the fi’s, which\nare exponentiated piecewise polynomials. These numerical integrals, in\nturn, depend on the spline coeﬃcients in complex ways which would likely\ncomplicate the posterior geometry even further. Thus, unless a radically\ndiﬀerent approach is used to ﬁt the model, higher-order splines do not\nseem to be worth the eﬀort, given the satisfactory results obtained with\npiecewise constant functions and the prevalence of ordinal covariates in\nreal-world micro-macro data.\nIn earlier experiments (not shown), we found problems with bias and\nsampling eﬃciency when the within-group covariate noise was large rel-\native to either the regression noise or between-group covariate scale. In\nthe notation of the Gaussian model, problems occurred when the ni’s\nwere small and σX was large relative to either σξ or σY , especially when\nthe magnitude of the eﬀect size ˜β was large. This problem also aﬀected\nhierarchical scalar models — suggesting that there is innate diﬃculty in\nthe posteriors induced by such datasets — but FRODO did seem slightly\nmore sensitive to it, in the sense that some parameter combinations were\nproblematic for FRODO but not for a scalar model. These problems could\nbe mitigated with diﬀerent prior choices such as a zero-avoiding prior for\nσY , but these can create bias [15]. Fortunately, we suspect that the rel-\native noise levels which tend to create problems are unlikely to occur in\npractice, as they imply either extremely low-error regression models or\nhigh-error covariate groups.\nFinally, it bears repeating that FRODO only models responses in\nterms of expectations of functions of covariates: any regression relation-\nship that cannot be expressed in the form (8), or some multivariate ex-\ntension thereof, is incompatible with this methodology.\nIn particular,\nresponses which depend on the medians or modes of densities cannot be\nmodelled with FRODO, requiring other methods speciﬁcally suited for\n34\nthose purposes [e.g. 22]. Its current inability to model functions of expec-\ntations may also be a shortcoming. For instance, if the data in Section\n4.2 was modiﬁed so that the covariate densities had unequal variances and\nthe group-level responses were proportional to these variances, FRODO\nwould not be usable due to the nonconstant (Ei [X])2 term in the regres-\nsion. One could potentially augment (8) with an “outer function”, using\nterms of the form g (Ei [β (X)]) with some unknown function g to be mod-\nelled with a basis function expansion. However, this would likely create a\nlitany of problems with unidentiﬁability.\nDespite these challenges, we believe that FRODO’s power and ﬂex-\nibility make it a strong addition to the ﬁeld of micro-macro regression\nmodelling, especially as improvements and extensions are developed to\nhandle an even broader variety of data structures.\nAcknowledgements\nShaun McDonald wishes to thank the defense committee who reviewed\nthe Ph.D. thesis in which this work originally appeared.\nDeclarations\nThis manuscript is largely an adaptation of work originally included in\nShaun McDonald’s doctoral thesis [28].\nConﬂict of interest\nThe authors have no conﬂicts of interest to report.\nFunding\nDuring the time of this work, Shaun McDonald was aﬃliated with Si-\nmon Fraser University and supported by an NSERC Alexander Graham\nBell Canada Graduate Scholarship. Alexandre Leblanc, Saman Muthuku-\nmarana, and David Campbell are also supported by NSERC.\nAppendix A\nDetails of the implementa-\ntion of FRODO in Stan\nThis appendix expands on the brief discussion in Section 3.4 regarding the\nStan implementation of FRODO. We explain our method of initializing\nHMC chains, detail the parameter values used in the NUTS sampler, and\nassess the sampling behaviour of the simulation studies in Sections 4–5.\nThe reader may also refer to our source code at https://github.com/ShaunMcDonald1021/FRODO.\nThis appendix will assume the reader is familiar with Stan, and the\nterminology associated with implementation and assessment of models\ntherein. However, references to relevant Stan documentation are included\nwhere appropriate.\n35\nA.1\nReparameterizations\nIt is known that Stan’s sampling behaviour can suﬀer in the presence of\ndiﬃcult posterior geometries: for instance, when the posterior has heavy\ntails or nonlinear correlations between parameters [40, Section 25.7 of the\nUser’s Guide and references therein]. Following standard advice [ibid.],\nwe use non-centered parameterizations for various parameters.\nBrieﬂy,\nthis means restating the target distribution (i.e. the posterior) in terms of\nparameters which do not have the same hierarchical dependence structures\nas in the original parameterization, thereby inducing a posterior geometry\nmore amenable to HMC. The parameters of interest (see Sections 3.2–\n3.3) are then recovered as deterministic functions of the ones actually\nsampled. Additionally, the error variance σY is expressed as the ratio of\na half-normal random variable and a Gamma random variable with shape\nparameter 2, neither of which have the type of heavy tails which are often\nproblematic in NUTS [40].\nThe full details of the reparameterizations\nused are described in the comments of the source code referenced above.\nA.2\nInitialization of chains\nBy default, Stan initializes all parameters uniformly in the range [−2, 2]\n(for positive parameters, this is done on the logarithmic scale) [8]. This\nproved to be a problem for the densities: the default scheme, in conjunc-\ntion with the reparameterizations discussed in Section A.1, almost always\nresulted in initial density estimates for which the logarithm of the poste-\nrior was inﬁnite. It is not known how often these were “genuine” inﬁnities\nas opposed to mere numerical overﬂow, but in either case the result is an\ninability to obtain posterior samples.\nThe problem appears to be related to the random walk structure of\nthe θi’s, which are encoded into the Stan model through a linear trans-\nformation of “non-centered” parameters.\nThis transformation tends to\n“magnify” the variability in the default initial values to the extent that\nthe initial φi’s are severely mismatched with the likelihood of their cor-\nresponding covariate data (see Section 3.2).\nThus, we use a modiﬁed\ninitialization strategy based on preliminary frequentist estimates for the\nfi’s. These are obtained using P-splines and Poisson regression models\nfor the bin counts in each group, as proposed by Eilers and Marx [13,\nSection 8]. These are then “inverse-transformed” to obtain initial values\nfor the parameterization used in Stan. A modest amount of randomness\n— Gaussian noise for the θi’s, and Gamma-distributed initial values for\nthe τi’s and scale components for the “free parameter” means deﬁned in\nSection 3.2 — is injected into the initialization to ensure that the starting\npoints of the HMC chains are reasonably diﬀuse [16].\nA.3\nParameters of NUTS samplers\nSampling in Stan depends on several “parameters10” which govern the be-\nhaviour of the NUTS algorithm. Section 15.2 of the Stan Reference Man-\nual [40] explains these parameters, and further details on their implica-\ntions for sampling performance are discussed in the vignette at https://mc-stan.org/misc/warnings.html.\n36\nStudy\nMax. warmup time\nMax. sampling time\nMin. nEﬀ\nMax. ˆR\n4.1\n654.280\n486.304\n572.618\n1.004\n4.2\n1350.34\n2168.11\n996.3261\n1.007\n4.3\n719.058\n1108.260\n1036.961\n1.004\n4.4\n447.584\n831.499\n857.6613\n1.007\n4.5\n509.821\n702.896\n1022.321\n1.006\n5\n99.554\n89.056\n622.911\n1.009\nTable 1: Various quantities quantifying the performance and sampling behaviour\nof FRODO, for each of the simulated datasets in Section 4.\nDue to the complexity of FRODO’s posterior geometry, we found it\nnecessary to use maximum tree depths and target Metropolis acceptance\nrates which were higher than the defaults (10 and 0.8, respectively). In\nall of the simulation studies shown in Sections 4–5, we used a maximum\ntree depth of 12. The target acceptance rate was set to 0.99, except in\nthe studies with Gaussian covariate data, where it was set to 0.985. For\neach study, we ran four NUTS chains in parallel. Each chain was run for\n750 warmup iterations, then 1250 sampling iterations.\nA.4\nBehaviour of simulation runs\nIn Table 1, we summarize the performance of the samplers for each of the\nsix simulation studies in Section 4. Each study is denoted by the section\nin which it appears, and the following information is included for each\none.\n1. The maximum warmup time (in seconds) for any of the four chains,\n2. the maximum sampling time (in seconds) for any of the four chains,\n3. the smallest estimated [44] eﬀective sample size (nEﬀ) for any pa-\nrameter in the model, and\n4. the maximum split ˆR value for any parameter in the model [44].\nNote that the reported nEﬀ(resp. ˆR) is the minimum (resp. maximum)\nover the actual sampled parameters and the “true” model parameters\nobtained with transformations (see Section A.1). All simulations were run\non an Acer laptop with 16 GB of RAM and four Intel i5-9300H 2.40GHz\nCPU cores.\nIn every simulation study, all parameters had eﬀective sample sizes\nexceeding 450. Vehtari et al. [44] recommend a threshold of at least 550\neﬀective samples per parameter, so we are conﬁdent that ours are large\nenough for inference to be reasonably accurate. Vehtari et al. [44] recom-\nmends considering split ˆR values above a threshold of 1.01 to be indica-\ntive of convergence problems, and no values in our studies exceeded this\nthreshold.\n10Not to be confused with the “parameters” whose posterior is the target of inference.\nIn Section A.3, the word “parameters” refers only to the “sampling parameters” discussed\ntherein.\n37\nStudy\nTrue\nFRODO\nHierarchical scalar model\nNaive scalar model\n4.1\n0.5\n0.493 (0.442, 0.547)\n0.490 (0.438, 0.545)\n0.555 (0.511, 0.603)\n4.2\n0.5\n0.473 (0.385, 0.564)\n0.479 (0.416, 0.550)\n0.886 (0.815, 0.967)\n4.3\n0.1\n0.100 (0.073, 0.128)\n0.097 (0.070, 0.123)\n0.165 (0.150, 0.182)\n4.4\n0.05\n0.065 (0.054, 0.077)\n0.055 (0.046, 0.065)\n0.089 (0.082, 0.098)\n4.5\n0.1\n0.094 (0.084, 0.105)\n0.099 (0.090, 0.109)\n0.101 (0.093, 0.111)\n5\n0.592\n0.599 (0.518, 0.697)\n0.586 (0.505, 0.684)\n0.613 (0.537, 0.704)\nTable 2: Posterior inference for σY (the regression error) from FRODO and the\nscalar models within each simulation study. For each model, the posterior mean\nis reported, as is a 95% credible interval in parentheses. The second column\nfrom the left shows the true σY .\nAs one would expect given FRODO’s complexity, warmup and sam-\npling are several times slower than they are for the corresponding scalar\nmodels used in the simulation studies (not shown). The only study whose\ncomputation time we would consider problematic is the one from Section\n4.2, with Gaussian covariate data and a quadratic regression structure.\nIncluding warmup and sampling, the Stan model for this study took over\nan hour to run. Most of the sampling iterations for this study had larger\ntree depths than in the other studies, meaning that the number of gra-\ndient evaluations involved in sampling was roughly higher by a factor of\n2 or more [40, Section 15.2 of Reference Manual]. This is likely a conse-\nquence of posterior geometry, and the way in which the samplers adapt\nto it during warmup. However, it should be noted that we deliberately\nused a liberal number of warmup iterations, and chains appeared to have\nconverged to the “typical set” [6] well before sampling began (not shown).\nNote also that the smallest eﬀective sample size is over twice as large as\nthe threshold of 400 recommended by Vehtari et al. [44] Therefore, rea-\nsonable posterior inference with acceptable computation time could likely\nbe achieved by reducing the number of warmup and sampling iterations,\nprovided the latter did not induce problematic ˆR values.\nFinally, recall from Section 4 that estimates of the regression variance,\nσY , are biased upward in “naive” regression models, and this fact can\nbe used to check whether or not FRODO is recovering “true” regression\nrelationships. For each simulation study, Table 2 shows the true value of\nσY , as well as the posterior mean and 95% credible interval for this pa-\nrameter from FRODO, the hierarchical scalar model, and the naive scalar\nmodel (see the beginning of Section 4). The endpoints posterior intervals\nare simply 0.025- and 0.975-quantiles from the HMC samples. For almost\nevery simulation study, the FRODO estimate for σY is much closer to the\ntrue value than the estimate from the naive model. The sole exception is\nthe example of Section 4.5, with Beta-distributed covariates and a nonlin-\near regression structure, for which all models produce accurate estimates\nof σY . Recall, however, that the large group sizes in this example rendered\nbias in the naive model negligible.\n38\nReferences\n[1] J. Aitchison and S. M. Shen. Logistic-normal distributions: Some\nproperties and uses. Biometrika, 67(2):261–272, 1980. doi: 10.2307/\n2335470.\n[2] Adalgiso Amendola, Cristian Barra, and Roberto Zotti. Does gradu-\nate human capital production increase local economic development?\nAn instrumental variable approach. Journal of Regional Science, 60\n(5):959–994, 2020. doi: 10.1111/jors.12490.\n[3] Margot Bennink, Marcel A. Croon, and Jeroen K. Vermunt. Micro-\nMacro Multilevel Analysis for Discrete Data:\nA Latent Variable\nApproach and an Application on Personal Network Data.\nSoci-\nological Methods & Research, 42(4):431–457, 2013.\ndoi: 10.1177/\n0049124113500479.\n[4] Margot Bennink, Marcel A. Croon, Brigitte Kroon, and Jeroen K.\nVermunt. Micro-macro multilevel latent class models with multiple\ndiscrete individual-level variables.\nAdvances in Data Analysis and\nClassiﬁcation, 10:139–154, 2016. doi: 10.1007/s11634-016-0234-1.\n[5] Michael\nBetancourt.\nHow\nthe\nshape\nof\na\nweakly\ninformative\nprior\naﬀects\ninferences,\n2017.\nURL\nhttps://mc-stan.org/users/documentation/case-studies/weakly_informative_shapes.\n[6] Michael\nBetancourt.\nA\nConceptual\nintroduction\nto\nHamiltonian\nMonte\nCarlo,\n2017.\nPreprint\nat\nhttps://arxiv.org/abs/1701.02434v2.\n[7] John P Buonaccorsi. Measurement error: models, methods, and ap-\nplications. Chapman and Hall/CRC, Boca Raton, 2010.\n[8] Bob Carpenter, Andrew Gelman, Matthew D. Hoﬀman, Daniel Lee,\nBen Goodrich, Michael Betancourt, Marcus Brubaker, Jiqiang Guo,\nPeter Li, and Allen Riddell.\nStan: A probabilistic programming\nlanguage. Journal of statistical software, 76(1), 2017. doi: 10.18637/\njss.v076.i01.\n[9] Raymond J. Carroll, David Ruppert, Leonard A. Stefanski, and\nCiprian M. Crainiceanu. Measurement Error in Nonlinear Models.\nChapman and Hall/CRC, London, 2006.\n[10] Ciprian M. Crainiceanu and A. Jeﬀrey Goldsmith. Bayesian Func-\ntional Data Analysis Using WinBUGS. Journal Of Statistical Soft-\nware, 32(11):195, 2010. doi: 10.1103/PhysRevLett.106.107404.\n[11] Marcel A. Croon and Marc J.P.M. van Veldhoven. Predicting group-\nlevel outcome variables from variables measured at the individual\nlevel: A latent variable multilevel model. Psychological Methods, 12\n(1):45–57, 2007. doi: 10.1037/1082-989X.12.1.45.\n39\n[12] Oumou Salama Daouda, Mounia N. Hocine, and Laura Temime. De-\nterminants of healthcare worker turnover in intensive care units: A\nmicro-macro multilevel analysis. Plos One, 16(5):1–13, 2021. doi:\n10.1371/journal.pone.0251779.\n[13] Paul H. C. Eilers and Brian D. Marx. Flexible Smoothing with B-\nsplines and Penalties. Statistical Science, 11(2):89–121, 1996. doi:\n10.1214/ss/1038425655.\n[14] Lynn Foster-Johnson and Jeﬀrey D. Kromrey. Predicting group-level\noutcome variables: An empirical comparison of analysis strategies.\nBehavior Research Methods, 50(6):2461–2479, 2018. doi: 10.3758/\nS13428-018-1025-8.\n[15] Andrew Gelman.\nPrior distributions for variance parameters in\nhierarchical models.\nBayesian Analysis, 1(3):515–533, 2006.\ndoi:\n10.1214/06-BA117A.\n[16] Andrew Gelman and Donald B. Rubin. Inference from Iterative Sim-\nulation Using Multiple Sequences. Statistical Science, 7(4):457 – 472,\n1992. doi: 10.1214/ss/1177011136.\n[17] Andrew Gelman, John B. Carlin, Hal S. Stern, David B. Dunson, Aki\nVehtari, and Donald B. Rubin. Bayesian Data Analysis. Chapman\nand Hall/CRC, Boca Raton, third edition, 2013.\n[18] Harvey Goldstein. Multilevel statistical models. John Wiley & Sons,\nChichester, fourth edition, 2010. ISBN 9780470973400.\n[19] Bruce E. Hansen. 5Nonparametric Sieve Regression: Least Squares,\nAveraging Least Squares, and Cross-Validation.\nIn The Oxford\nHandbook of Applied Nonparametric and Semiparametric Econo-\nmetrics and Statistics. Oxford University Press, 02 2014.\nISBN\n9780199857944. doi: 10.1093/oxfordhb/9780199857944.013.008.\n[20] Matthew D. Hoﬀman and Andrew Gelman. The No-U-Turn Sam-\npler: Adaptively Setting Path Lengths in Hamiltonian Monte Carlo.\nJournal of Machine Learning Research, 15(1):1593–1623, 2014.\n[21] Cheng Hsiao.\nConsistent estimation for some nonlinear errors-in-\nvariables models. Journal of Econometrics, 41(1):159–185, 1989. doi:\n10.1016/0304-4076(89)90047-X.\n[22] Yingyao Hu and Susanne M. Schennach.\nInstrumental Variable\nTreatment of Nonclassical Measurement Error Models. Economet-\nrica, 76(1):195–216, 2008. doi: 10.1111/j.0012-9682.2008.00823.x.\n[23] Philippe Lambert and Paul H. C. Eilers. Bayesian multi-dimensional\ndensity estimation with P-splines. In John Hinde, Jochen Einbeck,\nand John Newell, editors, Proceedings of the 21st International Work-\nshop on Statistical Modelling, pages 313–320, 2006.\n40\n[24] Stefan Lang and Andreas Brezger. Bayesian P-Splines. Journal of\nComputational and Graphical Statistics, 13(1):183–212, 2004.\ndoi:\n10.1198/1061860043010.\n[25] Tong Li.\nRobust and consistent estimation of nonlinear errors-in-\nvariables models. Journal of Econometrics, 110(1):1–26, 2002. doi:\n0.1016/S0304-4076(02)00120-3.\n[26] Zheyuan Li and Jiguo Cao. General P-Splines for Non-Uniform B-\nSplines, 2022. Preprint at https://arxiv.org/abs/2201.06808v2.\n[27] Jackson G Lu, Elizabeth Page-Gould, and Nancy R Xu.\nMicro-\nMacroMultilevel: Micro-Macro Multilevel Modeling, 2017. R package\nversion 0.4.0.\n[28] Shaun McDonald. Novel approaches to uncertainty quantiﬁcation in\nnonparametric settings. PhD thesis, 2022.\n[29] Finbarr O’Sullivan.\nFast Computation of Fully Automated Log-\nDensity and Log-Hazard Estimators. SIAM Journal on Scientiﬁc and\nStatistical Computing, 9(2):363–379, 1988. doi: 10.1137/0909024.\n[30] Trevor Park and George Casella. The Bayesian Lasso. Journal of\nthe American Statistical Association, 103(482):681–686, 2008. doi:\n10.1198/016214508000000337.\n[31] R Core Team. R: A Language and Environment for Statistical Com-\nputing. R Foundation for Statistical Computing, Vienna, Austria,\n2020.\n[32] James O. Ramsay and Bernard W. Siverman. Functional Data Anal-\nysis. Springer Series in Statistics. Springer, New York, 2005.\n[33] Sylvia Richardson and Walter R. Gilks.\nConditional Indepen-\ndence Models for Epidemiological Studies with Covariate Measure-\nment Error.\nStatistics in Medicine, 12(18):1703–1722, 1993.\ndoi:\n10.1002/sim.4780121806.\n[34] Judith Rousseau.\nOn the Frequentist Properties of Bayesian\nNonparametric\nMethods.\nThe\nAnnual\nReview\nof\nStatis-\ntics\nand\nIts\nApplications,\n3:211–231,\n2016.\ndoi:\n10.1146/\nannurev-statistics-041715-033523.\n[35] Abhra Sarkar, Bani K. Mallick, and Raymond J. Carroll. Bayesian\nSemiparametric Regression in the Presence of Conditionally Het-\neroscedastic Measurement and Regression Errors. Biometrics, 70(4):\n823–834, 2014. doi: 10.1111/biom.12197.\n[36] Susanne M. Schennach. Recent Advances in the Measurement Error\nLiterature. Annual Review of Economics, 8:341–377, 2016. doi: 10.\n1146/annurev-economics-080315-015058.\n41\n[37] Paulo Serra and Tatyana Krivobokova. Adaptive Empirical Bayesian\nSmoothing Splines. Bayesian Analysis, 12(1):219 – 238, 2017. doi:\n10.1214/16-BA997.\n[38] B.W. Silverman. On the Estimation of a Probability Density Func-\ntion by the Maximum Penalized Likelihood Method. The Annals of\nStatistics, 10(3):795–810, 1982. doi: 10.1214/aos/1176345872.\n[39] Tom A. B. Snijders and Roel J. Bosker.\nMultilevel analysis: An\nintroduction to basic and advanced multilevel modeling. SAGE Pub-\nlications Ltd., Los Angeles, 2011.\n[40] Stan Development Team. Stan modeling language users guide and\nreference manual, version 2.30.0, 2018.\n[41] Stan Development Team. RStan: the R interface to Stan, 2021. R\npackage version 2.21.3.\n[42] Mark A. van de Wiel, Dennis E. Te Beest, and Magnus M. M¨unch.\nLearning from a lot: Empirical Bayes for high-dimensional model-\nbased prediction.\nScandinavian Journal of Statistics, 46(1):2–25,\n2019. doi: 10.1111/sjos.12335.\n[43] Mahesh K. Varanasi and Behnaam Aazhang. Parametric generalized\ngaussian density estimation. The Journal of the Acoustical Society of\nAmerica, 86(4):1404–1415, 1989. doi: 10.1121/1.398700.\n[44] Aki Vehtari, Andrew Gelman, Daniel Simpson, Bob Carpenter,\nand Paul-Christian B¨urkner. Rank-normalization, folding, and lo-\ncalization:\nan improved\nˆR for assessing convergence of MCMC\n(with discussion).\nBayesian analysis, 16(2):667–718, 2021.\ndoi:\n10.1214/20-BA1221.\n42\n"}